Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.9.117/samv71b/atdf/ATSAMV71N21B.atdf
               <instance name="PIOD">
                  <register-group address-space="base"
                                  name="PIOD"
                                  name-in-module="PIO"
                                  offset="0x400E1400"/>
                  <signals>
                     <signal group="P" index="96" function="default" pad="PD0"/>
                     <signal group="P" index="97" function="default" pad="PD1"/>
                     <signal group="P" index="98" function="default" pad="PD2"/>
                     <signal group="P" index="99" function="default" pad="PD3"/>
                     <signal group="P" index="100" function="default" pad="PD4"/>
                     <signal group="P" index="101" function="default" pad="PD5"/>
                     <signal group="P" index="102" function="default" pad="PD6"/>
                     <signal group="P" index="103" function="default" pad="PD7"/>
                     <signal group="P" index="104" function="default" pad="PD8"/>
                     <signal group="P" index="105" function="default" pad="PD9"/>
                     <signal group="P" index="106" function="default" pad="PD10"/>
                     <signal group="P" index="107" function="default" pad="PD11"/>
                     <signal group="P" index="108" function="default" pad="PD12"/>
                     <signal group="P" index="109" function="default" pad="PD13"/>
                     <signal group="P" index="110" function="default" pad="PD14"/>
                     <signal group="P" index="111" function="default" pad="PD15"/>
                     <signal group="P" index="112" function="default" pad="PD16"/>
                     <signal group="P" index="113" function="default" pad="PD17"/>
                     <signal group="P" index="114" function="default" pad="PD18"/>
                     <signal group="P" index="115" function="default" pad="PD19"/>
                     <signal group="P" index="116" function="default" pad="PD20"/>
                     <signal group="P" index="117" function="default" pad="PD21"/>
                     <signal group="P" index="118" function="default" pad="PD22"/>
                     <signal group="P" index="119" function="default" pad="PD23"/>
                     <signal group="P" index="120" function="default" pad="PD24"/>
                     <signal group="P" index="121" function="default" pad="PD25"/>
                     <signal group="P" index="122" function="default" pad="PD26"/>
                     <signal group="P" index="123" function="default" pad="PD27"/>
                     <signal group="P" index="124" function="default" pad="PD28"/>
                     <signal group="P" index="125" function="default" pad="PD29"/>
                     <signal group="P" index="126" function="default" pad="PD30"/>
                     <signal group="P" index="127" function="default" pad="PD31"/>
                  </signals>
                  <parameters>
                     <param name="INSTANCE_ID" value="16"/>
                     <param name="CLOCK_ID" value="16"/>
                  </parameters>
               </instance>
            </module>
            <module name="PMC" id="44006" version="P">
               <instance name="PMC">
                  <register-group address-space="base"
                                  name="PMC"
                                  name-in-module="PMC"
                                  offset="0x400E0600"/>
                  <signals>
                     <signal pad="PA6" function="B" group="PCK" index="0"/>
                     <signal pad="PB12" function="D" group="PCK" index="0"/>
                     <signal pad="PB13" function="B" group="PCK" index="0"/>
                     <signal pad="PA17" function="B" group="PCK" index="1"/>
                     <signal pad="PA21" function="B" group="PCK" index="1"/>
                     <signal pad="PA3" function="C" group="PCK" index="2"/>
                     <signal pad="PA18" function="B" group="PCK" index="2"/>
                     <signal pad="PA31" function="B" group="PCK" index="2"/>
                     <signal pad="PB3" function="B" group="PCK" index="2"/>
                     <signal pad="PD31" function="C" group="PCK" index="2"/>
                     <signal pad="PB9" function="X1" group="XIN"/>
                     <signal pad="PB8" function="X1" group="XOUT"/>
                     <signal pad="PA7" function="X1" group="XIN32"/>
                     <signal pad="PA8" function="X1" group="XOUT32"/>
                  </signals>
                  <parameters>
                     <param name="INSTANCE_ID" value="5"/>
                  </parameters>
               </instance>
            </module>
            <module name="PWM" id="6343" version="Y">
               <instance name="PWM0">
                  <register-group address-space="base"
                                  name="PWM0"
                                  name-in-module="PWM"
                                  offset="0x40020000"/>
                  <signals>
                     <signal pad="PA10" function="B" group="PWMEXTRG" index="0"/>
                     <signal pad="PA22" function="B" group="PWMEXTRG" index="1"/>
                     <signal pad="PA9" function="C" group="PWMFI" index="0"/>
                     <signal pad="PD8" function="B" group="PWMFI" index="1"/>
                     <signal pad="PD9" function="B" group="PWMFI" index="2"/>
                     <signal pad="PA0" function="A" group="PWMH" index="0"/>
                     <signal pad="PA11" function="B" group="PWMH" index="0"/>
                     <signal pad="PA23" function="B" group="PWMH" index="0"/>
                     <signal pad="PB0" function="A" group="PWMH" index="0"/>
                     <signal pad="PD11" function="B" group="PWMH" index="0"/>
                     <signal pad="PD20" function="A" group="PWMH" index="0"/>
                     <signal pad="PA2" function="A" group="PWMH" index="1"/>
                     <signal pad="PA12" function="B" group="PWMH" index="1"/>
                     <signal pad="PA24" function="B" group="PWMH" index="1"/>
                     <signal pad="PB1" function="A" group="PWMH" index="1"/>
                     <signal pad="PD21" function="A" group="PWMH" index="1"/>
                     <signal pad="PA13" function="B" group="PWMH" index="2"/>
                     <signal pad="PA25" function="B" group="PWMH" index="2"/>
                     <signal pad="PB4" function="B" group="PWMH" index="2"/>
                     <signal pad="PD22" function="A" group="PWMH" index="2"/>
                     <signal pad="PA7" function="B" group="PWMH" index="3"/>
                     <signal pad="PA14" function="B" group="PWMH" index="3"/>
                     <signal pad="PA17" function="C" group="PWMH" index="3"/>
                     <signal pad="PD23" function="A" group="PWMH" index="3"/>
                     <signal pad="PA1" function="A" group="PWML" index="0"/>
                     <signal pad="PA19" function="B" group="PWML" index="0"/>
                     <signal pad="PB5" function="B" group="PWML" index="0"/>
                     <signal pad="PD10" function="B" group="PWML" index="0"/>
                     <signal pad="PD24" function="A" group="PWML" index="0"/>
                     <signal pad="PA20" function="B" group="PWML" index="1"/>
                     <signal pad="PB12" function="A" group="PWML" index="1"/>
                     <signal pad="PD25" function="A" group="PWML" index="1"/>
                     <signal pad="PA16" function="C" group="PWML" index="2"/>
                     <signal pad="PA30" function="A" group="PWML" index="2"/>
                     <signal pad="PB13" function="A" group="PWML" index="2"/>
                     <signal pad="PD26" function="A" group="PWML" index="2"/>
                     <signal pad="PA15" function="C" group="PWML" index="3"/>
                     <signal pad="PD27" function="A" group="PWML" index="3"/>
                  </signals>
                  <parameters>
                     <param name="DMAC_ID_TX" value="13"/>
                     <param name="INSTANCE_ID" value="31"/>
                     <param name="CLOCK_ID" value="31"/>
                     <param name="FAULT_PWM_ID0"
                            value="0x0"
                            caption="Fault 0 - PWM0_PWMFI0 Input pin"/>
                     <param name="FAULT_PWM_ID1"
                            value="0x1"
                            caption="Fault 1 - PWM0_PWMFI1 Input pin"/>
                     <param name="FAULT_PWM_ID2"
                            value="0x2"
                            caption="Fault 2 - PWM0_PWMFI2 Input pin"/>
                     <param name="FAULT_PWM_ID3" value="0x3" caption="Fault 3 - MAIN_OSC_PMC"/>
                     <param name="FAULT_PWM_ID4" value="0x4" caption="Fault 4 - AFEC0"/>
                     <param name="FAULT_PWM_ID5" value="0x5" caption="Fault 5 - AFEC1"/>
                     <param name="FAULT_PWM_ID6" value="0x6" caption="Fault 6 - ACC"/>
                     <param name="FAULT_PWM_ID7" value="0x7" caption="Fault 7 - TC0"/>
                  </parameters>
               </instance>
               <instance name="PWM1">
                  <register-group address-space="base"
                                  name="PWM1"
                                  name-in-module="PWM"
                                  offset="0x4005C000"/>
                  <signals>
                     <signal pad="PA30" function="B" group="PWMEXTRG" index="0"/>
                     <signal pad="PA18" function="A" group="PWMEXTRG" index="1"/>
                     <signal pad="PA21" function="C" group="PWMFI" index="0"/>
                     <signal pad="PA26" function="D" group="PWMFI" index="1"/>
                     <signal pad="PA28" function="D" group="PWMFI" index="2"/>
                     <signal pad="PA12" function="C" group="PWMH" index="0"/>
                     <signal pad="PD1" function="B" group="PWMH" index="0"/>
                     <signal pad="PA14" function="C" group="PWMH" index="1"/>
                     <signal pad="PD3" function="B" group="PWMH" index="1"/>
                     <signal pad="PA31" function="D" group="PWMH" index="2"/>
                     <signal pad="PD5" function="B" group="PWMH" index="2"/>
                     <signal pad="PA8" function="A" group="PWMH" index="3"/>
                     <signal pad="PD7" function="B" group="PWMH" index="3"/>
                     <signal pad="PA11" function="C" group="PWML" index="0"/>
                     <signal pad="PD0" function="B" group="PWML" index="0"/>
                     <signal pad="PA13" function="C" group="PWML" index="1"/>
                     <signal pad="PD2" function="B" group="PWML" index="1"/>
                     <signal pad="PA23" function="D" group="PWML" index="2"/>
                     <signal pad="PD4" function="B" group="PWML" index="2"/>
                     <signal pad="PA5" function="A" group="PWML" index="3"/>
                     <signal pad="PD6" function="B" group="PWML" index="3"/>
                  </signals>
                  <parameters>
                     <param name="DMAC_ID_TX" value="39"/>
                     <param name="INSTANCE_ID" value="60"/>
                     <param name="CLOCK_ID" value="60"/>
                     <param name="FAULT_PWM_ID0"
                            value="0x0"
                            caption="Fault 0 - PWM0_PWMFI0 Input pin"/>
                     <param name="FAULT_PWM_ID1"
                            value="0x1"
                            caption="Fault 1 - PWM0_PWMFI1 Input pin"/>
                     <param name="FAULT_PWM_ID2"
                            value="0x2"
                            caption="Fault 2 - PWM0_PWMFI2 Input pin"/>
                     <param name="FAULT_PWM_ID3" value="0x3" caption="Fault 3 - MAIN_OSC_PMC"/>
                     <param name="FAULT_PWM_ID4" value="0x4" caption="Fault 4 - AFEC0"/>
                     <param name="FAULT_PWM_ID5" value="0x5" caption="Fault 5 - AFEC1"/>
                     <param name="FAULT_PWM_ID6" value="0x6" caption="Fault 6 - ACC"/>
                     <param name="FAULT_PWM_ID7" value="0x7" caption="Fault 7 - TC1"/>
                  </parameters>
               </instance>
            </module>
            <module name="QSPI" id="11171" version="J">
               <instance name="QSPI">
                  <register-group address-space="base"
                                  name="QSPI"
                                  name-in-module="QSPI"
                                  offset="0x4007C000"/>
                  <signals>
                     <signal pad="PA11" function="A" group="QCS"/>
                     <signal pad="PA13" function="A" group="QIO" index="0"/>
                     <signal pad="PA12" function="A" group="QIO" index="1"/>
                     <signal pad="PA17" function="A" group="QIO" index="2"/>
                     <signal pad="PD31" function="A" group="QIO" index="3"/>
                     <signal pad="PA14" function="A" group="QSCK"/>
                  </signals>
                  <parameters>
                     <param name="DMAC_ID_RX" value="6"/>
                     <param name="DMAC_ID_TX" value="5"/>
                     <param name="INSTANCE_ID" value="43"/>
                     <param name="CLOCK_ID" value="43"/>
                  </parameters>
               </instance>
            </module>
            <module name="RSTC" id="11009" version="N">
               <instance name="RSTC">
                  <register-group address-space="base"
                                  name="RSTC"
                                  name-in-module="RSTC"
                                  offset="0x400E1800"/>
                  <parameters>
                     <param name="INSTANCE_ID" value="1"/>
                  </parameters>
               </instance>
            </module>
            <module name="RSWDT" id="11110" version="G">
               <instance name="RSWDT">
                  <register-group address-space="base"
                                  name="RSWDT"
                                  name-in-module="RSWDT"
                                  offset="0x400E1900"/>
                  <parameters>
                     <param name="INSTANCE_ID" value="63"/>
                  </parameters>
               </instance>
            </module>
