Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.9.117/samv71b/atdf/ATSAMV71N21B.atdf
            <module name="RTC" id="6056" version="ZB">
               <instance name="RTC">
                  <register-group address-space="base"
                                  name="RTC"
                                  name-in-module="RTC"
                                  offset="0x400E1860"/>
                  <parameters>
                     <param name="INSTANCE_ID" value="2"/>
                  </parameters>
                  <signals>
                     <signal pad="PB0" function="X1" group="RTCOUT" index="0"/>
                     <signal pad="PB1" function="X1" group="RTCOUT" index="1"/>
                  </signals>
               </instance>
            </module>
            <module name="RTT" id="6081" version="M">
               <instance name="RTT">
                  <register-group address-space="base"
                                  name="RTT"
                                  name-in-module="RTT"
                                  offset="0x400E1830"/>
                  <parameters>
                     <param name="INSTANCE_ID" value="3"/>
                  </parameters>
               </instance>
            </module>
            <module name="SPI" id="6088" version="ZM">
               <instance name="SPI0">
                  <register-group address-space="base"
                                  name="SPI0"
                                  name-in-module="SPI"
                                  offset="0x40008000"/>
                  <signals>
                     <signal pad="PD20" function="B" group="MISO"/>
                     <signal pad="PD21" function="B" group="MOSI"/>
                     <signal pad="PB2" function="D" group="NPCS" index="0"/>
                     <signal pad="PA31" function="A" group="NPCS" index="1"/>
                     <signal pad="PD25" function="B" group="NPCS" index="1"/>
                     <signal pad="PD12" function="C" group="NPCS" index="2"/>
                     <signal pad="PD27" function="B" group="NPCS" index="3"/>
                     <signal pad="PD22" function="B" group="SPCK"/>
                  </signals>
                  <parameters>
                     <param name="DMAC_ID_RX" value="2"/>
                     <param name="DMAC_ID_TX" value="1"/>
                     <param name="INSTANCE_ID" value="21"/>
                     <param name="CLOCK_ID" value="21"/>
                  </parameters>
               </instance>
            </module>
            <module name="SSC" id="6078" version="Q">
               <instance name="SSC">
                  <register-group address-space="base"
                                  name="SSC"
                                  name-in-module="SSC"
                                  offset="0x40004000"/>
                  <signals>
                     <signal pad="PA10" function="C" group="RD"/>
                     <signal pad="PD24" function="B" group="RF"/>
                     <signal pad="PA22" function="A" group="RK"/>
                     <signal pad="PB5" function="D" group="TD"/>
                     <signal pad="PD10" function="C" group="TD"/>
                     <signal pad="PD26" function="B" group="TD"/>
                     <signal pad="PB0" function="D" group="TF"/>
                     <signal pad="PB1" function="D" group="TK"/>
                  </signals>
                  <parameters>
                     <param name="DMAC_ID_RX" value="33"/>
                     <param name="DMAC_ID_TX" value="32"/>
                     <param name="INSTANCE_ID" value="22"/>
                     <param name="CLOCK_ID" value="22"/>
                  </parameters>
               </instance>
            </module>
            <module name="SUPC" id="6452" version="ZE">
               <instance name="SUPC">
                  <register-group address-space="base"
                                  name="SUPC"
                                  name-in-module="SUPC"
                                  offset="0x400E1810"/>
                  <signals>
                     <signal pad="PA0" function="X1" group="WKUP" index="0"/>
                     <signal pad="PA1" function="X1" group="WKUP" index="1"/>
                     <signal pad="PA2" function="X1" group="WKUP" index="2"/>
                     <signal pad="PA4" function="X1" group="WKUP" index="3"/>
                     <signal pad="PA5" function="X1" group="WKUP" index="4"/>
                     <signal pad="PA9" function="X1" group="WKUP" index="6"/>
                     <signal pad="PA11" function="X1" group="WKUP" index="7"/>
                     <signal pad="PA14" function="X1" group="WKUP" index="8"/>
                     <signal pad="PA19" function="X1" group="WKUP" index="9"/>
                     <signal pad="PA20" function="X1" group="WKUP" index="10"/>
                     <signal pad="PA30" function="X1" group="WKUP" index="11"/>
                     <signal pad="PB3" function="X1" group="WKUP" index="12"/>
                     <signal pad="PB5" function="X1" group="WKUP" index="13"/>
                     <signal pad="PD28" function="X1" group="WKUP" index="5"/>
                  </signals>
                  <parameters>
                     <param name="INSTANCE_ID" value="0"/>
                  </parameters>
               </instance>
            </module>
            <module name="TC" id="6082" version="ZL">
               <instance name="TC0">
                  <register-group address-space="base"
                                  name="TC0"
                                  name-in-module="TC"
                                  offset="0x4000C000"/>
                  <signals>
                     <signal pad="PA4" function="B" group="TCLK" index="0"/>
                     <signal pad="PA28" function="B" group="TCLK" index="1"/>
                     <signal pad="PA29" function="B" group="TCLK" index="2"/>
                     <signal pad="PA0" function="B" group="TIOA" index="0"/>
                     <signal pad="PA15" function="B" group="TIOA" index="1"/>
                     <signal pad="PA26" function="B" group="TIOA" index="2"/>
                     <signal pad="PA1" function="B" group="TIOB" index="0"/>
                     <signal pad="PA16" function="B" group="TIOB" index="1"/>
                     <signal pad="PA27" function="B" group="TIOB" index="2"/>
                  </signals>
                  <parameters>
                     <param name="DMAC_ID_RX" value="40"/>
                     <param name="INSTANCE_ID_CHANNEL0" value="23"/>
                     <param name="INSTANCE_ID_CHANNEL1" value="24"/>
                     <param name="INSTANCE_ID_CHANNEL2" value="25"/>
                     <param name="CLOCK_ID_CHANNEL0" value="23"/>
                     <param name="CLOCK_ID_CHANNEL1" value="24"/>
                     <param name="CLOCK_ID_CHANNEL2" value="25"/>
                     <param name="TCCLKS_" value="0" caption="MCK"/>
                     <param name="TCCLKS_TIMER_CLOCK1" value="1" caption="PCK"/>
                     <param name="TCCLKS_TIMER_CLOCK2" value="2" caption="MCK/8"/>
                     <param name="TCCLKS_TIMER_CLOCK3" value="3" caption="MCK/32"/>
                     <param name="TCCLKS_TIMER_CLOCK4" value="4" caption="MCK/128"/>
                     <param name="TCCLKS_TIMER_CLOCK5" value="5" caption="SLCK"/>
                     <param name="TCCLKS_XC0" value="6" caption="XC0"/>
                     <param name="TCCLKS_XC1" value="7" caption="XC1"/>
                     <param name="TCCLKS_XC2" value="8" caption="XC2"/>
                     <param name="NUM_INTERRUPT_LINES" value="3"/>
                     <param name="TIMER_WIDTH" value="16"/>
                  </parameters>
               </instance>
               <instance name="TC1">
                  <register-group address-space="base"
                                  name="TC1"
                                  name-in-module="TC"
                                  offset="0x40010000"/>
                  <signals>
            </signals>
                  <parameters>
                     <param name="DMAC_ID_RX" value="41"/>
                     <param name="INSTANCE_ID_CHANNEL0" value="26"/>
                     <param name="INSTANCE_ID_CHANNEL1" value="27"/>
                     <param name="INSTANCE_ID_CHANNEL2" value="28"/>
                     <param name="CLOCK_ID_CHANNEL0" value="26"/>
                     <param name="CLOCK_ID_CHANNEL1" value="27"/>
                     <param name="CLOCK_ID_CHANNEL2" value="28"/>
                     <param name="TCCLKS_" value="0" caption="MCK"/>
                     <param name="TCCLKS_TIMER_CLOCK1" value="1" caption="PCK6"/>
                     <param name="TCCLKS_TIMER_CLOCK2" value="2" caption="MCK/8"/>
                     <param name="TCCLKS_TIMER_CLOCK3" value="3" caption="MCK/32"/>
                     <param name="TCCLKS_TIMER_CLOCK4" value="4" caption="MCK/128"/>
                     <param name="TCCLKS_TIMER_CLOCK5" value="5" caption="SLCK"/>
                     <param name="TCCLKS_XC0" value="6" caption="XC0"/>
                     <param name="TCCLKS_XC1" value="7" caption="XC1"/>
                     <param name="TCCLKS_XC2" value="8" caption="XC2"/>
                     <param name="NUM_INTERRUPT_LINES" value="3"/>
                     <param name="TIMER_WIDTH" value="16"/>
                  </parameters>
               </instance>
               <instance name="TC2">
                  <register-group address-space="base"
                                  name="TC2"
                                  name-in-module="TC"
                                  offset="0x40014000"/>
                  <signals>
            </signals>
                  <parameters>
                     <param name="DMAC_ID_RX" value="42"/>
                     <param name="INSTANCE_ID_CHANNEL0" value="47"/>
                     <param name="INSTANCE_ID_CHANNEL1" value="48"/>
                     <param name="INSTANCE_ID_CHANNEL2" value="49"/>
                     <param name="CLOCK_ID_CHANNEL0" value="47"/>
                     <param name="CLOCK_ID_CHANNEL1" value="48"/>
                     <param name="CLOCK_ID_CHANNEL2" value="49"/>
                     <param name="TCCLKS_" value="0" caption="MCK"/>
                     <param name="TCCLKS_TIMER_CLOCK1" value="1" caption="PCK6"/>
                     <param name="TCCLKS_TIMER_CLOCK2" value="2" caption="MCK/8"/>
                     <param name="TCCLKS_TIMER_CLOCK3" value="3" caption="MCK/32"/>
                     <param name="TCCLKS_TIMER_CLOCK4" value="4" caption="MCK/128"/>
                     <param name="TCCLKS_TIMER_CLOCK5" value="5" caption="SLCK"/>
                     <param name="TCCLKS_XC0" value="6" caption="XC0"/>
                     <param name="TCCLKS_XC1" value="7" caption="XC1"/>
                     <param name="TCCLKS_XC2" value="8" caption="XC2"/>
                     <param name="NUM_INTERRUPT_LINES" value="3"/>
                     <param name="TIMER_WIDTH" value="16"/>
                  </parameters>
               </instance>
               <instance name="TC3">
                  <register-group address-space="base"
                                  name="TC3"
                                  name-in-module="TC"
                                  offset="0x40054000"/>
                  <signals>
                     <signal pad="PD24" function="C" group="TCLK" index="11"/>
                     <signal pad="PD21" function="C" group="TIOA" index="11"/>
                     <signal pad="PD22" function="C" group="TIOB" index="11"/>
                  </signals>
                  <parameters>
                     <param name="DMAC_ID_RX" value="43"/>
                     <param name="INSTANCE_ID_CHANNEL0" value="50"/>
                     <param name="INSTANCE_ID_CHANNEL1" value="51"/>
                     <param name="INSTANCE_ID_CHANNEL2" value="52"/>
                     <param name="CLOCK_ID_CHANNEL0" value="50"/>
                     <param name="CLOCK_ID_CHANNEL1" value="51"/>
                     <param name="CLOCK_ID_CHANNEL2" value="52"/>
                     <param name="TCCLKS_" value="0" caption="MCK"/>
                     <param name="TCCLKS_TIMER_CLOCK1" value="1" caption="PCK6"/>
                     <param name="TCCLKS_TIMER_CLOCK2" value="2" caption="MCK/8"/>
                     <param name="TCCLKS_TIMER_CLOCK3" value="3" caption="MCK/32"/>
                     <param name="TCCLKS_TIMER_CLOCK4" value="4" caption="MCK/128"/>
                     <param name="TCCLKS_TIMER_CLOCK5" value="5" caption="SLCK"/>
                     <param name="TCCLKS_XC0" value="6" caption="XC0"/>
                     <param name="TCCLKS_XC1" value="7" caption="XC1"/>
                     <param name="TCCLKS_XC2" value="8" caption="XC2"/>
                     <param name="NUM_INTERRUPT_LINES" value="3"/>
                     <param name="TIMER_WIDTH" value="16"/>
                  </parameters>
               </instance>
            </module>
            <module name="TRNG" id="6334" version="G">
               <instance name="TRNG">
                  <register-group address-space="base"
                                  name="TRNG"
                                  name-in-module="TRNG"
                                  offset="0x40070000"/>
                  <parameters>
                     <param name="INSTANCE_ID" value="57"/>
                     <param name="CLOCK_ID" value="57"/>
                  </parameters>
               </instance>
            </module>
            <module name="TWIHS" id="11210" version="Z">
               <instance name="TWIHS0">
                  <register-group address-space="base"
                                  name="TWIHS0"
                                  name-in-module="TWIHS"
                                  offset="0x40018000"/>
                  <signals>
                     <signal pad="PA4" function="A" group="TWCK" index="0"/>
                     <signal pad="PA3" function="A" group="TWD" index="0"/>
                  </signals>
                  <parameters>
                     <param name="DMAC_ID_RX" value="15"/>
                     <param name="DMAC_ID_TX" value="14"/>
                     <param name="INSTANCE_ID" value="19"/>
                     <param name="CLOCK_ID" value="19"/>
                  </parameters>
               </instance>
               <instance name="TWIHS1">
                  <register-group address-space="base"
                                  name="TWIHS1"
                                  name-in-module="TWIHS"
                                  offset="0x4001C000"/>
                  <signals>
                     <signal pad="PB5" function="A" group="TWCK" index="1"/>
                     <signal pad="PB4" function="A" group="TWD" index="1"/>
                  </signals>
                  <parameters>
                     <param name="DMAC_ID_RX" value="17"/>
                     <param name="DMAC_ID_TX" value="16"/>
                     <param name="INSTANCE_ID" value="20"/>
                     <param name="CLOCK_ID" value="20"/>
                  </parameters>
               </instance>
