Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.9.117/samv71b/atdf/ATSAMV71N21B.atdf
         <value-group caption="" name="EEFC_FCR__FKEY">
            <value caption="The 0x5A value enables the command defined by the bits of the register. If the field is written with a different value, the write is not performed and no action is started."
                   name="PASSWD"
                   value="0x5A"/>
         </value-group>
         <value-group caption="" name="EEFC_WPMR__WPKEY">
            <value caption="Writing any other value in this field aborts the write operation.Always reads as 0."
                   name="PASSWD"
                   value="0x454643"/>
         </value-group>
      </module>
      <module name="GMAC"
              caption="Gigabit Ethernet MAC"
              id="11046"
              version="S">
         <register-group name="GMAC_SA" size="8">
            <register caption="Specific Address 1 Bottom Register"
                      name="GMAC_SAB"
                      offset="0x00"
                      rw="RW"
                      size="4">
               <bitfield caption="Specific Address 1" mask="0xFFFFFFFF" name="ADDR"/>
            </register>
            <register caption="Specific Address 1 Top Register"
                      name="GMAC_SAT"
                      offset="0x04"
                      rw="RW"
                      size="4">
               <bitfield caption="Specific Address 1" mask="0x0000FFFF" name="ADDR"/>
            </register>
         </register-group>
         <register-group name="GMAC_ST2CW" size="8">
            <register caption="Screening Type 2 Compare Word 0 Register"
                      name="GMAC_ST2CW0"
                      offset="0x00"
                      rw="RW"
                      size="4">
               <bitfield caption="Mask Value" mask="0x0000FFFF" name="MASKVAL"/>
               <bitfield caption="Compare Value" mask="0xFFFF0000" name="COMPVAL"/>
            </register>
            <register caption="Screening Type 2 Compare Word 1 Register"
                      name="GMAC_ST2CW1"
                      offset="0x04"
                      rw="RW"
                      size="4">
               <bitfield caption="Offset Value in Bytes" mask="0x0000007F" name="OFFSVAL"/>
               <bitfield caption="Ethernet Frame Offset Start"
                         mask="0x00000180"
                         name="OFFSSTRT"
                         values="GMAC_ST2CW1__OFFSSTRT"/>
            </register>
         </register-group>
         <register-group name="GMAC">
            <register caption="Network Control Register"
                      name="GMAC_NCR"
                      offset="0x000"
                      rw="RW"
                      size="4">
               <bitfield caption="Loop Back Local" mask="0x00000002" name="LBL"/>
               <bitfield caption="Receive Enable" mask="0x00000004" name="RXEN"/>
               <bitfield caption="Transmit Enable" mask="0x00000008" name="TXEN"/>
               <bitfield caption="Management Port Enable" mask="0x00000010" name="MPE"/>
               <bitfield caption="Clear Statistics Registers"
                         mask="0x00000020"
                         name="CLRSTAT"/>
               <bitfield caption="Increment Statistics Registers"
                         mask="0x00000040"
                         name="INCSTAT"/>
               <bitfield caption="Write Enable for Statistics Registers"
                         mask="0x00000080"
                         name="WESTAT"/>
               <bitfield caption="Back pressure" mask="0x00000100" name="BP"/>
               <bitfield caption="Start Transmission" mask="0x00000200" name="TSTART"/>
               <bitfield caption="Transmit Halt" mask="0x00000400" name="THALT"/>
               <bitfield caption="Transmit Pause Frame" mask="0x00000800" name="TXPF"/>
               <bitfield caption="Transmit Zero Quantum Pause Frame"
                         mask="0x00001000"
                         name="TXZQPF"/>
               <bitfield caption="Store Receive Time Stamp to Memory"
                         mask="0x00008000"
                         name="SRTSM"/>
               <bitfield caption="Enable PFC Priority-based Pause Reception"
                         mask="0x00010000"
                         name="ENPBPR"/>
               <bitfield caption="Transmit PFC Priority-based Pause Frame"
                         mask="0x00020000"
                         name="TXPBPF"/>
               <bitfield caption="Flush Next Packet" mask="0x00040000" name="FNP"/>
               <bitfield caption="Enable LPI Transmission" mask="0x00080000" name="TXLPIEN"/>
            </register>
            <register caption="Network Configuration Register"
                      name="GMAC_NCFGR"
                      offset="0x004"
                      rw="RW"
                      size="4">
               <bitfield caption="Speed" mask="0x00000001" name="SPD"/>
               <bitfield caption="Full Duplex" mask="0x00000002" name="FD"/>
               <bitfield caption="Discard Non-VLAN FRAMES" mask="0x00000004" name="DNVLAN"/>
               <bitfield caption="Jumbo Frame Size" mask="0x00000008" name="JFRAME"/>
               <bitfield caption="Copy All Frames" mask="0x00000010" name="CAF"/>
               <bitfield caption="No Broadcast" mask="0x00000020" name="NBC"/>
               <bitfield caption="Multicast Hash Enable" mask="0x00000040" name="MTIHEN"/>
               <bitfield caption="Unicast Hash Enable" mask="0x00000080" name="UNIHEN"/>
               <bitfield caption="1536 Maximum Frame Size" mask="0x00000100" name="MAXFS"/>
               <bitfield caption="Retry Test" mask="0x00001000" name="RTY"/>
               <bitfield caption="Pause Enable" mask="0x00002000" name="PEN"/>
               <bitfield caption="Receive Buffer Offset" mask="0x0000C000" name="RXBUFO"/>
               <bitfield caption="Length Field Error Frame Discard"
                         mask="0x00010000"
                         name="LFERD"/>
               <bitfield caption="Remove FCS" mask="0x00020000" name="RFCS"/>
               <bitfield caption="MDC CLock Division"
                         mask="0x001C0000"
                         name="CLK"
                         values="GMAC_NCFGR__CLK"/>
               <bitfield caption="Data Bus Width" mask="0x00600000" name="DBW"/>
               <bitfield caption="Disable Copy of Pause Frames"
                         mask="0x00800000"
                         name="DCPF"/>
               <bitfield caption="Receive Checksum Offload Enable"
                         mask="0x01000000"
                         name="RXCOEN"/>
               <bitfield caption="Enable Frames Received in Half Duplex"
                         mask="0x02000000"
                         name="EFRHD"/>
               <bitfield caption="Ignore RX FCS" mask="0x04000000" name="IRXFCS"/>
               <bitfield caption="IP Stretch Enable" mask="0x10000000" name="IPGSEN"/>
               <bitfield caption="Receive Bad Preamble" mask="0x20000000" name="RXBP"/>
               <bitfield caption="Ignore IPG GRXER" mask="0x40000000" name="IRXER"/>
            </register>
            <register caption="Network Status Register"
                      name="GMAC_NSR"
                      offset="0x008"
                      rw="R"
                      size="4">
               <bitfield caption="MDIO Input Status" mask="0x00000002" name="MDIO"/>
               <bitfield caption="PHY Management Logic Idle" mask="0x00000004" name="IDLE"/>
               <bitfield caption="LPI Indication" mask="0x00000080" name="RXLPIS"/>
            </register>
            <register caption="User Register"
                      name="GMAC_UR"
                      offset="0x00C"
                      rw="RW"
                      size="4">
               <bitfield caption="Reduced MII Mode" mask="0x00000001" name="RMII"/>
            </register>
            <register caption="DMA Configuration Register"
                      name="GMAC_DCFGR"
                      offset="0x010"
                      rw="RW"
                      size="4">
               <bitfield caption="Fixed Burst Length for DMA Data Operations:"
                         mask="0x0000001F"
                         name="FBLDO"
                         values="GMAC_DCFGR__FBLDO"/>
               <bitfield caption="Endian Swap Mode Enable for Management Descriptor Accesses"
                         mask="0x00000040"
                         name="ESMA"/>
               <bitfield caption="Endian Swap Mode Enable for Packet Data Accesses"
                         mask="0x00000080"
                         name="ESPA"/>
               <bitfield caption="Receiver Packet Buffer Memory Size Select"
                         mask="0x00000300"
                         name="RXBMS"
                         values="GMAC_DCFGR__RXBMS"/>
               <bitfield caption="Transmitter Packet Buffer Memory Size Select"
                         mask="0x00000400"
                         name="TXPBMS"/>
               <bitfield caption="Transmitter Checksum Generation Offload Enable"
                         mask="0x00000800"
                         name="TXCOEN"/>
               <bitfield caption="DMA Receive Buffer Size" mask="0x00FF0000" name="DRBS"/>
               <bitfield caption="DMA Discard Receive Packets" mask="0x01000000" name="DDRP"/>
            </register>
            <register caption="Transmit Status Register"
                      name="GMAC_TSR"
                      offset="0x014"
                      rw="RW"
                      size="4">
               <bitfield caption="Used Bit Read" mask="0x00000001" name="UBR"/>
               <bitfield caption="Collision Occurred" mask="0x00000002" name="COL"/>
               <bitfield caption="Retry Limit Exceeded" mask="0x00000004" name="RLE"/>
               <bitfield caption="Transmit Go" mask="0x00000008" name="TXGO"/>
               <bitfield caption="Transmit Frame Corruption Due to AHB Error"
                         mask="0x00000010"
                         name="TFC"/>
               <bitfield caption="Transmit Complete" mask="0x00000020" name="TXCOMP"/>
               <bitfield caption="HRESP Not OK" mask="0x00000100" name="HRESP"/>
            </register>
            <register caption="Receive Buffer Queue Base Address Register"
                      name="GMAC_RBQB"
                      offset="0x018"
                      rw="RW"
                      size="4">
               <bitfield caption="Receive Buffer Queue Base Address"
                         mask="0xFFFFFFFC"
                         name="ADDR"/>
            </register>
            <register caption="Transmit Buffer Queue Base Address Register"
                      name="GMAC_TBQB"
                      offset="0x01C"
                      rw="RW"
                      size="4">
               <bitfield caption="Transmit Buffer Queue Base Address"
                         mask="0xFFFFFFFC"
                         name="ADDR"/>
            </register>
