Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.9.117/samv71b/atdf/ATSAMV71N21B.atdf
            <register caption="Interrupt Mask Register"
                      name="GMAC_IMR"
                      offset="0x030"
                      rw="RW"
                      size="4"
                      atomic-op="read:GMAC_IMR">
               <bitfield caption="Management Frame Sent" mask="0x00000001" name="MFS"/>
               <bitfield caption="Receive Complete" mask="0x00000002" name="RCOMP"/>
               <bitfield caption="RX Used Bit Read" mask="0x00000004" name="RXUBR"/>
               <bitfield caption="TX Used Bit Read" mask="0x00000008" name="TXUBR"/>
               <bitfield caption="Transmit Underrun" mask="0x00000010" name="TUR"/>
               <bitfield caption="Retry Limit Exceeded" mask="0x00000020" name="RLEX"/>
               <bitfield caption="Transmit Frame Corruption Due to AHB Error"
                         mask="0x00000040"
                         name="TFC"/>
               <bitfield caption="Transmit Complete" mask="0x00000080" name="TCOMP"/>
               <bitfield caption="Receive Overrun" mask="0x00000400" name="ROVR"/>
               <bitfield caption="HRESP Not OK" mask="0x00000800" name="HRESP"/>
               <bitfield caption="Pause Frame with Non-zero Pause Quantum Received"
                         mask="0x00001000"
                         name="PFNZ"/>
               <bitfield caption="Pause Time Zero" mask="0x00002000" name="PTZ"/>
               <bitfield caption="Pause Frame Transmitted" mask="0x00004000" name="PFTR"/>
               <bitfield caption="External Interrupt" mask="0x00008000" name="EXINT"/>
               <bitfield caption="PTP Delay Request Frame Received"
                         mask="0x00040000"
                         name="DRQFR"/>
               <bitfield caption="PTP Sync Frame Received" mask="0x00080000" name="SFR"/>
               <bitfield caption="PTP Delay Request Frame Transmitted"
                         mask="0x00100000"
                         name="DRQFT"/>
               <bitfield caption="PTP Sync Frame Transmitted" mask="0x00200000" name="SFT"/>
               <bitfield caption="PDelay Request Frame Received"
                         mask="0x00400000"
                         name="PDRQFR"/>
               <bitfield caption="PDelay Response Frame Received"
                         mask="0x00800000"
                         name="PDRSFR"/>
               <bitfield caption="PDelay Request Frame Transmitted"
                         mask="0x01000000"
                         name="PDRQFT"/>
               <bitfield caption="PDelay Response Frame Transmitted"
                         mask="0x02000000"
                         name="PDRSFT"/>
               <bitfield caption="TSU Seconds Register Increment"
                         mask="0x04000000"
                         name="SRI"/>
               <bitfield caption="Enable RX LPI Indication"
                         mask="0x08000000"
                         name="RXLPISBC"/>
               <bitfield caption="Wake On LAN" mask="0x10000000" name="WOL"/>
               <bitfield caption="TSU Timer Comparison" mask="0x20000000" name="TSUTIMCOMP"/>
            </register>
            <register caption="PHY Maintenance Register"
                      name="GMAC_MAN"
                      offset="0x034"
                      rw="RW"
                      size="4">
               <bitfield caption="PHY Data" mask="0x0000FFFF" name="DATA"/>
               <bitfield caption="Write Ten" mask="0x00030000" name="WTN"/>
               <bitfield caption="Register Address" mask="0x007C0000" name="REGA"/>
               <bitfield caption="PHY Address" mask="0x0F800000" name="PHYA"/>
               <bitfield caption="Operation" mask="0x30000000" name="OP"/>
               <bitfield caption="Clause 22 Operation" mask="0x40000000" name="CLTTO"/>
               <bitfield caption="Write ZERO" mask="0x80000000" name="WZO"/>
            </register>
            <register caption="Received Pause Quantum Register"
                      name="GMAC_RPQ"
                      offset="0x038"
                      rw="R"
                      size="4">
               <bitfield caption="Received Pause Quantum" mask="0x0000FFFF" name="RPQ"/>
            </register>
            <register caption="Transmit Pause Quantum Register"
                      name="GMAC_TPQ"
                      offset="0x03C"
                      rw="RW"
                      size="4">
               <bitfield caption="Transmit Pause Quantum" mask="0x0000FFFF" name="TPQ"/>
            </register>
            <register caption="TX Partial Store and Forward Register"
                      name="GMAC_TPSF"
                      offset="0x040"
                      rw="RW"
                      size="4">
               <bitfield caption="Transmit Partial Store and Forward Address"
                         mask="0x00000FFF"
                         name="TPB1ADR"/>
               <bitfield caption="Enable TX Partial Store and Forward Operation"
                         mask="0x80000000"
                         name="ENTXP"/>
            </register>
            <register caption="RX Partial Store and Forward Register"
                      name="GMAC_RPSF"
                      offset="0x044"
                      rw="RW"
                      size="4">
               <bitfield caption="Receive Partial Store and Forward Address"
                         mask="0x00000FFF"
                         name="RPB1ADR"/>
               <bitfield caption="Enable RX Partial Store and Forward Operation"
                         mask="0x80000000"
                         name="ENRXP"/>
            </register>
            <register caption="RX Jumbo Frame Max Length Register"
                      name="GMAC_RJFML"
                      offset="0x048"
                      rw="RW"
                      size="4">
               <bitfield caption="Frame Max Length" mask="0x00003FFF" name="FML"/>
            </register>
            <register caption="Hash Register Bottom"
                      name="GMAC_HRB"
                      offset="0x080"
                      rw="RW"
                      size="4">
               <bitfield caption="Hash Address" mask="0xFFFFFFFF" name="ADDR"/>
            </register>
            <register caption="Hash Register Top"
                      name="GMAC_HRT"
                      offset="0x084"
                      rw="RW"
                      size="4">
               <bitfield caption="Hash Address" mask="0xFFFFFFFF" name="ADDR"/>
            </register>
            <register-group caption="Specific Address 1 Bottom Register"
                            offset="0x088"
                            name="GMAC_SA"
                            size="8"
                            count="4"
                            start-index="1"
                            name-in-module="GMAC_SA"/>
            <register caption="Type ID Match 1 Register"
                      name="GMAC_TIDM1"
                      offset="0x0A8"
                      rw="RW"
                      size="4">
               <bitfield caption="Type ID Match 1" mask="0x0000FFFF" name="TID"/>
               <bitfield caption="Enable Copying of TID Matched Frames"
                         mask="0x80000000"
                         name="ENID1"/>
            </register>
            <register caption="Type ID Match 2 Register"
                      name="GMAC_TIDM2"
                      offset="0x0AC"
                      rw="RW"
                      size="4">
               <bitfield caption="Type ID Match 2" mask="0x0000FFFF" name="TID"/>
               <bitfield caption="Enable Copying of TID Matched Frames"
                         mask="0x80000000"
                         name="ENID2"/>
            </register>
            <register caption="Type ID Match 3 Register"
                      name="GMAC_TIDM3"
                      offset="0x0B0"
                      rw="RW"
                      size="4">
               <bitfield caption="Type ID Match 3" mask="0x0000FFFF" name="TID"/>
               <bitfield caption="Enable Copying of TID Matched Frames"
                         mask="0x80000000"
                         name="ENID3"/>
            </register>
            <register caption="Type ID Match 4 Register"
                      name="GMAC_TIDM4"
                      offset="0x0B4"
                      rw="RW"
                      size="4">
               <bitfield caption="Type ID Match 4" mask="0x0000FFFF" name="TID"/>
               <bitfield caption="Enable Copying of TID Matched Frames"
                         mask="0x80000000"
                         name="ENID4"/>
            </register>
            <register caption="Wake on LAN Register"
                      name="GMAC_WOL"
                      offset="0x0B8"
                      rw="RW"
                      size="4">
               <bitfield caption="ARP Request IP Address" mask="0x0000FFFF" name="IP"/>
               <bitfield caption="Magic Packet Event Enable" mask="0x00010000" name="MAG"/>
               <bitfield caption="ARP Request IP Address" mask="0x00020000" name="ARP"/>
               <bitfield caption="Specific Address Register 1 Event Enable"
                         mask="0x00040000"
                         name="SA1"/>
               <bitfield caption="Multicast Hash Event Enable" mask="0x00080000" name="MTI"/>
            </register>
            <register caption="IPG Stretch Register"
                      name="GMAC_IPGS"
                      offset="0x0BC"
                      rw="RW"
                      size="4">
               <bitfield caption="Frame Length" mask="0x0000FFFF" name="FL"/>
            </register>
            <register caption="Stacked VLAN Register"
                      name="GMAC_SVLAN"
                      offset="0x0C0"
                      rw="RW"
                      size="4">
               <bitfield caption="User Defined VLAN_TYPE Field"
                         mask="0x0000FFFF"
                         name="VLAN_TYPE"/>
               <bitfield caption="Enable Stacked VLAN Processing Mode"
                         mask="0x80000000"
                         name="ESVLAN"/>
            </register>
            <register caption="Transmit PFC Pause Register"
                      name="GMAC_TPFCP"
                      offset="0x0C4"
                      rw="RW"
                      size="4">
               <bitfield caption="Priority Enable Vector" mask="0x000000FF" name="PEV"/>
               <bitfield caption="Pause Quantum" mask="0x0000FF00" name="PQ"/>
            </register>
            <register caption="Specific Address 1 Mask Bottom Register"
                      name="GMAC_SAMB1"
                      offset="0x0C8"
                      rw="RW"
                      size="4">
               <bitfield caption="Specific Address 1 Mask" mask="0xFFFFFFFF" name="ADDR"/>
            </register>
            <register caption="Specific Address 1 Mask Top Register"
                      name="GMAC_SAMT1"
                      offset="0x0CC"
                      rw="RW"
                      size="4">
               <bitfield caption="Specific Address 1 Mask" mask="0x0000FFFF" name="ADDR"/>
            </register>
            <register caption="1588 Timer Nanosecond Comparison Register"
                      name="GMAC_NSC"
                      offset="0x0DC"
                      rw="RW"
                      size="4">
               <bitfield caption="1588 Timer Nanosecond Comparison Value"
                         mask="0x003FFFFF"
                         name="NANOSEC"/>
            </register>
