Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.9.117/samv71b/atdf/ATSAMV71N21B.atdf
            <register caption="1588 Timer Second Comparison Low Register"
                      name="GMAC_SCL"
                      offset="0x0E0"
                      rw="RW"
                      size="4">
               <bitfield caption="1588 Timer Second Comparison Value"
                         mask="0xFFFFFFFF"
                         name="SEC"/>
            </register>
            <register caption="1588 Timer Second Comparison High Register"
                      name="GMAC_SCH"
                      offset="0x0E4"
                      rw="RW"
                      size="4">
               <bitfield caption="1588 Timer Second Comparison Value"
                         mask="0x0000FFFF"
                         name="SEC"/>
            </register>
            <register caption="PTP Event Frame Transmitted Seconds High Register"
                      name="GMAC_EFTSH"
                      offset="0x0E8"
                      rw="R"
                      size="4">
               <bitfield caption="Register Update" mask="0x0000FFFF" name="RUD"/>
            </register>
            <register caption="PTP Event Frame Received Seconds High Register"
                      name="GMAC_EFRSH"
                      offset="0x0EC"
                      rw="R"
                      size="4">
               <bitfield caption="Register Update" mask="0x0000FFFF" name="RUD"/>
            </register>
            <register caption="PTP Peer Event Frame Transmitted Seconds High Register"
                      name="GMAC_PEFTSH"
                      offset="0x0F0"
                      rw="R"
                      size="4">
               <bitfield caption="Register Update" mask="0x0000FFFF" name="RUD"/>
            </register>
            <register caption="PTP Peer Event Frame Received Seconds High Register"
                      name="GMAC_PEFRSH"
                      offset="0x0F4"
                      rw="R"
                      size="4">
               <bitfield caption="Register Update" mask="0x0000FFFF" name="RUD"/>
            </register>
            <register caption="Octets Transmitted Low Register"
                      name="GMAC_OTLO"
                      offset="0x100"
                      rw="R"
                      size="4">
               <bitfield caption="Transmitted Octets" mask="0xFFFFFFFF" name="TXO"/>
            </register>
            <register caption="Octets Transmitted High Register"
                      name="GMAC_OTHI"
                      offset="0x104"
                      rw="R"
                      size="4">
               <bitfield caption="Transmitted Octets" mask="0x0000FFFF" name="TXO"/>
            </register>
            <register caption="Frames Transmitted Register"
                      name="GMAC_FT"
                      offset="0x108"
                      rw="R"
                      size="4">
               <bitfield caption="Frames Transmitted without Error"
                         mask="0xFFFFFFFF"
                         name="FTX"/>
            </register>
            <register caption="Broadcast Frames Transmitted Register"
                      name="GMAC_BCFT"
                      offset="0x10C"
                      rw="R"
                      size="4">
               <bitfield caption="Broadcast Frames Transmitted without Error"
                         mask="0xFFFFFFFF"
                         name="BFTX"/>
            </register>
            <register caption="Multicast Frames Transmitted Register"
                      name="GMAC_MFT"
                      offset="0x110"
                      rw="R"
                      size="4">
               <bitfield caption="Multicast Frames Transmitted without Error"
                         mask="0xFFFFFFFF"
                         name="MFTX"/>
            </register>
            <register caption="Pause Frames Transmitted Register"
                      name="GMAC_PFT"
                      offset="0x114"
                      rw="R"
                      size="4">
               <bitfield caption="Pause Frames Transmitted Register"
                         mask="0x0000FFFF"
                         name="PFTX"/>
            </register>
            <register caption="64 Byte Frames Transmitted Register"
                      name="GMAC_BFT64"
                      offset="0x118"
                      rw="R"
                      size="4">
               <bitfield caption="64 Byte Frames Transmitted without Error"
                         mask="0xFFFFFFFF"
                         name="NFTX"/>
            </register>
            <register caption="65 to 127 Byte Frames Transmitted Register"
                      name="GMAC_TBFT127"
                      offset="0x11C"
                      rw="R"
                      size="4">
               <bitfield caption="65 to 127 Byte Frames Transmitted without Error"
                         mask="0xFFFFFFFF"
                         name="NFTX"/>
            </register>
            <register caption="128 to 255 Byte Frames Transmitted Register"
                      name="GMAC_TBFT255"
                      offset="0x120"
                      rw="R"
                      size="4">
               <bitfield caption="128 to 255 Byte Frames Transmitted without Error"
                         mask="0xFFFFFFFF"
                         name="NFTX"/>
            </register>
            <register caption="256 to 511 Byte Frames Transmitted Register"
                      name="GMAC_TBFT511"
                      offset="0x124"
                      rw="R"
                      size="4">
               <bitfield caption="256 to 511 Byte Frames Transmitted without Error"
                         mask="0xFFFFFFFF"
                         name="NFTX"/>
            </register>
            <register caption="512 to 1023 Byte Frames Transmitted Register"
                      name="GMAC_TBFT1023"
                      offset="0x128"
                      rw="R"
                      size="4">
               <bitfield caption="512 to 1023 Byte Frames Transmitted without Error"
                         mask="0xFFFFFFFF"
                         name="NFTX"/>
            </register>
            <register caption="1024 to 1518 Byte Frames Transmitted Register"
                      name="GMAC_TBFT1518"
                      offset="0x12C"
                      rw="R"
                      size="4">
               <bitfield caption="1024 to 1518 Byte Frames Transmitted without Error"
                         mask="0xFFFFFFFF"
                         name="NFTX"/>
            </register>
            <register caption="Greater Than 1518 Byte Frames Transmitted Register"
                      name="GMAC_GTBFT1518"
                      offset="0x130"
                      rw="R"
                      size="4">
               <bitfield caption="Greater than 1518 Byte Frames Transmitted without Error"
                         mask="0xFFFFFFFF"
                         name="NFTX"/>
            </register>
            <register caption="Transmit Underruns Register"
                      name="GMAC_TUR"
                      offset="0x134"
                      rw="R"
                      size="4">
               <bitfield caption="Transmit Underruns" mask="0x000003FF" name="TXUNR"/>
            </register>
            <register caption="Single Collision Frames Register"
                      name="GMAC_SCF"
                      offset="0x138"
                      rw="R"
                      size="4">
               <bitfield caption="Single Collision" mask="0x0003FFFF" name="SCOL"/>
            </register>
