Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.9.117/samv71b/atdf/ATSAMV71N21B.atdf
            <register caption="Multiple Collision Frames Register"
                      name="GMAC_MCF"
                      offset="0x13C"
                      rw="R"
                      size="4">
               <bitfield caption="Multiple Collision" mask="0x0003FFFF" name="MCOL"/>
            </register>
            <register caption="Excessive Collisions Register"
                      name="GMAC_EC"
                      offset="0x140"
                      rw="R"
                      size="4">
               <bitfield caption="Excessive Collisions" mask="0x000003FF" name="XCOL"/>
            </register>
            <register caption="Late Collisions Register"
                      name="GMAC_LC"
                      offset="0x144"
                      rw="R"
                      size="4">
               <bitfield caption="Late Collisions" mask="0x000003FF" name="LCOL"/>
            </register>
            <register caption="Deferred Transmission Frames Register"
                      name="GMAC_DTF"
                      offset="0x148"
                      rw="R"
                      size="4">
               <bitfield caption="Deferred Transmission" mask="0x0003FFFF" name="DEFT"/>
            </register>
            <register caption="Carrier Sense Errors Register"
                      name="GMAC_CSE"
                      offset="0x14C"
                      rw="R"
                      size="4">
               <bitfield caption="Carrier Sense Error" mask="0x000003FF" name="CSR"/>
            </register>
            <register caption="Octets Received Low Received Register"
                      name="GMAC_ORLO"
                      offset="0x150"
                      rw="R"
                      size="4">
               <bitfield caption="Received Octets" mask="0xFFFFFFFF" name="RXO"/>
            </register>
            <register caption="Octets Received High Received Register"
                      name="GMAC_ORHI"
                      offset="0x154"
                      rw="R"
                      size="4">
               <bitfield caption="Received Octets" mask="0x0000FFFF" name="RXO"/>
            </register>
            <register caption="Frames Received Register"
                      name="GMAC_FR"
                      offset="0x158"
                      rw="R"
                      size="4">
               <bitfield caption="Frames Received without Error"
                         mask="0xFFFFFFFF"
                         name="FRX"/>
            </register>
            <register caption="Broadcast Frames Received Register"
                      name="GMAC_BCFR"
                      offset="0x15C"
                      rw="R"
                      size="4">
               <bitfield caption="Broadcast Frames Received without Error"
                         mask="0xFFFFFFFF"
                         name="BFRX"/>
            </register>
            <register caption="Multicast Frames Received Register"
                      name="GMAC_MFR"
                      offset="0x160"
                      rw="R"
                      size="4">
               <bitfield caption="Multicast Frames Received without Error"
                         mask="0xFFFFFFFF"
                         name="MFRX"/>
            </register>
            <register caption="Pause Frames Received Register"
                      name="GMAC_PFR"
                      offset="0x164"
                      rw="R"
                      size="4">
               <bitfield caption="Pause Frames Received Register"
                         mask="0x0000FFFF"
                         name="PFRX"/>
            </register>
            <register caption="64 Byte Frames Received Register"
                      name="GMAC_BFR64"
                      offset="0x168"
                      rw="R"
                      size="4">
               <bitfield caption="64 Byte Frames Received without Error"
                         mask="0xFFFFFFFF"
                         name="NFRX"/>
            </register>
            <register caption="65 to 127 Byte Frames Received Register"
                      name="GMAC_TBFR127"
                      offset="0x16C"
                      rw="R"
                      size="4">
               <bitfield caption="65 to 127 Byte Frames Received without Error"
                         mask="0xFFFFFFFF"
                         name="NFRX"/>
            </register>
            <register caption="128 to 255 Byte Frames Received Register"
                      name="GMAC_TBFR255"
                      offset="0x170"
                      rw="R"
                      size="4">
               <bitfield caption="128 to 255 Byte Frames Received without Error"
                         mask="0xFFFFFFFF"
                         name="NFRX"/>
            </register>
            <register caption="256 to 511 Byte Frames Received Register"
                      name="GMAC_TBFR511"
                      offset="0x174"
                      rw="R"
                      size="4">
               <bitfield caption="256 to 511 Byte Frames Received without Error"
                         mask="0xFFFFFFFF"
                         name="NFRX"/>
            </register>
            <register caption="512 to 1023 Byte Frames Received Register"
                      name="GMAC_TBFR1023"
                      offset="0x178"
                      rw="R"
                      size="4">
               <bitfield caption="512 to 1023 Byte Frames Received without Error"
                         mask="0xFFFFFFFF"
                         name="NFRX"/>
            </register>
            <register caption="1024 to 1518 Byte Frames Received Register"
                      name="GMAC_TBFR1518"
                      offset="0x17C"
                      rw="R"
                      size="4">
               <bitfield caption="1024 to 1518 Byte Frames Received without Error"
                         mask="0xFFFFFFFF"
                         name="NFRX"/>
            </register>
            <register caption="1519 to Maximum Byte Frames Received Register"
                      name="GMAC_TMXBFR"
                      offset="0x180"
                      rw="R"
                      size="4">
               <bitfield caption="1519 to Maximum Byte Frames Received without Error"
                         mask="0xFFFFFFFF"
                         name="NFRX"/>
            </register>
            <register caption="Undersize Frames Received Register"
                      name="GMAC_UFR"
                      offset="0x184"
                      rw="R"
                      size="4">
               <bitfield caption="Undersize Frames Received" mask="0x000003FF" name="UFRX"/>
            </register>
            <register caption="Oversize Frames Received Register"
                      name="GMAC_OFR"
                      offset="0x188"
                      rw="R"
                      size="4">
               <bitfield caption="Oversized Frames Received" mask="0x000003FF" name="OFRX"/>
            </register>
            <register caption="Jabbers Received Register"
                      name="GMAC_JR"
                      offset="0x18C"
                      rw="R"
                      size="4">
               <bitfield caption="Jabbers Received" mask="0x000003FF" name="JRX"/>
            </register>
            <register caption="Frame Check Sequence Errors Register"
                      name="GMAC_FCSE"
                      offset="0x190"
                      rw="R"
                      size="4">
               <bitfield caption="Frame Check Sequence Errors" mask="0x000003FF" name="FCKR"/>
            </register>
            <register caption="Length Field Frame Errors Register"
                      name="GMAC_LFFE"
                      offset="0x194"
                      rw="R"
                      size="4">
               <bitfield caption="Length Field Frame Errors" mask="0x000003FF" name="LFER"/>
            </register>
            <register caption="Receive Symbol Errors Register"
                      name="GMAC_RSE"
                      offset="0x198"
                      rw="R"
                      size="4">
               <bitfield caption="Receive Symbol Errors" mask="0x000003FF" name="RXSE"/>
            </register>
