Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.9.117/samv71b/atdf/ATSAMV71N21B.atdf
            <register caption="Alignment Errors Register"
                      name="GMAC_AE"
                      offset="0x19C"
                      rw="R"
                      size="4">
               <bitfield caption="Alignment Errors" mask="0x000003FF" name="AER"/>
            </register>
            <register caption="Receive Resource Errors Register"
                      name="GMAC_RRE"
                      offset="0x1A0"
                      rw="R"
                      size="4">
               <bitfield caption="Receive Resource Errors" mask="0x0003FFFF" name="RXRER"/>
            </register>
            <register caption="Receive Overrun Register"
                      name="GMAC_ROE"
                      offset="0x1A4"
                      rw="R"
                      size="4">
               <bitfield caption="Receive Overruns" mask="0x000003FF" name="RXOVR"/>
            </register>
            <register caption="IP Header Checksum Errors Register"
                      name="GMAC_IHCE"
                      offset="0x1A8"
                      rw="R"
                      size="4">
               <bitfield caption="IP Header Checksum Errors" mask="0x000000FF" name="HCKER"/>
            </register>
            <register caption="TCP Checksum Errors Register"
                      name="GMAC_TCE"
                      offset="0x1AC"
                      rw="R"
                      size="4">
               <bitfield caption="TCP Checksum Errors" mask="0x000000FF" name="TCKER"/>
            </register>
            <register caption="UDP Checksum Errors Register"
                      name="GMAC_UCE"
                      offset="0x1B0"
                      rw="R"
                      size="4">
               <bitfield caption="UDP Checksum Errors" mask="0x000000FF" name="UCKER"/>
            </register>
            <register caption="1588 Timer Increment Sub-nanoseconds Register"
                      name="GMAC_TISUBN"
                      offset="0x1BC"
                      rw="RW"
                      size="4">
               <bitfield caption="Lower Significant Bits of Timer Increment Register"
                         mask="0x0000FFFF"
                         name="LSBTIR"/>
            </register>
            <register caption="1588 Timer Seconds High Register"
                      name="GMAC_TSH"
                      offset="0x1C0"
                      rw="RW"
                      size="4">
               <bitfield caption="Timer Count in Seconds" mask="0x0000FFFF" name="TCS"/>
            </register>
            <register caption="1588 Timer Seconds Low Register"
                      name="GMAC_TSL"
                      offset="0x1D0"
                      rw="RW"
                      size="4">
               <bitfield caption="Timer Count in Seconds" mask="0xFFFFFFFF" name="TCS"/>
            </register>
            <register caption="1588 Timer Nanoseconds Register"
                      name="GMAC_TN"
                      offset="0x1D4"
                      rw="RW"
                      size="4">
               <bitfield caption="Timer Count in Nanoseconds" mask="0x3FFFFFFF" name="TNS"/>
            </register>
            <register caption="1588 Timer Adjust Register"
                      name="GMAC_TA"
                      offset="0x1D8"
                      rw="W"
                      size="4">
               <bitfield caption="Increment/Decrement" mask="0x3FFFFFFF" name="ITDT"/>
               <bitfield caption="Adjust 1588 Timer" mask="0x80000000" name="ADJ"/>
            </register>
            <register caption="1588 Timer Increment Register"
                      name="GMAC_TI"
                      offset="0x1DC"
                      rw="RW"
                      size="4">
               <bitfield caption="Count Nanoseconds" mask="0x000000FF" name="CNS"/>
               <bitfield caption="Alternative Count Nanoseconds"
                         mask="0x0000FF00"
                         name="ACNS"/>
               <bitfield caption="Number of Increments" mask="0x00FF0000" name="NIT"/>
            </register>
            <register caption="PTP Event Frame Transmitted Seconds Low Register"
                      name="GMAC_EFTSL"
                      offset="0x1E0"
                      rw="R"
                      size="4">
               <bitfield caption="Register Update" mask="0xFFFFFFFF" name="RUD"/>
            </register>
            <register caption="PTP Event Frame Transmitted Nanoseconds Register"
                      name="GMAC_EFTN"
                      offset="0x1E4"
                      rw="R"
                      size="4">
               <bitfield caption="Register Update" mask="0x3FFFFFFF" name="RUD"/>
            </register>
            <register caption="PTP Event Frame Received Seconds Low Register"
                      name="GMAC_EFRSL"
                      offset="0x1E8"
                      rw="R"
                      size="4">
               <bitfield caption="Register Update" mask="0xFFFFFFFF" name="RUD"/>
            </register>
            <register caption="PTP Event Frame Received Nanoseconds Register"
                      name="GMAC_EFRN"
                      offset="0x1EC"
                      rw="R"
                      size="4">
               <bitfield caption="Register Update" mask="0x3FFFFFFF" name="RUD"/>
            </register>
            <register caption="PTP Peer Event Frame Transmitted Seconds Low Register"
                      name="GMAC_PEFTSL"
                      offset="0x1F0"
                      rw="R"
                      size="4">
               <bitfield caption="Register Update" mask="0xFFFFFFFF" name="RUD"/>
            </register>
            <register caption="PTP Peer Event Frame Transmitted Nanoseconds Register"
                      name="GMAC_PEFTN"
                      offset="0x1F4"
                      rw="R"
                      size="4">
               <bitfield caption="Register Update" mask="0x3FFFFFFF" name="RUD"/>
            </register>
