Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.9.117/samv71b/atdf/ATSAMV71N21B.atdf
            <register caption="PTP Peer Event Frame Received Seconds Low Register"
                      name="GMAC_PEFRSL"
                      offset="0x1F8"
                      rw="R"
                      size="4">
               <bitfield caption="Register Update" mask="0xFFFFFFFF" name="RUD"/>
            </register>
            <register caption="PTP Peer Event Frame Received Nanoseconds Register"
                      name="GMAC_PEFRN"
                      offset="0x1FC"
                      rw="R"
                      size="4">
               <bitfield caption="Register Update" mask="0x3FFFFFFF" name="RUD"/>
            </register>
            <register caption="Received LPI Transitions"
                      name="GMAC_RXLPI"
                      offset="0x270"
                      rw="R"
                      size="4">
               <bitfield caption="Count of RX LPI transitions (cleared on read)"
                         mask="0x0000FFFF"
                         name="COUNT"/>
            </register>
            <register caption="Received LPI Time"
                      name="GMAC_RXLPITIME"
                      offset="0x274"
                      rw="R"
                      size="4">
               <bitfield caption="Time in LPI (cleared on read)"
                         mask="0x00FFFFFF"
                         name="LPITIME"/>
            </register>
            <register caption="Transmit LPI Transitions"
                      name="GMAC_TXLPI"
                      offset="0x278"
                      rw="R"
                      size="4">
               <bitfield caption="Count of LPI transitions (cleared on read)"
                         mask="0x0000FFFF"
                         name="COUNT"/>
            </register>
            <register caption="Transmit LPI Time"
                      name="GMAC_TXLPITIME"
                      offset="0x27C"
                      rw="R"
                      size="4">
               <bitfield caption="Time in LPI (cleared on read)"
                         mask="0x00FFFFFF"
                         name="LPITIME"/>
            </register>
            <register caption="Interrupt Status Register Priority Queue (1..5)"
                      name="GMAC_ISRPQ"
                      offset="0x400"
                      rw="R"
                      size="4"
                      count="5"
                      atomic-op="clear:GMAC_ISRPQ">
               <bitfield caption="Receive Complete" mask="0x00000002" name="RCOMP"/>
               <bitfield caption="RX Used Bit Read" mask="0x00000004" name="RXUBR"/>
               <bitfield caption="Retry Limit Exceeded or Late Collision"
                         mask="0x00000020"
                         name="RLEX"/>
               <bitfield caption="Transmit Frame Corruption Due to AHB Error"
                         mask="0x00000040"
                         name="TFC"/>
               <bitfield caption="Transmit Complete" mask="0x00000080" name="TCOMP"/>
               <bitfield caption="Receive Overrun" mask="0x00000400" name="ROVR"/>
               <bitfield caption="HRESP Not OK" mask="0x00000800" name="HRESP"/>
            </register>
            <register caption="Transmit Buffer Queue Base Address Register Priority Queue (1..5)"
                      name="GMAC_TBQBAPQ"
                      offset="0x440"
                      rw="RW"
                      size="4"
                      count="5">
               <bitfield caption="Transmit Buffer Queue Base Address"
                         mask="0xFFFFFFFC"
                         name="TXBQBA"/>
            </register>
            <register caption="Receive Buffer Queue Base Address Register Priority Queue (1..5)"
                      name="GMAC_RBQBAPQ"
                      offset="0x480"
                      rw="RW"
                      size="4"
                      count="5">
               <bitfield caption="Receive Buffer Queue Base Address"
                         mask="0xFFFFFFFC"
                         name="RXBQBA"/>
            </register>
            <register caption="Receive Buffer Size Register Priority Queue (1..5)"
                      name="GMAC_RBSRPQ"
                      offset="0x4A0"
                      rw="RW"
                      size="4"
                      count="5">
               <bitfield caption="Receive Buffer Size" mask="0x0000FFFF" name="RBS"/>
            </register>
            <register caption="Credit-Based Shaping Control Register"
                      name="GMAC_CBSCR"
                      offset="0x4BC"
                      rw="RW"
                      size="4">
               <bitfield caption="Queue B CBS Enable" mask="0x00000001" name="QBE"/>
               <bitfield caption="Queue A CBS Enable" mask="0x00000002" name="QAE"/>
            </register>
            <register caption="Credit-Based Shaping IdleSlope Register for Queue A"
                      name="GMAC_CBSISQA"
                      offset="0x4C0"
                      rw="RW"
                      size="4">
               <bitfield caption="IdleSlope" mask="0xFFFFFFFF" name="IS"/>
            </register>
            <register caption="Credit-Based Shaping IdleSlope Register for Queue B"
                      name="GMAC_CBSISQB"
                      offset="0x4C4"
                      rw="RW"
                      size="4">
               <bitfield caption="IdleSlope" mask="0xFFFFFFFF" name="IS"/>
            </register>
            <register caption="Screening Type 1 Register Priority Queue"
                      name="GMAC_ST1RPQ"
                      offset="0x500"
                      rw="RW"
                      size="4"
                      count="4">
               <bitfield caption="Queue Number (0-5)" mask="0x00000007" name="QNB"/>
               <bitfield caption="Differentiated Services or Traffic Class Match"
                         mask="0x00000FF0"
                         name="DSTCM"/>
               <bitfield caption="UDP Port Match" mask="0x0FFFF000" name="UDPM"/>
               <bitfield caption="Differentiated Services or Traffic Class Match Enable"
                         mask="0x10000000"
                         name="DSTCE"/>
               <bitfield caption="UDP Port Match Enable" mask="0x20000000" name="UDPE"/>
            </register>
            <register caption="Screening Type 2 Register Priority Queue"
                      name="GMAC_ST2RPQ"
                      offset="0x540"
                      rw="RW"
                      size="4"
                      count="8">
               <bitfield caption="Queue Number (0-5)" mask="0x00000007" name="QNB"/>
               <bitfield caption="VLAN Priority" mask="0x00000070" name="VLANP"/>
               <bitfield caption="VLAN Enable" mask="0x00000100" name="VLANE"/>
               <bitfield caption="Index of Screening Type 2 EtherType register x"
                         mask="0x00000E00"
                         name="I2ETH"/>
               <bitfield caption="EtherType Enable" mask="0x00001000" name="ETHE"/>
               <bitfield caption="Index of Screening Type 2 Compare Word 0/Word 1 register x"
                         mask="0x0003E000"
                         name="COMPA"/>
               <bitfield caption="Compare A Enable" mask="0x00040000" name="COMPAE"/>
               <bitfield caption="Index of Screening Type 2 Compare Word 0/Word 1 register x"
                         mask="0x00F80000"
                         name="COMPB"/>
               <bitfield caption="Compare B Enable" mask="0x01000000" name="COMPBE"/>
               <bitfield caption="Index of Screening Type 2 Compare Word 0/Word 1 register x"
                         mask="0x3E000000"
                         name="COMPC"/>
               <bitfield caption="Compare C Enable" mask="0x40000000" name="COMPCE"/>
            </register>
            <register caption="Interrupt Enable Register Priority Queue (1..5)"
                      name="GMAC_IERPQ"
                      offset="0x600"
                      rw="W"
                      size="4"
                      count="5"
                      atomic-op="set:GMAC_IMRPQ">
               <bitfield caption="Receive Complete" mask="0x00000002" name="RCOMP"/>
               <bitfield caption="RX Used Bit Read" mask="0x00000004" name="RXUBR"/>
               <bitfield caption="Retry Limit Exceeded or Late Collision"
                         mask="0x00000020"
                         name="RLEX"/>
               <bitfield caption="Transmit Frame Corruption Due to AHB Error"
                         mask="0x00000040"
                         name="TFC"/>
               <bitfield caption="Transmit Complete" mask="0x00000080" name="TCOMP"/>
               <bitfield caption="Receive Overrun" mask="0x00000400" name="ROVR"/>
               <bitfield caption="HRESP Not OK" mask="0x00000800" name="HRESP"/>
            </register>
            <register caption="Interrupt Disable Register Priority Queue (1..5)"
                      name="GMAC_IDRPQ"
                      offset="0x620"
                      rw="W"
                      size="4"
                      count="5"
                      atomic-op="clear:GMAC_IMRPQ">
               <bitfield caption="Receive Complete" mask="0x00000002" name="RCOMP"/>
               <bitfield caption="RX Used Bit Read" mask="0x00000004" name="RXUBR"/>
               <bitfield caption="Retry Limit Exceeded or Late Collision"
                         mask="0x00000020"
                         name="RLEX"/>
               <bitfield caption="Transmit Frame Corruption Due to AHB Error"
                         mask="0x00000040"
                         name="TFC"/>
               <bitfield caption="Transmit Complete" mask="0x00000080" name="TCOMP"/>
               <bitfield caption="Receive Overrun" mask="0x00000400" name="ROVR"/>
               <bitfield caption="HRESP Not OK" mask="0x00000800" name="HRESP"/>
            </register>
            <register caption="Interrupt Mask Register Priority Queue (1..5)"
                      name="GMAC_IMRPQ"
                      offset="0x640"
                      rw="RW"
                      size="4"
                      count="5"
                      atomic-op="read:GMAC_IMRPQ">
               <bitfield caption="Receive Complete" mask="0x00000002" name="RCOMP"/>
               <bitfield caption="RX Used Bit Read" mask="0x00000004" name="RXUBR"/>
               <bitfield caption="Retry Limit Exceeded or Late Collision"
                         mask="0x00000020"
                         name="RLEX"/>
               <bitfield caption="AHB Error" mask="0x00000040" name="AHB"/>
               <bitfield caption="Transmit Complete" mask="0x00000080" name="TCOMP"/>
               <bitfield caption="Receive Overrun" mask="0x00000400" name="ROVR"/>
               <bitfield caption="HRESP Not OK" mask="0x00000800" name="HRESP"/>
            </register>
            <register caption="Screening Type 2 Ethertype Register"
                      name="GMAC_ST2ER"
                      offset="0x6E0"
                      rw="RW"
                      size="4"
                      count="4">
               <bitfield caption="Ethertype Compare Value" mask="0x0000FFFF" name="COMPVAL"/>
            </register>
            <register-group caption="Screening Type 2 Compare Word 0 Register"
                            offset="0x700"
                            name="GMAC_ST2CW"
                            size="8"
                            count="24"
                            name-in-module="GMAC_ST2CW"/>
         </register-group>
         <value-group caption="" name="GMAC_NCFGR__CLK">
            <value caption="MCK divided by 8 (MCK up to 20 MHz)"
                   name="MCK_8"
                   value="0x0"/>
            <value caption="MCK divided by 16 (MCK up to 40 MHz)"
                   name="MCK_16"
                   value="0x1"/>
            <value caption="MCK divided by 32 (MCK up to 80 MHz)"
                   name="MCK_32"
                   value="0x2"/>
            <value caption="MCK divided by 48 (MCK up to 120 MHz)"
                   name="MCK_48"
                   value="0x3"/>
            <value caption="MCK divided by 64 (MCK up to 160 MHz)"
                   name="MCK_64"
                   value="0x4"/>
            <value caption="MCK divided by 96 (MCK up to 240 MHz)"
                   name="MCK_96"
                   value="0x5"/>
         </value-group>
         <value-group caption="" name="GMAC_DCFGR__FBLDO">
            <value caption="00001: Always use SINGLE AHB bursts"
                   name="SINGLE"
                   value="0x1"/>
            <value caption="001xx: Attempt to use INCR4 AHB bursts (Default)"
                   name="INCR4"
                   value="0x4"/>
            <value caption="01xxx: Attempt to use INCR8 AHB bursts"
                   name="INCR8"
                   value="0x8"/>
            <value caption="1xxxx: Attempt to use INCR16 AHB bursts"
                   name="INCR16"
                   value="0x10"/>
         </value-group>
