Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.9.117/samv71b/atdf/ATSAMV71N21B.atdf
            <register caption="Interrupt Mask Register"
                      name="HSMCI_IMR"
                      offset="0x4C"
                      rw="R"
                      size="4"
                      atomic-op="read:HSMCI_IMR">
               <bitfield caption="Command Ready Interrupt Mask"
                         mask="0x00000001"
                         name="CMDRDY"/>
               <bitfield caption="Receiver Ready Interrupt Mask"
                         mask="0x00000002"
                         name="RXRDY"/>
               <bitfield caption="Transmit Ready Interrupt Mask"
                         mask="0x00000004"
                         name="TXRDY"/>
               <bitfield caption="Data Block Ended Interrupt Mask"
                         mask="0x00000008"
                         name="BLKE"/>
               <bitfield caption="Data Transfer in Progress Interrupt Mask"
                         mask="0x00000010"
                         name="DTIP"/>
               <bitfield caption="Data Not Busy Interrupt Mask"
                         mask="0x00000020"
                         name="NOTBUSY"/>
               <bitfield caption="SDIO Interrupt for Slot A Interrupt Mask"
                         mask="0x00000100"
                         name="SDIOIRQA"/>
               <bitfield caption="SDIO Read Wait Operation Status Interrupt Mask"
                         mask="0x00001000"
                         name="SDIOWAIT"/>
               <bitfield caption="Completion Signal Received Interrupt Mask"
                         mask="0x00002000"
                         name="CSRCV"/>
               <bitfield caption="Response Index Error Interrupt Mask"
                         mask="0x00010000"
                         name="RINDE"/>
               <bitfield caption="Response Direction Error Interrupt Mask"
                         mask="0x00020000"
                         name="RDIRE"/>
               <bitfield caption="Response CRC Error Interrupt Mask"
                         mask="0x00040000"
                         name="RCRCE"/>
               <bitfield caption="Response End Bit Error Interrupt Mask"
                         mask="0x00080000"
                         name="RENDE"/>
               <bitfield caption="Response Time-out Error Interrupt Mask"
                         mask="0x00100000"
                         name="RTOE"/>
               <bitfield caption="Data CRC Error Interrupt Mask"
                         mask="0x00200000"
                         name="DCRCE"/>
               <bitfield caption="Data Time-out Error Interrupt Mask"
                         mask="0x00400000"
                         name="DTOE"/>
               <bitfield caption="Completion Signal Time-out Error Interrupt Mask"
                         mask="0x00800000"
                         name="CSTOE"/>
               <bitfield caption="DMA Block Overrun Error Interrupt Mask"
                         mask="0x01000000"
                         name="BLKOVRE"/>
               <bitfield caption="FIFO Empty Interrupt Mask"
                         mask="0x04000000"
                         name="FIFOEMPTY"/>
               <bitfield caption="Transfer Done Interrupt Mask"
                         mask="0x08000000"
                         name="XFRDONE"/>
               <bitfield caption="Boot Operation Acknowledge Received Interrupt Mask"
                         mask="0x10000000"
                         name="ACKRCV"/>
               <bitfield caption="Boot Operation Acknowledge Error Interrupt Mask"
                         mask="0x20000000"
                         name="ACKRCVE"/>
               <bitfield caption="Overrun Interrupt Mask" mask="0x40000000" name="OVRE"/>
               <bitfield caption="Underrun Interrupt Mask" mask="0x80000000" name="UNRE"/>
            </register>
            <register caption="DMA Configuration Register"
                      name="HSMCI_DMA"
                      offset="0x50"
                      rw="RW"
                      size="4">
               <bitfield caption="DMA Channel Read and Write Chunk Size"
                         mask="0x00000070"
                         name="CHKSIZE"
                         values="HSMCI_DMA__CHKSIZE"/>
               <bitfield caption="DMA Hardware Handshaking Enable"
                         mask="0x00000100"
                         name="DMAEN"/>
            </register>
            <register caption="Configuration Register"
                      name="HSMCI_CFG"
                      offset="0x54"
                      rw="RW"
                      size="4">
               <bitfield caption="HSMCI Internal FIFO control mode"
                         mask="0x00000001"
                         name="FIFOMODE"/>
               <bitfield caption="Flow Error flag reset control mode"
                         mask="0x00000010"
                         name="FERRCTRL"/>
               <bitfield caption="High Speed Mode" mask="0x00000100" name="HSMODE"/>
               <bitfield caption="Synchronize on the last block"
                         mask="0x00001000"
                         name="LSYNC"/>
            </register>
            <register caption="Write Protection Mode Register"
                      name="HSMCI_WPMR"
                      offset="0xE4"
                      rw="RW"
                      size="4">
               <bitfield caption="Write Protect Enable" mask="0x00000001" name="WPEN"/>
               <bitfield caption="Write Protect Key"
                         mask="0xFFFFFF00"
                         name="WPKEY"
                         values="HSMCI_WPMR__WPKEY"/>
            </register>
            <register caption="Write Protection Status Register"
                      name="HSMCI_WPSR"
                      offset="0xE8"
                      rw="R"
                      size="4">
               <bitfield caption="Write Protection Violation Status"
                         mask="0x00000001"
                         name="WPVS"/>
               <bitfield caption="Write Protection Violation Source"
                         mask="0x00FFFF00"
                         name="WPVSRC"/>
            </register>
            <register caption="FIFO Memory Aperture0 0"
                      name="HSMCI_FIFO"
                      offset="0x200"
                      rw="RW"
                      size="4"
                      count="256">
               <bitfield caption="Data to Read or Data to Write"
                         mask="0xFFFFFFFF"
                         name="DATA"/>
            </register>
         </register-group>
         <value-group caption="" name="HSMCI_DTOR__DTOMUL">
            <value caption="DTOCYC" name="_1" value="0x0"/>
            <value caption="DTOCYC x 16" name="_16" value="0x1"/>
            <value caption="DTOCYC x 128" name="_128" value="0x2"/>
            <value caption="DTOCYC x 256" name="_256" value="0x3"/>
            <value caption="DTOCYC x 1024" name="_1024" value="0x4"/>
            <value caption="DTOCYC x 4096" name="_4096" value="0x5"/>
            <value caption="DTOCYC x 65536" name="_65536" value="0x6"/>
            <value caption="DTOCYC x 1048576" name="_1048576" value="0x7"/>
         </value-group>
         <value-group caption="" name="HSMCI_SDCR__SDCSEL">
            <value caption="Slot A is selected." name="SLOTA" value="0"/>
         </value-group>
         <value-group caption="" name="HSMCI_SDCR__SDCBUS">
            <value caption="1 bit" name="_1" value="0x0"/>
            <value caption="4 bits" name="_4" value="0x2"/>
            <value caption="8 bits" name="_8" value="0x3"/>
         </value-group>
         <value-group caption="" name="HSMCI_CMDR__RSPTYP">
            <value caption="No response" name="NORESP" value="0x0"/>
            <value caption="48-bit response" name="_48_BIT" value="0x1"/>
            <value caption="136-bit response" name="_136_BIT" value="0x2"/>
            <value caption="R1b response type" name="R1B" value="0x3"/>
         </value-group>
         <value-group caption="" name="HSMCI_CMDR__SPCMD">
            <value caption="Not a special CMD." name="STD" value="0x0"/>
            <value caption="Initialization CMD: 74 clock cycles for initialization sequence."
                   name="INIT"
                   value="0x1"/>
            <value caption="Synchronized CMD: Wait for the end of the current data block transfer before sending the pending command."
                   name="SYNC"
                   value="0x2"/>
            <value caption="CE-ATA Completion Signal disable Command. The host cancels the ability for the device to return a command completion signal on the command line."
                   name="CE_ATA"
                   value="0x3"/>
            <value caption="Interrupt command: Corresponds to the Interrupt Mode (CMD40)."
                   name="IT_CMD"
                   value="0x4"/>
            <value caption="Interrupt response: Corresponds to the Interrupt Mode (CMD40)."
                   name="IT_RESP"
                   value="0x5"/>
            <value caption="Boot Operation Request. Start a boot operation mode, the host processor can read boot data from the MMC device directly."
                   name="BOR"
                   value="0x6"/>
            <value caption="End Boot Operation. This command allows the host processor to terminate the boot operation mode."
                   name="EBO"
                   value="0x7"/>
         </value-group>
         <value-group caption="" name="HSMCI_CMDR__OPDCMD">
            <value caption="Push pull command." name="PUSHPULL" value="0"/>
            <value caption="Open drain command." name="OPENDRAIN" value="1"/>
         </value-group>
