Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.9.117/samv71b/atdf/ATSAMV71N21B.atdf
         <value-group caption="" name="HSMCI_CMDR__MAXLAT">
            <value caption="5-cycle max latency." name="_5" value="0"/>
            <value caption="64-cycle max latency." name="_64" value="1"/>
         </value-group>
         <value-group caption="" name="HSMCI_CMDR__TRCMD">
            <value caption="No data transfer" name="NO_DATA" value="0x0"/>
            <value caption="Start data transfer" name="START_DATA" value="0x1"/>
            <value caption="Stop data transfer" name="STOP_DATA" value="0x2"/>
         </value-group>
         <value-group caption="" name="HSMCI_CMDR__TRDIR">
            <value caption="Write." name="WRITE" value="0"/>
            <value caption="Read." name="READ" value="1"/>
         </value-group>
         <value-group caption="" name="HSMCI_CMDR__TRTYP">
            <value caption="MMC/SD Card Single Block" name="SINGLE" value="0x0"/>
            <value caption="MMC/SD Card Multiple Block" name="MULTIPLE" value="0x1"/>
            <value caption="MMC Stream" name="STREAM" value="0x2"/>
            <value caption="SDIO Byte" name="BYTE" value="0x4"/>
            <value caption="SDIO Block" name="BLOCK" value="0x5"/>
         </value-group>
         <value-group caption="" name="HSMCI_CMDR__IOSPCMD">
            <value caption="Not an SDIO Special Command" name="STD" value="0x0"/>
            <value caption="SDIO Suspend Command" name="SUSPEND" value="0x1"/>
            <value caption="SDIO Resume Command" name="RESUME" value="0x2"/>
         </value-group>
         <value-group caption="" name="HSMCI_CMDR__ATACS">
            <value caption="Normal operation mode." name="NORMAL" value="0"/>
            <value caption="This bit indicates that a completion signal is expected within a programmed amount of time (HSMCI_CSTOR)."
                   name="COMPLETION"
                   value="1"/>
         </value-group>
         <value-group caption="" name="HSMCI_CSTOR__CSTOMUL">
            <value caption="CSTOCYC x 1" name="_1" value="0x0"/>
            <value caption="CSTOCYC x 16" name="_16" value="0x1"/>
            <value caption="CSTOCYC x 128" name="_128" value="0x2"/>
            <value caption="CSTOCYC x 256" name="_256" value="0x3"/>
            <value caption="CSTOCYC x 1024" name="_1024" value="0x4"/>
            <value caption="CSTOCYC x 4096" name="_4096" value="0x5"/>
            <value caption="CSTOCYC x 65536" name="_65536" value="0x6"/>
            <value caption="CSTOCYC x 1048576" name="_1048576" value="0x7"/>
         </value-group>
         <value-group caption="" name="HSMCI_DMA__CHKSIZE">
            <value caption="1 data available" name="_1" value="0x0"/>
            <value caption="2 data available" name="_2" value="0x1"/>
            <value caption="4 data available" name="_4" value="0x2"/>
            <value caption="8 data available" name="_8" value="0x3"/>
            <value caption="16 data available" name="_16" value="0x4"/>
         </value-group>
         <value-group caption="" name="HSMCI_WPMR__WPKEY">
            <value caption="Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0."
                   name="PASSWD"
                   value="0x4D4349"/>
         </value-group>
      </module>
      <module name="I2SC"
              caption="Inter-IC Sound Controller"
              id="11241"
              version="N">
         <register-group name="I2SC">
            <register caption="Control Register"
                      name="I2SC_CR"
                      offset="0x00"
                      rw="W"
                      size="4">
               <bitfield caption="Receiver Enable" mask="0x00000001" name="RXEN"/>
               <bitfield caption="Receiver Disable" mask="0x00000002" name="RXDIS"/>
               <bitfield caption="Clocks Enable" mask="0x00000004" name="CKEN"/>
               <bitfield caption="Clocks Disable" mask="0x00000008" name="CKDIS"/>
               <bitfield caption="Transmitter Enable" mask="0x00000010" name="TXEN"/>
               <bitfield caption="Transmitter Disable" mask="0x00000020" name="TXDIS"/>
               <bitfield caption="Software Reset" mask="0x00000080" name="SWRST"/>
            </register>
            <register caption="Mode Register"
                      name="I2SC_MR"
                      offset="0x04"
                      rw="RW"
                      size="4">
               <bitfield caption="Inter-IC Sound Controller Mode"
                         mask="0x00000001"
                         name="MODE"
                         values="I2SC_MR__MODE"/>
               <bitfield caption="Data Word Length"
                         mask="0x0000001C"
                         name="DATALENGTH"
                         values="I2SC_MR__DATALENGTH"/>
               <bitfield caption="Receive Mono" mask="0x00000100" name="RXMONO"/>
               <bitfield caption="Single or Multiple DMA Controller Channels for Receiver"
                         mask="0x00000200"
                         name="RXDMA"/>
               <bitfield caption="Loopback Test Mode" mask="0x00000400" name="RXLOOP"/>
               <bitfield caption="Transmit Mono" mask="0x00001000" name="TXMONO"/>
               <bitfield caption="Single or Multiple DMA Controller Channels for Transmitter"
                         mask="0x00002000"
                         name="TXDMA"/>
               <bitfield caption="Transmit Data when Underrun"
                         mask="0x00004000"
                         name="TXSAME"/>
               <bitfield caption="Selected Clock to I2SC Master Clock Ratio"
                         mask="0x003F0000"
                         name="IMCKDIV"/>
               <bitfield caption="Master Clock to fs Ratio"
                         mask="0x3F000000"
                         name="IMCKFS"
                         values="I2SC_MR__IMCKFS"/>
               <bitfield caption="Master Clock Mode" mask="0x40000000" name="IMCKMODE"/>
               <bitfield caption="I2SC_WS Slot Width" mask="0x80000000" name="IWS"/>
            </register>
            <register caption="Status Register"
                      name="I2SC_SR"
                      offset="0x08"
                      rw="R"
                      size="4">
               <bitfield caption="Receiver Enabled" mask="0x00000001" name="RXEN"/>
               <bitfield caption="Receive Ready" mask="0x00000002" name="RXRDY"/>
               <bitfield caption="Receive Overrun" mask="0x00000004" name="RXOR"/>
               <bitfield caption="Transmitter Enabled" mask="0x00000010" name="TXEN"/>
               <bitfield caption="Transmit Ready" mask="0x00000020" name="TXRDY"/>
               <bitfield caption="Transmit Underrun" mask="0x00000040" name="TXUR"/>
               <bitfield caption="Receive Overrun Channel" mask="0x00000300" name="RXORCH"/>
               <bitfield caption="Transmit Underrun Channel" mask="0x00300000" name="TXURCH"/>
            </register>
            <register caption="Status Clear Register"
                      name="I2SC_SCR"
                      offset="0x0C"
                      rw="W"
                      size="4">
               <bitfield caption="Receive Overrun Status Clear"
                         mask="0x00000004"
                         name="RXOR"/>
               <bitfield caption="Transmit Underrun Status Clear"
                         mask="0x00000040"
                         name="TXUR"/>
               <bitfield caption="Receive Overrun Per Channel Status Clear"
                         mask="0x00000300"
                         name="RXORCH"/>
               <bitfield caption="Transmit Underrun Per Channel Status Clear"
                         mask="0x00300000"
                         name="TXURCH"/>
            </register>
            <register caption="Status Set Register"
                      name="I2SC_SSR"
                      offset="0x10"
                      rw="W"
                      size="4">
               <bitfield caption="Receive Overrun Status Set" mask="0x00000004" name="RXOR"/>
               <bitfield caption="Transmit Underrun Status Set"
                         mask="0x00000040"
                         name="TXUR"/>
               <bitfield caption="Receive Overrun Per Channel Status Set"
                         mask="0x00000300"
                         name="RXORCH"/>
               <bitfield caption="Transmit Underrun Per Channel Status Set"
                         mask="0x00300000"
                         name="TXURCH"/>
            </register>
            <register caption="Interrupt Enable Register"
                      name="I2SC_IER"
                      offset="0x14"
                      rw="W"
                      size="4"
                      atomic-op="set:I2SC_IMR">
               <bitfield caption="Receiver Ready Interrupt Enable"
                         mask="0x00000002"
                         name="RXRDY"/>
               <bitfield caption="Receiver Overrun Interrupt Enable"
                         mask="0x00000004"
                         name="RXOR"/>
               <bitfield caption="Transmit Ready Interrupt Enable"
                         mask="0x00000020"
                         name="TXRDY"/>
               <bitfield caption="Transmit Underflow Interrupt Enable"
                         mask="0x00000040"
                         name="TXUR"/>
            </register>
            <register caption="Interrupt Disable Register"
                      name="I2SC_IDR"
                      offset="0x18"
                      rw="W"
                      size="4"
                      atomic-op="clear:I2SC_IMR">
               <bitfield caption="Receiver Ready Interrupt Disable"
                         mask="0x00000002"
                         name="RXRDY"/>
               <bitfield caption="Receiver Overrun Interrupt Disable"
                         mask="0x00000004"
                         name="RXOR"/>
               <bitfield caption="Transmit Ready Interrupt Disable"
                         mask="0x00000020"
                         name="TXRDY"/>
               <bitfield caption="Transmit Underflow Interrupt Disable"
                         mask="0x00000040"
                         name="TXUR"/>
            </register>
