Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.9.117/samv71b/atdf/ATSAMV71N21B.atdf
            <register caption="Interrupt Register"
                      name="MCAN_IR"
                      offset="0x50"
                      rw="RW"
                      size="4">
               <bitfield caption="Receive FIFO 0 New Message" mask="0x00000001" name="RF0N"/>
               <bitfield caption="Receive FIFO 0 Watermark Reached"
                         mask="0x00000002"
                         name="RF0W"/>
               <bitfield caption="Receive FIFO 0 Full" mask="0x00000004" name="RF0F"/>
               <bitfield caption="Receive FIFO 0 Message Lost" mask="0x00000008" name="RF0L"/>
               <bitfield caption="Receive FIFO 1 New Message" mask="0x00000010" name="RF1N"/>
               <bitfield caption="Receive FIFO 1 Watermark Reached"
                         mask="0x00000020"
                         name="RF1W"/>
               <bitfield caption="Receive FIFO 1 Full" mask="0x00000040" name="RF1F"/>
               <bitfield caption="Receive FIFO 1 Message Lost" mask="0x00000080" name="RF1L"/>
               <bitfield caption="High Priority Message" mask="0x00000100" name="HPM"/>
               <bitfield caption="Transmission Completed" mask="0x00000200" name="TC"/>
               <bitfield caption="Transmission Cancellation Finished"
                         mask="0x00000400"
                         name="TCF"/>
               <bitfield caption="Tx FIFO Empty" mask="0x00000800" name="TFE"/>
               <bitfield caption="Tx Event FIFO New Entry" mask="0x00001000" name="TEFN"/>
               <bitfield caption="Tx Event FIFO Watermark Reached"
                         mask="0x00002000"
                         name="TEFW"/>
               <bitfield caption="Tx Event FIFO Full" mask="0x00004000" name="TEFF"/>
               <bitfield caption="Tx Event FIFO Element Lost" mask="0x00008000" name="TEFL"/>
               <bitfield caption="Timestamp Wraparound" mask="0x00010000" name="TSW"/>
               <bitfield caption="Message RAM Access Failure" mask="0x00020000" name="MRAF"/>
               <bitfield caption="Timeout Occurred" mask="0x00040000" name="TOO"/>
               <bitfield caption="Message stored to Dedicated Receive Buffer"
                         mask="0x00080000"
                         name="DRX"/>
               <bitfield caption="Error Logging Overflow" mask="0x00400000" name="ELO"/>
               <bitfield caption="Error Passive" mask="0x00800000" name="EP"/>
               <bitfield caption="Warning Status" mask="0x01000000" name="EW"/>
               <bitfield caption="Bus_Off Status" mask="0x02000000" name="BO"/>
               <bitfield caption="Watchdog Interrupt" mask="0x04000000" name="WDI"/>
               <bitfield caption="Protocol Error in Arbitration Phase"
                         mask="0x08000000"
                         name="PEA"/>
               <bitfield caption="Protocol Error in Data Phase" mask="0x10000000" name="PED"/>
               <bitfield caption="Access to Reserved Address" mask="0x20000000" name="ARA"/>
            </register>
            <register caption="Interrupt Enable Register"
                      name="MCAN_IE"
                      offset="0x54"
                      rw="RW"
                      size="4">
               <bitfield caption="Receive FIFO 0 New Message Interrupt Enable"
                         mask="0x00000001"
                         name="RF0NE"/>
               <bitfield caption="Receive FIFO 0 Watermark Reached Interrupt Enable"
                         mask="0x00000002"
                         name="RF0WE"/>
               <bitfield caption="Receive FIFO 0 Full Interrupt Enable"
                         mask="0x00000004"
                         name="RF0FE"/>
               <bitfield caption="Receive FIFO 0 Message Lost Interrupt Enable"
                         mask="0x00000008"
                         name="RF0LE"/>
               <bitfield caption="Receive FIFO 1 New Message Interrupt Enable"
                         mask="0x00000010"
                         name="RF1NE"/>
               <bitfield caption="Receive FIFO 1 Watermark Reached Interrupt Enable"
                         mask="0x00000020"
                         name="RF1WE"/>
               <bitfield caption="Receive FIFO 1 Full Interrupt Enable"
                         mask="0x00000040"
                         name="RF1FE"/>
               <bitfield caption="Receive FIFO 1 Message Lost Interrupt Enable"
                         mask="0x00000080"
                         name="RF1LE"/>
               <bitfield caption="High Priority Message Interrupt Enable"
                         mask="0x00000100"
                         name="HPME"/>
               <bitfield caption="Transmission Completed Interrupt Enable"
                         mask="0x00000200"
                         name="TCE"/>
               <bitfield caption="Transmission Cancellation Finished Interrupt Enable"
                         mask="0x00000400"
                         name="TCFE"/>
               <bitfield caption="Tx FIFO Empty Interrupt Enable"
                         mask="0x00000800"
                         name="TFEE"/>
               <bitfield caption="Tx Event FIFO New Entry Interrupt Enable"
                         mask="0x00001000"
                         name="TEFNE"/>
               <bitfield caption="Tx Event FIFO Watermark Reached Interrupt Enable"
                         mask="0x00002000"
                         name="TEFWE"/>
               <bitfield caption="Tx Event FIFO Full Interrupt Enable"
                         mask="0x00004000"
                         name="TEFFE"/>
               <bitfield caption="Tx Event FIFO Event Lost Interrupt Enable"
                         mask="0x00008000"
                         name="TEFLE"/>
               <bitfield caption="Timestamp Wraparound Interrupt Enable"
                         mask="0x00010000"
                         name="TSWE"/>
               <bitfield caption="Message RAM Access Failure Interrupt Enable"
                         mask="0x00020000"
                         name="MRAFE"/>
               <bitfield caption="Timeout Occurred Interrupt Enable"
                         mask="0x00040000"
                         name="TOOE"/>
               <bitfield caption="Message stored to Dedicated Receive Buffer Interrupt Enable"
                         mask="0x00080000"
                         name="DRXE"/>
               <bitfield caption="Error Logging Overflow Interrupt Enable"
                         mask="0x00400000"
                         name="ELOE"/>
               <bitfield caption="Error Passive Interrupt Enable"
                         mask="0x00800000"
                         name="EPE"/>
               <bitfield caption="Warning Status Interrupt Enable"
                         mask="0x01000000"
                         name="EWE"/>
               <bitfield caption="Bus_Off Status Interrupt Enable"
                         mask="0x02000000"
                         name="BOE"/>
               <bitfield caption="Watchdog Interrupt Enable" mask="0x04000000" name="WDIE"/>
               <bitfield caption="Protocol Error in Arbitration Phase Enable"
                         mask="0x08000000"
                         name="PEAE"/>
               <bitfield caption="Protocol Error in Data Phase Enable"
                         mask="0x10000000"
                         name="PEDE"/>
               <bitfield caption="Access to Reserved Address Enable"
                         mask="0x20000000"
                         name="ARAE"/>
            </register>
            <register caption="Interrupt Line Select Register"
                      name="MCAN_ILS"
                      offset="0x58"
                      rw="RW"
                      size="4">
               <bitfield caption="Receive FIFO 0 New Message Interrupt Line"
                         mask="0x00000001"
                         name="RF0NL"/>
               <bitfield caption="Receive FIFO 0 Watermark Reached Interrupt Line"
                         mask="0x00000002"
                         name="RF0WL"/>
               <bitfield caption="Receive FIFO 0 Full Interrupt Line"
                         mask="0x00000004"
                         name="RF0FL"/>
               <bitfield caption="Receive FIFO 0 Message Lost Interrupt Line"
                         mask="0x00000008"
                         name="RF0LL"/>
               <bitfield caption="Receive FIFO 1 New Message Interrupt Line"
                         mask="0x00000010"
                         name="RF1NL"/>
               <bitfield caption="Receive FIFO 1 Watermark Reached Interrupt Line"
                         mask="0x00000020"
                         name="RF1WL"/>
               <bitfield caption="Receive FIFO 1 Full Interrupt Line"
                         mask="0x00000040"
                         name="RF1FL"/>
               <bitfield caption="Receive FIFO 1 Message Lost Interrupt Line"
                         mask="0x00000080"
                         name="RF1LL"/>
               <bitfield caption="High Priority Message Interrupt Line"
                         mask="0x00000100"
                         name="HPML"/>
               <bitfield caption="Transmission Completed Interrupt Line"
                         mask="0x00000200"
                         name="TCL"/>
               <bitfield caption="Transmission Cancellation Finished Interrupt Line"
                         mask="0x00000400"
                         name="TCFL"/>
               <bitfield caption="Tx FIFO Empty Interrupt Line"
                         mask="0x00000800"
                         name="TFEL"/>
               <bitfield caption="Tx Event FIFO New Entry Interrupt Line"
                         mask="0x00001000"
                         name="TEFNL"/>
               <bitfield caption="Tx Event FIFO Watermark Reached Interrupt Line"
                         mask="0x00002000"
                         name="TEFWL"/>
               <bitfield caption="Tx Event FIFO Full Interrupt Line"
                         mask="0x00004000"
                         name="TEFFL"/>
               <bitfield caption="Tx Event FIFO Event Lost Interrupt Line"
                         mask="0x00008000"
                         name="TEFLL"/>
               <bitfield caption="Timestamp Wraparound Interrupt Line"
                         mask="0x00010000"
                         name="TSWL"/>
               <bitfield caption="Message RAM Access Failure Interrupt Line"
                         mask="0x00020000"
                         name="MRAFL"/>
               <bitfield caption="Timeout Occurred Interrupt Line"
                         mask="0x00040000"
                         name="TOOL"/>
               <bitfield caption="Message stored to Dedicated Receive Buffer Interrupt Line"
                         mask="0x00080000"
                         name="DRXL"/>
               <bitfield caption="Error Logging Overflow Interrupt Line"
                         mask="0x00400000"
                         name="ELOL"/>
               <bitfield caption="Error Passive Interrupt Line" mask="0x00800000" name="EPL"/>
               <bitfield caption="Warning Status Interrupt Line"
                         mask="0x01000000"
                         name="EWL"/>
               <bitfield caption="Bus_Off Status Interrupt Line"
                         mask="0x02000000"
                         name="BOL"/>
               <bitfield caption="Watchdog Interrupt Line" mask="0x04000000" name="WDIL"/>
               <bitfield caption="Protocol Error in Arbitration Phase Line"
                         mask="0x08000000"
                         name="PEAL"/>
               <bitfield caption="Protocol Error in Data Phase Line"
                         mask="0x10000000"
                         name="PEDL"/>
               <bitfield caption="Access to Reserved Address Line"
                         mask="0x20000000"
                         name="ARAL"/>
            </register>
            <register caption="Interrupt Line Enable Register"
                      name="MCAN_ILE"
                      offset="0x5C"
                      rw="RW"
                      size="4">
               <bitfield caption="Enable Interrupt Line 0" mask="0x00000001" name="EINT0"/>
               <bitfield caption="Enable Interrupt Line 1" mask="0x00000002" name="EINT1"/>
            </register>
            <register caption="Global Filter Configuration Register"
                      name="MCAN_GFC"
                      offset="0x80"
                      rw="RW"
                      size="4">
               <bitfield caption="Reject Remote Frames Extended"
                         mask="0x00000001"
                         name="RRFE"
                         values="MCAN_GFC__RRFE"/>
               <bitfield caption="Reject Remote Frames Standard"
                         mask="0x00000002"
                         name="RRFS"
                         values="MCAN_GFC__RRFS"/>
               <bitfield caption="Accept Non-matching Frames Extended"
                         mask="0x0000000C"
                         name="ANFE"
                         values="MCAN_GFC__ANFE"/>
               <bitfield caption="Accept Non-matching Frames Standard"
                         mask="0x00000030"
                         name="ANFS"
                         values="MCAN_GFC__ANFS"/>
            </register>
