Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.9.117/samv71b/atdf/ATSAMV71N21B.atdf
            <register caption="Transmit Buffer Cancellation Finished Interrupt Enable Register"
                      name="MCAN_TXBCIE"
                      offset="0xE4"
                      rw="RW"
                      size="4">
               <bitfield caption="Cancellation Finished Interrupt Enable for Transmit Buffer 0"
                         mask="0x00000001"
                         name="CFIE0"/>
               <bitfield caption="Cancellation Finished Interrupt Enable for Transmit Buffer 1"
                         mask="0x00000002"
                         name="CFIE1"/>
               <bitfield caption="Cancellation Finished Interrupt Enable for Transmit Buffer 2"
                         mask="0x00000004"
                         name="CFIE2"/>
               <bitfield caption="Cancellation Finished Interrupt Enable for Transmit Buffer 3"
                         mask="0x00000008"
                         name="CFIE3"/>
               <bitfield caption="Cancellation Finished Interrupt Enable for Transmit Buffer 4"
                         mask="0x00000010"
                         name="CFIE4"/>
               <bitfield caption="Cancellation Finished Interrupt Enable for Transmit Buffer 5"
                         mask="0x00000020"
                         name="CFIE5"/>
               <bitfield caption="Cancellation Finished Interrupt Enable for Transmit Buffer 6"
                         mask="0x00000040"
                         name="CFIE6"/>
               <bitfield caption="Cancellation Finished Interrupt Enable for Transmit Buffer 7"
                         mask="0x00000080"
                         name="CFIE7"/>
               <bitfield caption="Cancellation Finished Interrupt Enable for Transmit Buffer 8"
                         mask="0x00000100"
                         name="CFIE8"/>
               <bitfield caption="Cancellation Finished Interrupt Enable for Transmit Buffer 9"
                         mask="0x00000200"
                         name="CFIE9"/>
               <bitfield caption="Cancellation Finished Interrupt Enable for Transmit Buffer 10"
                         mask="0x00000400"
                         name="CFIE10"/>
               <bitfield caption="Cancellation Finished Interrupt Enable for Transmit Buffer 11"
                         mask="0x00000800"
                         name="CFIE11"/>
               <bitfield caption="Cancellation Finished Interrupt Enable for Transmit Buffer 12"
                         mask="0x00001000"
                         name="CFIE12"/>
               <bitfield caption="Cancellation Finished Interrupt Enable for Transmit Buffer 13"
                         mask="0x00002000"
                         name="CFIE13"/>
               <bitfield caption="Cancellation Finished Interrupt Enable for Transmit Buffer 14"
                         mask="0x00004000"
                         name="CFIE14"/>
               <bitfield caption="Cancellation Finished Interrupt Enable for Transmit Buffer 15"
                         mask="0x00008000"
                         name="CFIE15"/>
               <bitfield caption="Cancellation Finished Interrupt Enable for Transmit Buffer 16"
                         mask="0x00010000"
                         name="CFIE16"/>
               <bitfield caption="Cancellation Finished Interrupt Enable for Transmit Buffer 17"
                         mask="0x00020000"
                         name="CFIE17"/>
               <bitfield caption="Cancellation Finished Interrupt Enable for Transmit Buffer 18"
                         mask="0x00040000"
                         name="CFIE18"/>
               <bitfield caption="Cancellation Finished Interrupt Enable for Transmit Buffer 19"
                         mask="0x00080000"
                         name="CFIE19"/>
               <bitfield caption="Cancellation Finished Interrupt Enable for Transmit Buffer 20"
                         mask="0x00100000"
                         name="CFIE20"/>
               <bitfield caption="Cancellation Finished Interrupt Enable for Transmit Buffer 21"
                         mask="0x00200000"
                         name="CFIE21"/>
               <bitfield caption="Cancellation Finished Interrupt Enable for Transmit Buffer 22"
                         mask="0x00400000"
                         name="CFIE22"/>
               <bitfield caption="Cancellation Finished Interrupt Enable for Transmit Buffer 23"
                         mask="0x00800000"
                         name="CFIE23"/>
               <bitfield caption="Cancellation Finished Interrupt Enable for Transmit Buffer 24"
                         mask="0x01000000"
                         name="CFIE24"/>
               <bitfield caption="Cancellation Finished Interrupt Enable for Transmit Buffer 25"
                         mask="0x02000000"
                         name="CFIE25"/>
               <bitfield caption="Cancellation Finished Interrupt Enable for Transmit Buffer 26"
                         mask="0x04000000"
                         name="CFIE26"/>
               <bitfield caption="Cancellation Finished Interrupt Enable for Transmit Buffer 27"
                         mask="0x08000000"
                         name="CFIE27"/>
               <bitfield caption="Cancellation Finished Interrupt Enable for Transmit Buffer 28"
                         mask="0x10000000"
                         name="CFIE28"/>
               <bitfield caption="Cancellation Finished Interrupt Enable for Transmit Buffer 29"
                         mask="0x20000000"
                         name="CFIE29"/>
               <bitfield caption="Cancellation Finished Interrupt Enable for Transmit Buffer 30"
                         mask="0x40000000"
                         name="CFIE30"/>
               <bitfield caption="Cancellation Finished Interrupt Enable for Transmit Buffer 31"
                         mask="0x80000000"
                         name="CFIE31"/>
            </register>
            <register caption="Transmit Event FIFO Configuration Register"
                      name="MCAN_TXEFC"
                      offset="0xF0"
                      rw="RW"
                      size="4">
               <bitfield caption="Event FIFO Start Address" mask="0x0000FFFC" name="EFSA"/>
               <bitfield caption="Event FIFO Size" mask="0x003F0000" name="EFS"/>
               <bitfield caption="Event FIFO Watermark" mask="0x3F000000" name="EFWM"/>
            </register>
            <register caption="Transmit Event FIFO Status Register"
                      name="MCAN_TXEFS"
                      offset="0xF4"
                      rw="R"
                      size="4">
               <bitfield caption="Event FIFO Fill Level" mask="0x0000003F" name="EFFL"/>
               <bitfield caption="Event FIFO Get Index" mask="0x00001F00" name="EFGI"/>
               <bitfield caption="Event FIFO Put Index" mask="0x001F0000" name="EFPI"/>
               <bitfield caption="Event FIFO Full" mask="0x01000000" name="EFF"/>
               <bitfield caption="Tx Event FIFO Element Lost" mask="0x02000000" name="TEFL"/>
            </register>
            <register caption="Transmit Event FIFO Acknowledge Register"
                      name="MCAN_TXEFA"
                      offset="0xF8"
                      rw="RW"
                      size="4">
               <bitfield caption="Event FIFO Acknowledge Index"
                         mask="0x0000001F"
                         name="EFAI"/>
            </register>
         </register-group>
         <register-group caption="Rx Buffer Element" name="MCAN_RXBE" aligned="4">
            <register caption="Rx Buffer Element 0"
                      name="MCAN_RXBE_0"
                      offset="0x0"
                      rw="RW"
                      size="4">
               <bitfield caption="Identifier" mask="0x1FFFFFFF" name="ID"/>
               <bitfield caption="Remote Transmission Request" mask="0x20000000" name="RTR"/>
               <bitfield caption="Extended Identifier" mask="0x40000000" name="XTD"/>
               <bitfield caption="Error State Indicator" mask="0x80000000" name="ESI"/>
            </register>
            <register caption="Rx Buffer Element 1"
                      name="MCAN_RXBE_1"
                      offset="0x4"
                      rw="RW"
                      size="4">
               <bitfield caption="Rx Timestamp" mask="0x0000FFFF" name="RXTS"/>
               <bitfield caption="Data Length Code" mask="0x000F0000" name="DLC"/>
               <bitfield caption="Bit Rate Switch" mask="0x00100000" name="BRS"/>
               <bitfield caption="FD Format" mask="0x00200000" name="FDF"/>
               <bitfield caption="Filter Index" mask="0x7F000000" name="FIDX"/>
               <bitfield caption="Accepted Non-matching Frame" mask="0x80000000" name="ANMF"/>
            </register>
            <register caption="Rx Buffer Element Data"
                      name="MCAN_RXBE_DATA"
                      offset="0x8"
                      rw="RW"
                      size="4">
               <bitfield caption="Data Byte 0" mask="0x000000FF" name="DB0"/>
               <bitfield caption="Data Byte 1" mask="0x0000FF00" name="DB1"/>
               <bitfield caption="Data Byte 2" mask="0x00FF0000" name="DB2"/>
               <bitfield caption="Data Byte 3" mask="0xFF000000" name="DB3"/>
            </register>
         </register-group>
