Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.9.117/samv71b/atdf/ATSAMV71N21B.atdf
         <value-group caption="Event Type" name="MCAN_TXEFE_1__ET">
            <value caption="Tx event" name="TXE" value="1"/>
            <value caption="Transmission in spite of cancellation"
                   name="TXC"
                   value="2"/>
         </value-group>
         <value-group caption="Standard Filter Element Configuration"
                      name="MCAN_SIDFE_0__SFEC">
            <value caption="Disable filter element" name="DISABLE" value="0"/>
            <value caption="Store in Rx FIFO 0 if filter matches"
                   name="STF0M"
                   value="1"/>
            <value caption="Store in Rx FIFO 1 if filter matches"
                   name="STF1M"
                   value="2"/>
            <value caption="Reject ID if filter matches" name="REJECT" value="3"/>
            <value caption="Set priority if filter matches" name="PRIORITY" value="4"/>
            <value caption="Set priority and store in FIFO 0 if filter matches"
                   name="PRIF0M"
                   value="5"/>
            <value caption="Set priority and store in FIFO 1 if filter matches"
                   name="PRIF1M"
                   value="6"/>
            <value caption="Store into Rx Buffer" name="STRXBUF" value="7"/>
         </value-group>
         <value-group caption="Standard Filter Type" name="MCAN_SIDFE_0__SFT">
            <value caption="Range filter from SFID1 to SFID2" name="RANGE" value="0"/>
            <value caption="Dual ID filter for SF1ID or SF2ID" name="DUAL" value="1"/>
            <value caption="Classic filter" name="CLASSIC" value="2"/>
         </value-group>
         <value-group caption="Extended Filter Element Configuration"
                      name="MCAN_XIDFE_0__EFEC">
            <value caption="Disable filter element" name="DISABLE" value="0"/>
            <value caption="Store in Rx FIFO 0 if filter matches"
                   name="STF0M"
                   value="1"/>
            <value caption="Store in Rx FIFO 1 if filter matches"
                   name="STF1M"
                   value="2"/>
            <value caption="Reject ID if filter matches" name="REJECT" value="3"/>
            <value caption="Set priority if filter matches" name="PRIORITY" value="4"/>
            <value caption="Set priority and store in FIFO 0 if filter matches"
                   name="PRIF0M"
                   value="5"/>
            <value caption="Set priority and store in FIFO 1 if filter matches"
                   name="PRIF1M"
                   value="6"/>
            <value caption="Store into Rx Buffer" name="STRXBUF" value="7"/>
         </value-group>
         <value-group caption="Extended Filter Type" name="MCAN_XIDFE_1__EFT">
            <value caption="Range filter from EFID1 to EFID2" name="RANGE" value="0"/>
            <value caption="Dual ID filter for EFID1 or EFID2" name="DUAL" value="1"/>
            <value caption="Classic filter" name="CLASSIC" value="2"/>
            <value caption="Range filter from EFID1 to EFID2 with no XIDAM mask"
                   name="RANGE_NO_XIDAM"
                   value="3"/>
         </value-group>
      </module>
      <module name="MLB" caption="MediaLB" id="11287" version="E">
         <register-group name="MLB">
            <register caption="MediaLB Control 0 Register"
                      name="MLB_MLBC0"
                      offset="0x000"
                      rw="RW"
                      size="4">
               <bitfield caption="MediaLB Enable" mask="0x00000001" name="MLBEN"/>
               <bitfield caption="MLBCLK (MediaLB clock) Speed Select"
                         mask="0x0000001C"
                         name="MLBCLK"
                         values="MLB_MLBC0__MLBCLK"/>
               <bitfield caption="Must be Written to 0" mask="0x00000020" name="ZERO"/>
               <bitfield caption="MediaLB Lock Status (read-only)"
                         mask="0x00000080"
                         name="MLBLK"/>
               <bitfield caption="Asynchronous Tx Packet Retry"
                         mask="0x00001000"
                         name="ASYRETRY"/>
               <bitfield caption="Control Tx Packet Retry" mask="0x00004000" name="CTLRETRY"/>
               <bitfield caption="The number of frames per sub-buffer for synchronous channels"
                         mask="0x00038000"
                         name="FCNT"
                         values="MLB_MLBC0__FCNT"/>
            </register>
            <register caption="MediaLB Channel Status 0 Register"
                      name="MLB_MS0"
                      offset="0x00C"
                      rw="RW"
                      size="4">
               <bitfield caption="MediaLB Channel Status [31:0] (cleared by writing a 0)"
                         mask="0xFFFFFFFF"
                         name="MCS"/>
            </register>
            <register caption="MediaLB Channel Status1 Register"
                      name="MLB_MS1"
                      offset="0x014"
                      rw="RW"
                      size="4">
               <bitfield caption="MediaLB Channel Status [63:32] (cleared by writing a 0)"
                         mask="0xFFFFFFFF"
                         name="MCS"/>
            </register>
            <register caption="MediaLB System Status Register"
                      name="MLB_MSS"
                      offset="0x020"
                      rw="RW"
                      size="4">
               <bitfield caption="Reset System Command Detected in the System Quadlet (cleared by writing a 0)"
                         mask="0x00000001"
                         name="RSTSYSCMD"/>
               <bitfield caption="Network Lock System Command Detected in the System Quadlet (cleared by writing a 0)"
                         mask="0x00000002"
                         name="LKSYSCMD"/>
               <bitfield caption="Network Unlock System Command Detected in the System Quadlet (cleared by writing a 0)"
                         mask="0x00000004"
                         name="ULKSYSCMD"/>
               <bitfield caption="Channel Scan System Command Detected in the System Quadlet (cleared by writing a 0)"
                         mask="0x00000008"
                         name="CSSYSCMD"/>
               <bitfield caption="Software System Command Detected in the System Quadlet (cleared by writing a 0)"
                         mask="0x00000010"
                         name="SWSYSCMD"/>
               <bitfield caption="Service Request Enabled" mask="0x00000020" name="SERVREQ"/>
            </register>
            <register caption="MediaLB System Data Register"
                      name="MLB_MSD"
                      offset="0x024"
                      rw="R"
                      size="4">
               <bitfield caption="System Data (Byte 0)" mask="0x000000FF" name="SD0"/>
               <bitfield caption="System Data (Byte 1)" mask="0x0000FF00" name="SD1"/>
               <bitfield caption="System Data (Byte 2)" mask="0x00FF0000" name="SD2"/>
               <bitfield caption="System Data (Byte 3)" mask="0xFF000000" name="SD3"/>
            </register>
