Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.9.117/samv71b/atdf/ATSAMV71N21B.atdf
            <register caption="Interrupt Mask Register"
                      name="PIO_IMR"
                      offset="0x0048"
                      rw="R"
                      size="4"
                      atomic-op="read:PIO_IMR">
               <bitfield caption="Input Change Interrupt Mask" mask="0x00000001" name="P0"/>
               <bitfield caption="Input Change Interrupt Mask" mask="0x00000002" name="P1"/>
               <bitfield caption="Input Change Interrupt Mask" mask="0x00000004" name="P2"/>
               <bitfield caption="Input Change Interrupt Mask" mask="0x00000008" name="P3"/>
               <bitfield caption="Input Change Interrupt Mask" mask="0x00000010" name="P4"/>
               <bitfield caption="Input Change Interrupt Mask" mask="0x00000020" name="P5"/>
               <bitfield caption="Input Change Interrupt Mask" mask="0x00000040" name="P6"/>
               <bitfield caption="Input Change Interrupt Mask" mask="0x00000080" name="P7"/>
               <bitfield caption="Input Change Interrupt Mask" mask="0x00000100" name="P8"/>
               <bitfield caption="Input Change Interrupt Mask" mask="0x00000200" name="P9"/>
               <bitfield caption="Input Change Interrupt Mask" mask="0x00000400" name="P10"/>
               <bitfield caption="Input Change Interrupt Mask" mask="0x00000800" name="P11"/>
               <bitfield caption="Input Change Interrupt Mask" mask="0x00001000" name="P12"/>
               <bitfield caption="Input Change Interrupt Mask" mask="0x00002000" name="P13"/>
               <bitfield caption="Input Change Interrupt Mask" mask="0x00004000" name="P14"/>
               <bitfield caption="Input Change Interrupt Mask" mask="0x00008000" name="P15"/>
               <bitfield caption="Input Change Interrupt Mask" mask="0x00010000" name="P16"/>
               <bitfield caption="Input Change Interrupt Mask" mask="0x00020000" name="P17"/>
               <bitfield caption="Input Change Interrupt Mask" mask="0x00040000" name="P18"/>
               <bitfield caption="Input Change Interrupt Mask" mask="0x00080000" name="P19"/>
               <bitfield caption="Input Change Interrupt Mask" mask="0x00100000" name="P20"/>
               <bitfield caption="Input Change Interrupt Mask" mask="0x00200000" name="P21"/>
               <bitfield caption="Input Change Interrupt Mask" mask="0x00400000" name="P22"/>
               <bitfield caption="Input Change Interrupt Mask" mask="0x00800000" name="P23"/>
               <bitfield caption="Input Change Interrupt Mask" mask="0x01000000" name="P24"/>
               <bitfield caption="Input Change Interrupt Mask" mask="0x02000000" name="P25"/>
               <bitfield caption="Input Change Interrupt Mask" mask="0x04000000" name="P26"/>
               <bitfield caption="Input Change Interrupt Mask" mask="0x08000000" name="P27"/>
               <bitfield caption="Input Change Interrupt Mask" mask="0x10000000" name="P28"/>
               <bitfield caption="Input Change Interrupt Mask" mask="0x20000000" name="P29"/>
               <bitfield caption="Input Change Interrupt Mask" mask="0x40000000" name="P30"/>
               <bitfield caption="Input Change Interrupt Mask" mask="0x80000000" name="P31"/>
            </register>
            <register caption="Interrupt Status Register"
                      name="PIO_ISR"
                      offset="0x004C"
                      rw="R"
                      size="4"
                      atomic-op="clear:PIO_ISR">
               <bitfield caption="Input Change Interrupt Status" mask="0x00000001" name="P0"/>
               <bitfield caption="Input Change Interrupt Status" mask="0x00000002" name="P1"/>
               <bitfield caption="Input Change Interrupt Status" mask="0x00000004" name="P2"/>
               <bitfield caption="Input Change Interrupt Status" mask="0x00000008" name="P3"/>
               <bitfield caption="Input Change Interrupt Status" mask="0x00000010" name="P4"/>
               <bitfield caption="Input Change Interrupt Status" mask="0x00000020" name="P5"/>
               <bitfield caption="Input Change Interrupt Status" mask="0x00000040" name="P6"/>
               <bitfield caption="Input Change Interrupt Status" mask="0x00000080" name="P7"/>
               <bitfield caption="Input Change Interrupt Status" mask="0x00000100" name="P8"/>
               <bitfield caption="Input Change Interrupt Status" mask="0x00000200" name="P9"/>
               <bitfield caption="Input Change Interrupt Status"
                         mask="0x00000400"
                         name="P10"/>
               <bitfield caption="Input Change Interrupt Status"
                         mask="0x00000800"
                         name="P11"/>
               <bitfield caption="Input Change Interrupt Status"
                         mask="0x00001000"
                         name="P12"/>
               <bitfield caption="Input Change Interrupt Status"
                         mask="0x00002000"
                         name="P13"/>
               <bitfield caption="Input Change Interrupt Status"
                         mask="0x00004000"
                         name="P14"/>
               <bitfield caption="Input Change Interrupt Status"
                         mask="0x00008000"
                         name="P15"/>
               <bitfield caption="Input Change Interrupt Status"
                         mask="0x00010000"
                         name="P16"/>
               <bitfield caption="Input Change Interrupt Status"
                         mask="0x00020000"
                         name="P17"/>
               <bitfield caption="Input Change Interrupt Status"
                         mask="0x00040000"
                         name="P18"/>
               <bitfield caption="Input Change Interrupt Status"
                         mask="0x00080000"
                         name="P19"/>
               <bitfield caption="Input Change Interrupt Status"
                         mask="0x00100000"
                         name="P20"/>
               <bitfield caption="Input Change Interrupt Status"
                         mask="0x00200000"
                         name="P21"/>
               <bitfield caption="Input Change Interrupt Status"
                         mask="0x00400000"
                         name="P22"/>
               <bitfield caption="Input Change Interrupt Status"
                         mask="0x00800000"
                         name="P23"/>
               <bitfield caption="Input Change Interrupt Status"
                         mask="0x01000000"
                         name="P24"/>
               <bitfield caption="Input Change Interrupt Status"
                         mask="0x02000000"
                         name="P25"/>
               <bitfield caption="Input Change Interrupt Status"
                         mask="0x04000000"
                         name="P26"/>
               <bitfield caption="Input Change Interrupt Status"
                         mask="0x08000000"
                         name="P27"/>
               <bitfield caption="Input Change Interrupt Status"
                         mask="0x10000000"
                         name="P28"/>
               <bitfield caption="Input Change Interrupt Status"
                         mask="0x20000000"
                         name="P29"/>
               <bitfield caption="Input Change Interrupt Status"
                         mask="0x40000000"
                         name="P30"/>
               <bitfield caption="Input Change Interrupt Status"
                         mask="0x80000000"
                         name="P31"/>
            </register>
