Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.9.117/samv71b/atdf/ATSAMV71N21B.atdf
            <register caption="Input Filter Slow Clock Enable Register"
                      name="PIO_IFSCER"
                      offset="0x0084"
                      rw="W"
                      size="4"
                      atomic-op="set:PIO_IFSCSR">
               <bitfield caption="Slow Clock Debouncing Filtering Select"
                         mask="0x00000001"
                         name="P0"/>
               <bitfield caption="Slow Clock Debouncing Filtering Select"
                         mask="0x00000002"
                         name="P1"/>
               <bitfield caption="Slow Clock Debouncing Filtering Select"
                         mask="0x00000004"
                         name="P2"/>
               <bitfield caption="Slow Clock Debouncing Filtering Select"
                         mask="0x00000008"
                         name="P3"/>
               <bitfield caption="Slow Clock Debouncing Filtering Select"
                         mask="0x00000010"
                         name="P4"/>
               <bitfield caption="Slow Clock Debouncing Filtering Select"
                         mask="0x00000020"
                         name="P5"/>
               <bitfield caption="Slow Clock Debouncing Filtering Select"
                         mask="0x00000040"
                         name="P6"/>
               <bitfield caption="Slow Clock Debouncing Filtering Select"
                         mask="0x00000080"
                         name="P7"/>
               <bitfield caption="Slow Clock Debouncing Filtering Select"
                         mask="0x00000100"
                         name="P8"/>
               <bitfield caption="Slow Clock Debouncing Filtering Select"
                         mask="0x00000200"
                         name="P9"/>
               <bitfield caption="Slow Clock Debouncing Filtering Select"
                         mask="0x00000400"
                         name="P10"/>
               <bitfield caption="Slow Clock Debouncing Filtering Select"
                         mask="0x00000800"
                         name="P11"/>
               <bitfield caption="Slow Clock Debouncing Filtering Select"
                         mask="0x00001000"
                         name="P12"/>
               <bitfield caption="Slow Clock Debouncing Filtering Select"
                         mask="0x00002000"
                         name="P13"/>
               <bitfield caption="Slow Clock Debouncing Filtering Select"
                         mask="0x00004000"
                         name="P14"/>
               <bitfield caption="Slow Clock Debouncing Filtering Select"
                         mask="0x00008000"
                         name="P15"/>
               <bitfield caption="Slow Clock Debouncing Filtering Select"
                         mask="0x00010000"
                         name="P16"/>
               <bitfield caption="Slow Clock Debouncing Filtering Select"
                         mask="0x00020000"
                         name="P17"/>
               <bitfield caption="Slow Clock Debouncing Filtering Select"
                         mask="0x00040000"
                         name="P18"/>
               <bitfield caption="Slow Clock Debouncing Filtering Select"
                         mask="0x00080000"
                         name="P19"/>
               <bitfield caption="Slow Clock Debouncing Filtering Select"
                         mask="0x00100000"
                         name="P20"/>
               <bitfield caption="Slow Clock Debouncing Filtering Select"
                         mask="0x00200000"
                         name="P21"/>
               <bitfield caption="Slow Clock Debouncing Filtering Select"
                         mask="0x00400000"
                         name="P22"/>
               <bitfield caption="Slow Clock Debouncing Filtering Select"
                         mask="0x00800000"
                         name="P23"/>
               <bitfield caption="Slow Clock Debouncing Filtering Select"
                         mask="0x01000000"
                         name="P24"/>
               <bitfield caption="Slow Clock Debouncing Filtering Select"
                         mask="0x02000000"
                         name="P25"/>
               <bitfield caption="Slow Clock Debouncing Filtering Select"
                         mask="0x04000000"
                         name="P26"/>
               <bitfield caption="Slow Clock Debouncing Filtering Select"
                         mask="0x08000000"
                         name="P27"/>
               <bitfield caption="Slow Clock Debouncing Filtering Select"
                         mask="0x10000000"
                         name="P28"/>
               <bitfield caption="Slow Clock Debouncing Filtering Select"
                         mask="0x20000000"
                         name="P29"/>
               <bitfield caption="Slow Clock Debouncing Filtering Select"
                         mask="0x40000000"
                         name="P30"/>
               <bitfield caption="Slow Clock Debouncing Filtering Select"
                         mask="0x80000000"
                         name="P31"/>
            </register>
            <register caption="Input Filter Slow Clock Status Register"
                      name="PIO_IFSCSR"
                      offset="0x0088"
                      rw="R"
                      size="4">
               <bitfield caption="Glitch or Debouncing Filter Selection Status"
                         mask="0x00000001"
                         name="P0"/>
               <bitfield caption="Glitch or Debouncing Filter Selection Status"
                         mask="0x00000002"
                         name="P1"/>
               <bitfield caption="Glitch or Debouncing Filter Selection Status"
                         mask="0x00000004"
                         name="P2"/>
               <bitfield caption="Glitch or Debouncing Filter Selection Status"
                         mask="0x00000008"
                         name="P3"/>
               <bitfield caption="Glitch or Debouncing Filter Selection Status"
                         mask="0x00000010"
                         name="P4"/>
               <bitfield caption="Glitch or Debouncing Filter Selection Status"
                         mask="0x00000020"
                         name="P5"/>
               <bitfield caption="Glitch or Debouncing Filter Selection Status"
                         mask="0x00000040"
                         name="P6"/>
               <bitfield caption="Glitch or Debouncing Filter Selection Status"
                         mask="0x00000080"
                         name="P7"/>
               <bitfield caption="Glitch or Debouncing Filter Selection Status"
                         mask="0x00000100"
                         name="P8"/>
               <bitfield caption="Glitch or Debouncing Filter Selection Status"
                         mask="0x00000200"
                         name="P9"/>
               <bitfield caption="Glitch or Debouncing Filter Selection Status"
                         mask="0x00000400"
                         name="P10"/>
               <bitfield caption="Glitch or Debouncing Filter Selection Status"
                         mask="0x00000800"
                         name="P11"/>
               <bitfield caption="Glitch or Debouncing Filter Selection Status"
                         mask="0x00001000"
                         name="P12"/>
               <bitfield caption="Glitch or Debouncing Filter Selection Status"
                         mask="0x00002000"
                         name="P13"/>
               <bitfield caption="Glitch or Debouncing Filter Selection Status"
                         mask="0x00004000"
                         name="P14"/>
               <bitfield caption="Glitch or Debouncing Filter Selection Status"
                         mask="0x00008000"
                         name="P15"/>
               <bitfield caption="Glitch or Debouncing Filter Selection Status"
                         mask="0x00010000"
                         name="P16"/>
               <bitfield caption="Glitch or Debouncing Filter Selection Status"
                         mask="0x00020000"
                         name="P17"/>
               <bitfield caption="Glitch or Debouncing Filter Selection Status"
                         mask="0x00040000"
                         name="P18"/>
               <bitfield caption="Glitch or Debouncing Filter Selection Status"
                         mask="0x00080000"
                         name="P19"/>
               <bitfield caption="Glitch or Debouncing Filter Selection Status"
                         mask="0x00100000"
                         name="P20"/>
               <bitfield caption="Glitch or Debouncing Filter Selection Status"
                         mask="0x00200000"
                         name="P21"/>
               <bitfield caption="Glitch or Debouncing Filter Selection Status"
                         mask="0x00400000"
                         name="P22"/>
               <bitfield caption="Glitch or Debouncing Filter Selection Status"
                         mask="0x00800000"
                         name="P23"/>
               <bitfield caption="Glitch or Debouncing Filter Selection Status"
                         mask="0x01000000"
                         name="P24"/>
               <bitfield caption="Glitch or Debouncing Filter Selection Status"
                         mask="0x02000000"
                         name="P25"/>
               <bitfield caption="Glitch or Debouncing Filter Selection Status"
                         mask="0x04000000"
                         name="P26"/>
               <bitfield caption="Glitch or Debouncing Filter Selection Status"
                         mask="0x08000000"
                         name="P27"/>
               <bitfield caption="Glitch or Debouncing Filter Selection Status"
                         mask="0x10000000"
                         name="P28"/>
               <bitfield caption="Glitch or Debouncing Filter Selection Status"
                         mask="0x20000000"
                         name="P29"/>
               <bitfield caption="Glitch or Debouncing Filter Selection Status"
                         mask="0x40000000"
                         name="P30"/>
               <bitfield caption="Glitch or Debouncing Filter Selection Status"
                         mask="0x80000000"
                         name="P31"/>
            </register>
