Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.9.117/samv71b/atdf/ATSAMV71N21B.atdf
            <register caption="Parallel Capture Mode Register"
                      name="PIO_PCMR"
                      offset="0x0150"
                      rw="RW"
                      size="4">
               <bitfield caption="Parallel Capture Mode Enable"
                         mask="0x00000001"
                         name="PCEN"/>
               <bitfield caption="Parallel Capture Mode Data Size"
                         mask="0x00000030"
                         name="DSIZE"
                         values="PIO_PCMR__DSIZE"/>
               <bitfield caption="Parallel Capture Mode Always Sampling"
                         mask="0x00000200"
                         name="ALWYS"/>
               <bitfield caption="Parallel Capture Mode Half Sampling"
                         mask="0x00000400"
                         name="HALFS"/>
               <bitfield caption="Parallel Capture Mode First Sample"
                         mask="0x00000800"
                         name="FRSTS"/>
            </register>
            <register caption="Parallel Capture Interrupt Enable Register"
                      name="PIO_PCIER"
                      offset="0x0154"
                      rw="W"
                      size="4">
               <bitfield caption="Parallel Capture Mode Data Ready Interrupt Enable"
                         mask="0x00000001"
                         name="DRDY"/>
               <bitfield caption="Parallel Capture Mode Overrun Error Interrupt Enable"
                         mask="0x00000002"
                         name="OVRE"/>
               <bitfield caption="End of Reception Transfer Interrupt Enable"
                         mask="0x00000004"
                         name="ENDRX"/>
               <bitfield caption="Reception Buffer Full Interrupt Enable"
                         mask="0x00000008"
                         name="RXBUFF"/>
            </register>
            <register caption="Parallel Capture Interrupt Disable Register"
                      name="PIO_PCIDR"
                      offset="0x0158"
                      rw="W"
                      size="4">
               <bitfield caption="Parallel Capture Mode Data Ready Interrupt Disable"
                         mask="0x00000001"
                         name="DRDY"/>
               <bitfield caption="Parallel Capture Mode Overrun Error Interrupt Disable"
                         mask="0x00000002"
                         name="OVRE"/>
               <bitfield caption="End of Reception Transfer Interrupt Disable"
                         mask="0x00000004"
                         name="ENDRX"/>
               <bitfield caption="Reception Buffer Full Interrupt Disable"
                         mask="0x00000008"
                         name="RXBUFF"/>
            </register>
            <register caption="Parallel Capture Interrupt Mask Register"
                      name="PIO_PCIMR"
                      offset="0x015C"
                      rw="R"
                      size="4">
               <bitfield caption="Parallel Capture Mode Data Ready Interrupt Mask"
                         mask="0x00000001"
                         name="DRDY"/>
               <bitfield caption="Parallel Capture Mode Overrun Error Interrupt Mask"
                         mask="0x00000002"
                         name="OVRE"/>
               <bitfield caption="End of Reception Transfer Interrupt Mask"
                         mask="0x00000004"
                         name="ENDRX"/>
               <bitfield caption="Reception Buffer Full Interrupt Mask"
                         mask="0x00000008"
                         name="RXBUFF"/>
            </register>
            <register caption="Parallel Capture Interrupt Status Register"
                      name="PIO_PCISR"
                      offset="0x0160"
                      rw="R"
                      size="4">
               <bitfield caption="Parallel Capture Mode Data Ready"
                         mask="0x00000001"
                         name="DRDY"/>
               <bitfield caption="Parallel Capture Mode Overrun Error"
                         mask="0x00000002"
                         name="OVRE"/>
            </register>
            <register caption="Parallel Capture Reception Holding Register"
                      name="PIO_PCRHR"
                      offset="0x0164"
                      rw="R"
                      size="4">
               <bitfield caption="Parallel Capture Mode Reception Data"
                         mask="0xFFFFFFFF"
                         name="RDATA"/>
            </register>
         </register-group>
         <value-group caption="" name="PIO_WPMR__WPKEY">
            <value caption="Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0."
                   name="PASSWD"
                   value="0x50494F"/>
         </value-group>
         <value-group caption="" name="PIO_DRIVER__LINE0">
            <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
            <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
         </value-group>
         <value-group caption="" name="PIO_DRIVER__LINE1">
            <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
            <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
         </value-group>
         <value-group caption="" name="PIO_DRIVER__LINE2">
            <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
            <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
         </value-group>
         <value-group caption="" name="PIO_DRIVER__LINE3">
            <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
            <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
         </value-group>
         <value-group caption="" name="PIO_DRIVER__LINE4">
            <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
            <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
         </value-group>
         <value-group caption="" name="PIO_DRIVER__LINE5">
            <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
            <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
         </value-group>
         <value-group caption="" name="PIO_DRIVER__LINE6">
            <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
            <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
         </value-group>
