Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.9.117/samv71b/atdf/ATSAMV71N21B.atdf
            <register caption="Peripheral Clock Disable Register 0"
                      name="PMC_PCDR0"
                      offset="0x0014"
                      rw="W"
                      size="4"
                      atomic-op="clear:PMC_PCSR0">
               <bitfield caption="Peripheral Clock 7 Disable" mask="0x00000080" name="PID7"/>
               <bitfield caption="Peripheral Clock 8 Disable" mask="0x00000100" name="PID8"/>
               <bitfield caption="Peripheral Clock 10 Disable"
                         mask="0x00000400"
                         name="PID10"/>
               <bitfield caption="Peripheral Clock 11 Disable"
                         mask="0x00000800"
                         name="PID11"/>
               <bitfield caption="Peripheral Clock 13 Disable"
                         mask="0x00002000"
                         name="PID13"/>
               <bitfield caption="Peripheral Clock 14 Disable"
                         mask="0x00004000"
                         name="PID14"/>
               <bitfield caption="Peripheral Clock 15 Disable"
                         mask="0x00008000"
                         name="PID15"/>
               <bitfield caption="Peripheral Clock 16 Disable"
                         mask="0x00010000"
                         name="PID16"/>
               <bitfield caption="Peripheral Clock 18 Disable"
                         mask="0x00040000"
                         name="PID18"/>
               <bitfield caption="Peripheral Clock 19 Disable"
                         mask="0x00080000"
                         name="PID19"/>
               <bitfield caption="Peripheral Clock 20 Disable"
                         mask="0x00100000"
                         name="PID20"/>
               <bitfield caption="Peripheral Clock 21 Disable"
                         mask="0x00200000"
                         name="PID21"/>
               <bitfield caption="Peripheral Clock 22 Disable"
                         mask="0x00400000"
                         name="PID22"/>
               <bitfield caption="Peripheral Clock 23 Disable"
                         mask="0x00800000"
                         name="PID23"/>
               <bitfield caption="Peripheral Clock 24 Disable"
                         mask="0x01000000"
                         name="PID24"/>
               <bitfield caption="Peripheral Clock 25 Disable"
                         mask="0x02000000"
                         name="PID25"/>
               <bitfield caption="Peripheral Clock 26 Disable"
                         mask="0x04000000"
                         name="PID26"/>
               <bitfield caption="Peripheral Clock 27 Disable"
                         mask="0x08000000"
                         name="PID27"/>
               <bitfield caption="Peripheral Clock 28 Disable"
                         mask="0x10000000"
                         name="PID28"/>
               <bitfield caption="Peripheral Clock 29 Disable"
                         mask="0x20000000"
                         name="PID29"/>
               <bitfield caption="Peripheral Clock 30 Disable"
                         mask="0x40000000"
                         name="PID30"/>
               <bitfield caption="Peripheral Clock 31 Disable"
                         mask="0x80000000"
                         name="PID31"/>
            </register>
            <register caption="Peripheral Clock Status Register 0"
                      name="PMC_PCSR0"
                      offset="0x0018"
                      rw="R"
                      size="4">
               <bitfield caption="Peripheral Clock 7 Status" mask="0x00000080" name="PID7"/>
               <bitfield caption="Peripheral Clock 8 Status" mask="0x00000100" name="PID8"/>
               <bitfield caption="Peripheral Clock 10 Status" mask="0x00000400" name="PID10"/>
               <bitfield caption="Peripheral Clock 11 Status" mask="0x00000800" name="PID11"/>
               <bitfield caption="Peripheral Clock 13 Status" mask="0x00002000" name="PID13"/>
               <bitfield caption="Peripheral Clock 14 Status" mask="0x00004000" name="PID14"/>
               <bitfield caption="Peripheral Clock 15 Status" mask="0x00008000" name="PID15"/>
               <bitfield caption="Peripheral Clock 16 Status" mask="0x00010000" name="PID16"/>
               <bitfield caption="Peripheral Clock 18 Status" mask="0x00040000" name="PID18"/>
               <bitfield caption="Peripheral Clock 19 Status" mask="0x00080000" name="PID19"/>
               <bitfield caption="Peripheral Clock 20 Status" mask="0x00100000" name="PID20"/>
               <bitfield caption="Peripheral Clock 21 Status" mask="0x00200000" name="PID21"/>
               <bitfield caption="Peripheral Clock 22 Status" mask="0x00400000" name="PID22"/>
               <bitfield caption="Peripheral Clock 23 Status" mask="0x00800000" name="PID23"/>
               <bitfield caption="Peripheral Clock 24 Status" mask="0x01000000" name="PID24"/>
               <bitfield caption="Peripheral Clock 25 Status" mask="0x02000000" name="PID25"/>
               <bitfield caption="Peripheral Clock 26 Status" mask="0x04000000" name="PID26"/>
               <bitfield caption="Peripheral Clock 27 Status" mask="0x08000000" name="PID27"/>
               <bitfield caption="Peripheral Clock 28 Status" mask="0x10000000" name="PID28"/>
               <bitfield caption="Peripheral Clock 29 Status" mask="0x20000000" name="PID29"/>
               <bitfield caption="Peripheral Clock 30 Status" mask="0x40000000" name="PID30"/>
               <bitfield caption="Peripheral Clock 31 Status" mask="0x80000000" name="PID31"/>
            </register>
            <register caption="UTMI Clock Register"
                      name="CKGR_UCKR"
                      offset="0x001C"
                      rw="RW"
                      size="4">
               <bitfield caption="UTMI PLL Enable" mask="0x00010000" name="UPLLEN"/>
               <bitfield caption="UTMI PLL Start-up Time" mask="0x00F00000" name="UPLLCOUNT"/>
            </register>
            <register caption="Main Oscillator Register"
                      name="CKGR_MOR"
                      offset="0x0020"
                      rw="RW"
                      size="4">
               <bitfield caption="Main Crystal Oscillator Enable"
                         mask="0x00000001"
                         name="MOSCXTEN"/>
               <bitfield caption="Main Crystal Oscillator Bypass"
                         mask="0x00000002"
                         name="MOSCXTBY"/>
               <bitfield caption="Wait Mode Command (Write-only)"
                         mask="0x00000004"
                         name="WAITMODE"/>
               <bitfield caption="Main RC Oscillator Enable"
                         mask="0x00000008"
                         name="MOSCRCEN"/>
               <bitfield caption="Main RC Oscillator Frequency Selection"
                         mask="0x00000070"
                         name="MOSCRCF"
                         values="CKGR_MOR__MOSCRCF"/>
               <bitfield caption="Main Crystal Oscillator Startup Time"
                         mask="0x0000FF00"
                         name="MOSCXTST"/>
               <bitfield caption="Write Access Password"
                         mask="0x00FF0000"
                         name="KEY"
                         values="CKGR_MOR__KEY"/>
               <bitfield caption="Main Clock Oscillator Selection"
                         mask="0x01000000"
                         name="MOSCSEL"/>
               <bitfield caption="Clock Failure Detector Enable"
                         mask="0x02000000"
                         name="CFDEN"/>
               <bitfield caption="32.768 kHz Crystal Oscillator Frequency Monitoring Enable"
                         mask="0x04000000"
                         name="XT32KFME"/>
            </register>
