Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.9.117/samv71b/atdf/ATSAMV71N21B.atdf
            <register caption="Main Clock Frequency Register"
                      name="CKGR_MCFR"
                      offset="0x0024"
                      rw="RW"
                      size="4">
               <bitfield caption="Main Clock Frequency" mask="0x0000FFFF" name="MAINF"/>
               <bitfield caption="Main Clock Frequency Measure Ready"
                         mask="0x00010000"
                         name="MAINFRDY"/>
               <bitfield caption="RC Oscillator Frequency Measure (write-only)"
                         mask="0x00100000"
                         name="RCMEAS"/>
               <bitfield caption="Counter Clock Source Selection"
                         mask="0x01000000"
                         name="CCSS"/>
            </register>
            <register caption="PLLA Register"
                      name="CKGR_PLLAR"
                      offset="0x0028"
                      rw="RW"
                      size="4">
               <bitfield caption="PLLA Front End Divider"
                         mask="0x000000FF"
                         name="DIVA"
                         values="CKGR_PLLAR__DIVA"/>
               <bitfield caption="PLLA Counter" mask="0x00003F00" name="PLLACOUNT"/>
               <bitfield caption="PLLA Multiplier" mask="0x07FF0000" name="MULA"/>
               <bitfield caption="Must Be Set to 1" mask="0x20000000" name="ONE"/>
            </register>
            <register caption="Master Clock Register"
                      name="PMC_MCKR"
                      offset="0x0030"
                      rw="RW"
                      size="4">
               <bitfield caption="Master Clock Source Selection"
                         mask="0x00000003"
                         name="CSS"
                         values="PMC_MCKR__CSS"/>
               <bitfield caption="Processor Clock Prescaler"
                         mask="0x00000070"
                         name="PRES"
                         values="PMC_MCKR__PRES"/>
               <bitfield caption="Master Clock Division"
                         mask="0x00000300"
                         name="MDIV"
                         values="PMC_MCKR__MDIV"/>
               <bitfield caption="UPLL Divider by 2" mask="0x00002000" name="UPLLDIV2"/>
            </register>
            <register caption="USB Clock Register"
                      name="PMC_USB"
                      offset="0x0038"
                      rw="RW"
                      size="4">
               <bitfield caption="USB Input Clock Selection" mask="0x00000001" name="USBS"/>
               <bitfield caption="Divider for USB_48M" mask="0x00000F00" name="USBDIV"/>
            </register>
            <register caption="Programmable Clock Register"
                      name="PMC_PCK"
                      offset="0x40"
                      rw="RW"
                      size="4"
                      count="8">
               <bitfield caption="Programmable Clock Source Selection"
                         mask="0x00000007"
                         name="CSS"
                         values="PMC_PCK__CSS"/>
               <bitfield caption="Programmable Clock Prescaler"
                         mask="0x00000FF0"
                         name="PRES"/>
            </register>
            <register caption="Interrupt Enable Register"
                      name="PMC_IER"
                      offset="0x0060"
                      rw="W"
                      size="4"
                      atomic-op="set:PMC_IMR">
               <bitfield caption="Main Crystal Oscillator Status Interrupt Enable"
                         mask="0x00000001"
                         name="MOSCXTS"/>
               <bitfield caption="PLLA Lock Interrupt Enable" mask="0x00000002" name="LOCKA"/>
               <bitfield caption="Master Clock Ready Interrupt Enable"
                         mask="0x00000008"
                         name="MCKRDY"/>
               <bitfield caption="UTMI PLL Lock Interrupt Enable"
                         mask="0x00000040"
                         name="LOCKU"/>
               <bitfield caption="Programmable Clock Ready 0 Interrupt Enable"
                         mask="0x00000100"
                         name="PCKRDY0"/>
               <bitfield caption="Programmable Clock Ready 1 Interrupt Enable"
                         mask="0x00000200"
                         name="PCKRDY1"/>
               <bitfield caption="Programmable Clock Ready 2 Interrupt Enable"
                         mask="0x00000400"
                         name="PCKRDY2"/>
               <bitfield caption="Programmable Clock Ready 3 Interrupt Enable"
                         mask="0x00000800"
                         name="PCKRDY3"/>
               <bitfield caption="Programmable Clock Ready 4 Interrupt Enable"
                         mask="0x00001000"
                         name="PCKRDY4"/>
               <bitfield caption="Programmable Clock Ready 5 Interrupt Enable"
                         mask="0x00002000"
                         name="PCKRDY5"/>
               <bitfield caption="Programmable Clock Ready 6 Interrupt Enable"
                         mask="0x00004000"
                         name="PCKRDY6"/>
               <bitfield caption="Programmable Clock Ready 7 Interrupt Enable"
                         mask="0x00008000"
                         name="PCKRDY7"/>
               <bitfield caption="Main Clock Source Oscillator Selection Status Interrupt Enable"
                         mask="0x00010000"
                         name="MOSCSELS"/>
               <bitfield caption="Main RC Oscillator Status Interrupt Enable"
                         mask="0x00020000"
                         name="MOSCRCS"/>
               <bitfield caption="Clock Failure Detector Event Interrupt Enable"
                         mask="0x00040000"
                         name="CFDEV"/>
               <bitfield caption="32.768 kHz Crystal Oscillator Error Interrupt Enable"
                         mask="0x00200000"
                         name="XT32KERR"/>
            </register>
            <register caption="Interrupt Disable Register"
                      name="PMC_IDR"
                      offset="0x0064"
                      rw="W"
                      size="4"
                      atomic-op="clear:PMC_IMR">
               <bitfield caption="Main Crystal Oscillator Status Interrupt Disable"
                         mask="0x00000001"
                         name="MOSCXTS"/>
               <bitfield caption="PLLA Lock Interrupt Disable"
                         mask="0x00000002"
                         name="LOCKA"/>
               <bitfield caption="Master Clock Ready Interrupt Disable"
                         mask="0x00000008"
                         name="MCKRDY"/>
               <bitfield caption="UTMI PLL Lock Interrupt Disable"
                         mask="0x00000040"
                         name="LOCKU"/>
               <bitfield caption="Programmable Clock Ready 0 Interrupt Disable"
                         mask="0x00000100"
                         name="PCKRDY0"/>
               <bitfield caption="Programmable Clock Ready 1 Interrupt Disable"
                         mask="0x00000200"
                         name="PCKRDY1"/>
               <bitfield caption="Programmable Clock Ready 2 Interrupt Disable"
                         mask="0x00000400"
                         name="PCKRDY2"/>
               <bitfield caption="Programmable Clock Ready 3 Interrupt Disable"
                         mask="0x00000800"
                         name="PCKRDY3"/>
               <bitfield caption="Programmable Clock Ready 4 Interrupt Disable"
                         mask="0x00001000"
                         name="PCKRDY4"/>
               <bitfield caption="Programmable Clock Ready 5 Interrupt Disable"
                         mask="0x00002000"
                         name="PCKRDY5"/>
               <bitfield caption="Programmable Clock Ready 6 Interrupt Disable"
                         mask="0x00004000"
                         name="PCKRDY6"/>
               <bitfield caption="Programmable Clock Ready 7 Interrupt Disable"
                         mask="0x00008000"
                         name="PCKRDY7"/>
               <bitfield caption="Main Clock Source Oscillator Selection Status Interrupt Disable"
                         mask="0x00010000"
                         name="MOSCSELS"/>
               <bitfield caption="Main RC Status Interrupt Disable"
                         mask="0x00020000"
                         name="MOSCRCS"/>
               <bitfield caption="Clock Failure Detector Event Interrupt Disable"
                         mask="0x00040000"
                         name="CFDEV"/>
               <bitfield caption="32.768 kHz Crystal Oscillator Error Interrupt Disable"
                         mask="0x00200000"
                         name="XT32KERR"/>
            </register>
            <register caption="Status Register"
                      name="PMC_SR"
                      offset="0x0068"
                      rw="R"
                      size="4">
               <bitfield caption="Main Crystal Oscillator Status"
                         mask="0x00000001"
                         name="MOSCXTS"/>
               <bitfield caption="PLLA Lock Status" mask="0x00000002" name="LOCKA"/>
               <bitfield caption="Master Clock Status" mask="0x00000008" name="MCKRDY"/>
               <bitfield caption="UTMI PLL Lock Status" mask="0x00000040" name="LOCKU"/>
               <bitfield caption="Slow Clock Source Oscillator Selection"
                         mask="0x00000080"
                         name="OSCSELS"/>
               <bitfield caption="Programmable Clock Ready 0 Status"
                         mask="0x00000100"
                         name="PCKRDY0"/>
               <bitfield caption="Programmable Clock Ready 1 Status"
                         mask="0x00000200"
                         name="PCKRDY1"/>
               <bitfield caption="Programmable Clock Ready 2 Status"
                         mask="0x00000400"
                         name="PCKRDY2"/>
               <bitfield caption="Programmable Clock Ready 3 Status"
                         mask="0x00000800"
                         name="PCKRDY3"/>
               <bitfield caption="Programmable Clock Ready 4 Status"
                         mask="0x00001000"
                         name="PCKRDY4"/>
               <bitfield caption="Programmable Clock Ready 5 Status"
                         mask="0x00002000"
                         name="PCKRDY5"/>
               <bitfield caption="Programmable Clock Ready 6 Status"
                         mask="0x00004000"
                         name="PCKRDY6"/>
               <bitfield caption="Programmable Clock Ready 7 Status"
                         mask="0x00008000"
                         name="PCKRDY7"/>
               <bitfield caption="Main Clock Source Oscillator Selection Status"
                         mask="0x00010000"
                         name="MOSCSELS"/>
               <bitfield caption="Main RC Oscillator Status"
                         mask="0x00020000"
                         name="MOSCRCS"/>
               <bitfield caption="Clock Failure Detector Event"
                         mask="0x00040000"
                         name="CFDEV"/>
               <bitfield caption="Clock Failure Detector Status"
                         mask="0x00080000"
                         name="CFDS"/>
               <bitfield caption="Clock Failure Detector Fault Output Status"
                         mask="0x00100000"
                         name="FOS"/>
               <bitfield caption="Slow Crystal Oscillator Error"
                         mask="0x00200000"
                         name="XT32KERR"/>
            </register>
