Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.9.117/samv71b/atdf/ATSAMV71N21B.atdf
         <value-group caption="" name="CKGR_MOR__MOSCRCF">
            <value caption="The RC oscillator frequency is at 4 MHz"
                   name="_4_MHz"
                   value="0x0"/>
            <value caption="The RC oscillator frequency is at 8 MHz"
                   name="_8_MHz"
                   value="0x1"/>
            <value caption="The RC oscillator frequency is at 12 MHz"
                   name="_12_MHz"
                   value="0x2"/>
         </value-group>
         <value-group caption="" name="CKGR_MOR__KEY">
            <value caption="Writing any other value in this field aborts the write operation.Always reads as 0."
                   name="PASSWD"
                   value="0x37"/>
         </value-group>
         <value-group caption="" name="CKGR_PLLAR__DIVA">
            <value caption="Divider output is 0 and PLLA is disabled."
                   name="_0"
                   value="0"/>
            <value caption="Divider is bypassed (divide by 1) and PLLA is enabled."
                   name="BYPASS"
                   value="1"/>
         </value-group>
         <value-group caption="" name="PMC_MCKR__CSS">
            <value caption="Slow Clock is selected" name="SLOW_CLK" value="0x0"/>
            <value caption="Main Clock is selected" name="MAIN_CLK" value="0x1"/>
            <value caption="PLLA Clock is selected" name="PLLA_CLK" value="0x2"/>
            <value caption="Divided UPLL Clock is selected"
                   name="UPLL_CLK"
                   value="0x3"/>
         </value-group>
         <value-group caption="" name="PMC_MCKR__PRES">
            <value caption="Selected clock" name="CLK_1" value="0x0"/>
            <value caption="Selected clock divided by 2" name="CLK_2" value="0x1"/>
            <value caption="Selected clock divided by 4" name="CLK_4" value="0x2"/>
            <value caption="Selected clock divided by 8" name="CLK_8" value="0x3"/>
            <value caption="Selected clock divided by 16" name="CLK_16" value="0x4"/>
            <value caption="Selected clock divided by 32" name="CLK_32" value="0x5"/>
            <value caption="Selected clock divided by 64" name="CLK_64" value="0x6"/>
            <value caption="Selected clock divided by 3" name="CLK_3" value="0x7"/>
         </value-group>
         <value-group caption="" name="PMC_MCKR__MDIV">
            <value caption="Master Clock is Prescaler Output Clock divided by 1."
                   name="EQ_PCK"
                   value="0x0"/>
            <value caption="Master Clock is Prescaler Output Clock divided by 2."
                   name="PCK_DIV2"
                   value="0x1"/>
            <value caption="Master Clock is Prescaler Output Clock divided by 4."
                   name="PCK_DIV4"
                   value="0x2"/>
            <value caption="Master Clock is Prescaler Output Clock divided by 3."
                   name="PCK_DIV3"
                   value="0x3"/>
         </value-group>
         <value-group caption="" name="PMC_PCK__CSS">
            <value caption="SLCK is selected" name="SLOW_CLK" value="0x0"/>
            <value caption="MAINCK is selected" name="MAIN_CLK" value="0x1"/>
            <value caption="PLLACK is selected" name="PLLA_CLK" value="0x2"/>
            <value caption="UPLLCKDIV is selected" name="UPLL_CLK" value="0x3"/>
            <value caption="MCK is selected" name="MCK" value="0x4"/>
         </value-group>
         <value-group caption="" name="PMC_FSMR__FLPM">
            <value caption="Flash is in Standby Mode when system enters Wait Mode"
                   name="FLASH_STANDBY"
                   value="0x0"/>
            <value caption="Flash is in Deep-power-down mode when system enters Wait Mode"
                   name="FLASH_DEEP_POWERDOWN"
                   value="0x1"/>
            <value caption="Idle mode" name="FLASH_IDLE" value="0x2"/>
         </value-group>
         <value-group caption="" name="PMC_WPMR__WPKEY">
            <value caption="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0."
                   name="PASSWD"
                   value="0x504D43"/>
         </value-group>
         <value-group caption="" name="PMC_PCR__GCLKCSS">
            <value caption="Slow clock is selected" name="SLOW_CLK" value="0x0"/>
            <value caption="Main clock is selected" name="MAIN_CLK" value="0x1"/>
            <value caption="PLLACK is selected" name="PLLA_CLK" value="0x2"/>
            <value caption="UPLL Clock is selected" name="UPLL_CLK" value="0x3"/>
            <value caption="Master Clock is selected" name="MCK_CLK" value="0x4"/>
         </value-group>
      </module>
      <module name="PWM"
              caption="Pulse Width Modulation Controller"
              id="6343"
              version="Y">
         <register-group name="PWM_CH_NUM" size="32">
            <register caption="PWM Channel Mode Register"
                      name="PWM_CMR"
                      offset="0x00"
                      rw="RW"
                      size="4">
               <bitfield caption="Channel Pre-scaler"
                         mask="0x0000000F"
                         name="CPRE"
                         values="PWM_CMR0__CPRE"/>
               <bitfield caption="Channel Alignment"
                         mask="0x00000100"
                         name="CALG"
                         values="PWM_CMR0__CALG"/>
               <bitfield caption="Channel Polarity"
                         mask="0x00000200"
                         name="CPOL"
                         values="PWM_CMR0__CPOL"/>
               <bitfield caption="Counter Event Selection"
                         mask="0x00000400"
                         name="CES"
                         values="PWM_CMR0__CES"/>
               <bitfield caption="Update Selection"
                         mask="0x00000800"
                         name="UPDS"
                         values="PWM_CMR0__UPDS"/>
               <bitfield caption="Disabled Polarity Inverted" mask="0x00001000" name="DPOLI"/>
               <bitfield caption="Timer Counter Trigger Selection"
                         mask="0x00002000"
                         name="TCTS"/>
               <bitfield caption="Dead-Time Generator Enable" mask="0x00010000" name="DTE"/>
               <bitfield caption="Dead-Time PWMHx Output Inverted"
                         mask="0x00020000"
                         name="DTHI"/>
               <bitfield caption="Dead-Time PWMLx Output Inverted"
                         mask="0x00040000"
                         name="DTLI"/>
               <bitfield caption="Push-Pull Mode" mask="0x00080000" name="PPM"/>
            </register>
            <register caption="PWM Channel Duty Cycle Register"
                      name="PWM_CDTY"
                      offset="0x04"
                      rw="RW"
                      size="4">
               <bitfield caption="Channel Duty-Cycle" mask="0x00FFFFFF" name="CDTY"/>
            </register>
