Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.9.117/samv71b/atdf/ATSAMV71N21B.atdf
            <register caption="PWM Interrupt Status Register 2"
                      name="PWM_ISR2"
                      offset="0x40"
                      rw="R"
                      size="4"
                      atomic-op="clear:PWM_ISR2">
               <bitfield caption="Write Ready for Synchronous Channels Update"
                         mask="0x00000001"
                         name="WRDY"/>
               <bitfield caption="Synchronous Channels Update Underrun Error"
                         mask="0x00000008"
                         name="UNRE"/>
               <bitfield caption="Comparison 0 Match" mask="0x00000100" name="CMPM0"/>
               <bitfield caption="Comparison 1 Match" mask="0x00000200" name="CMPM1"/>
               <bitfield caption="Comparison 2 Match" mask="0x00000400" name="CMPM2"/>
               <bitfield caption="Comparison 3 Match" mask="0x00000800" name="CMPM3"/>
               <bitfield caption="Comparison 4 Match" mask="0x00001000" name="CMPM4"/>
               <bitfield caption="Comparison 5 Match" mask="0x00002000" name="CMPM5"/>
               <bitfield caption="Comparison 6 Match" mask="0x00004000" name="CMPM6"/>
               <bitfield caption="Comparison 7 Match" mask="0x00008000" name="CMPM7"/>
               <bitfield caption="Comparison 0 Update" mask="0x00010000" name="CMPU0"/>
               <bitfield caption="Comparison 1 Update" mask="0x00020000" name="CMPU1"/>
               <bitfield caption="Comparison 2 Update" mask="0x00040000" name="CMPU2"/>
               <bitfield caption="Comparison 3 Update" mask="0x00080000" name="CMPU3"/>
               <bitfield caption="Comparison 4 Update" mask="0x00100000" name="CMPU4"/>
               <bitfield caption="Comparison 5 Update" mask="0x00200000" name="CMPU5"/>
               <bitfield caption="Comparison 6 Update" mask="0x00400000" name="CMPU6"/>
               <bitfield caption="Comparison 7 Update" mask="0x00800000" name="CMPU7"/>
            </register>
            <register caption="PWM Output Override Value Register"
                      name="PWM_OOV"
                      offset="0x44"
                      rw="RW"
                      size="4">
               <bitfield caption="Output Override Value for PWMH output of the channel 0"
                         mask="0x00000001"
                         name="OOVH0"/>
               <bitfield caption="Output Override Value for PWMH output of the channel 1"
                         mask="0x00000002"
                         name="OOVH1"/>
               <bitfield caption="Output Override Value for PWMH output of the channel 2"
                         mask="0x00000004"
                         name="OOVH2"/>
               <bitfield caption="Output Override Value for PWMH output of the channel 3"
                         mask="0x00000008"
                         name="OOVH3"/>
               <bitfield caption="Output Override Value for PWML output of the channel 0"
                         mask="0x00010000"
                         name="OOVL0"/>
               <bitfield caption="Output Override Value for PWML output of the channel 1"
                         mask="0x00020000"
                         name="OOVL1"/>
               <bitfield caption="Output Override Value for PWML output of the channel 2"
                         mask="0x00040000"
                         name="OOVL2"/>
               <bitfield caption="Output Override Value for PWML output of the channel 3"
                         mask="0x00080000"
                         name="OOVL3"/>
            </register>
            <register caption="PWM Output Selection Register"
                      name="PWM_OS"
                      offset="0x48"
                      rw="RW"
                      size="4">
               <bitfield caption="Output Selection for PWMH output of the channel 0"
                         mask="0x00000001"
                         name="OSH0"/>
               <bitfield caption="Output Selection for PWMH output of the channel 1"
                         mask="0x00000002"
                         name="OSH1"/>
               <bitfield caption="Output Selection for PWMH output of the channel 2"
                         mask="0x00000004"
                         name="OSH2"/>
               <bitfield caption="Output Selection for PWMH output of the channel 3"
                         mask="0x00000008"
                         name="OSH3"/>
               <bitfield caption="Output Selection for PWML output of the channel 0"
                         mask="0x00010000"
                         name="OSL0"/>
               <bitfield caption="Output Selection for PWML output of the channel 1"
                         mask="0x00020000"
                         name="OSL1"/>
               <bitfield caption="Output Selection for PWML output of the channel 2"
                         mask="0x00040000"
                         name="OSL2"/>
               <bitfield caption="Output Selection for PWML output of the channel 3"
                         mask="0x00080000"
                         name="OSL3"/>
            </register>
            <register caption="PWM Output Selection Set Register"
                      name="PWM_OSS"
                      offset="0x4C"
                      rw="W"
                      size="4">
               <bitfield caption="Output Selection Set for PWMH output of the channel 0"
                         mask="0x00000001"
                         name="OSSH0"/>
               <bitfield caption="Output Selection Set for PWMH output of the channel 1"
                         mask="0x00000002"
                         name="OSSH1"/>
               <bitfield caption="Output Selection Set for PWMH output of the channel 2"
                         mask="0x00000004"
                         name="OSSH2"/>
               <bitfield caption="Output Selection Set for PWMH output of the channel 3"
                         mask="0x00000008"
                         name="OSSH3"/>
               <bitfield caption="Output Selection Set for PWML output of the channel 0"
                         mask="0x00010000"
                         name="OSSL0"/>
               <bitfield caption="Output Selection Set for PWML output of the channel 1"
                         mask="0x00020000"
                         name="OSSL1"/>
               <bitfield caption="Output Selection Set for PWML output of the channel 2"
                         mask="0x00040000"
                         name="OSSL2"/>
               <bitfield caption="Output Selection Set for PWML output of the channel 3"
                         mask="0x00080000"
                         name="OSSL3"/>
            </register>
            <register caption="PWM Output Selection Clear Register"
                      name="PWM_OSC"
                      offset="0x50"
                      rw="W"
                      size="4">
               <bitfield caption="Output Selection Clear for PWMH output of the channel 0"
                         mask="0x00000001"
                         name="OSCH0"/>
               <bitfield caption="Output Selection Clear for PWMH output of the channel 1"
                         mask="0x00000002"
                         name="OSCH1"/>
               <bitfield caption="Output Selection Clear for PWMH output of the channel 2"
                         mask="0x00000004"
                         name="OSCH2"/>
               <bitfield caption="Output Selection Clear for PWMH output of the channel 3"
                         mask="0x00000008"
                         name="OSCH3"/>
               <bitfield caption="Output Selection Clear for PWML output of the channel 0"
                         mask="0x00010000"
                         name="OSCL0"/>
               <bitfield caption="Output Selection Clear for PWML output of the channel 1"
                         mask="0x00020000"
                         name="OSCL1"/>
               <bitfield caption="Output Selection Clear for PWML output of the channel 2"
                         mask="0x00040000"
                         name="OSCL2"/>
               <bitfield caption="Output Selection Clear for PWML output of the channel 3"
                         mask="0x00080000"
                         name="OSCL3"/>
            </register>
            <register caption="PWM Output Selection Set Update Register"
                      name="PWM_OSSUPD"
                      offset="0x54"
                      rw="W"
                      size="4">
               <bitfield caption="Output Selection Set for PWMH output of the channel 0"
                         mask="0x00000001"
                         name="OSSUPH0"/>
               <bitfield caption="Output Selection Set for PWMH output of the channel 1"
                         mask="0x00000002"
                         name="OSSUPH1"/>
               <bitfield caption="Output Selection Set for PWMH output of the channel 2"
                         mask="0x00000004"
                         name="OSSUPH2"/>
               <bitfield caption="Output Selection Set for PWMH output of the channel 3"
                         mask="0x00000008"
                         name="OSSUPH3"/>
               <bitfield caption="Output Selection Set for PWML output of the channel 0"
                         mask="0x00010000"
                         name="OSSUPL0"/>
               <bitfield caption="Output Selection Set for PWML output of the channel 1"
                         mask="0x00020000"
                         name="OSSUPL1"/>
               <bitfield caption="Output Selection Set for PWML output of the channel 2"
                         mask="0x00040000"
                         name="OSSUPL2"/>
               <bitfield caption="Output Selection Set for PWML output of the channel 3"
                         mask="0x00080000"
                         name="OSSUPL3"/>
            </register>
