Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.9.117/samv71b/atdf/ATSAMV71N21B.atdf
            <register caption="PWM Spread Spectrum Register"
                      name="PWM_SSPR"
                      offset="0xA0"
                      rw="RW"
                      size="4">
               <bitfield caption="Spread Spectrum Limit Value" mask="0x00FFFFFF" name="SPRD"/>
               <bitfield caption="Spread Spectrum Counter Mode"
                         mask="0x01000000"
                         name="SPRDM"/>
            </register>
            <register caption="PWM Spread Spectrum Update Register"
                      name="PWM_SSPUP"
                      offset="0xA4"
                      rw="W"
                      size="4">
               <bitfield caption="Spread Spectrum Limit Value Update"
                         mask="0x00FFFFFF"
                         name="SPRDUP"/>
            </register>
            <register caption="PWM Stepper Motor Mode Register"
                      name="PWM_SMMR"
                      offset="0xB0"
                      rw="RW"
                      size="4">
               <bitfield caption="Gray Count ENable" mask="0x00000001" name="GCEN0"/>
               <bitfield caption="Gray Count ENable" mask="0x00000002" name="GCEN1"/>
               <bitfield caption="DOWN Count" mask="0x00010000" name="DOWN0"/>
               <bitfield caption="DOWN Count" mask="0x00020000" name="DOWN1"/>
            </register>
            <register caption="PWM Fault Protection Value 2 Register"
                      name="PWM_FPV2"
                      offset="0xC0"
                      rw="RW"
                      size="4">
               <bitfield caption="Fault Protection to Hi-Z for PWMH output on channel 0"
                         mask="0x00000001"
                         name="FPZH0"/>
               <bitfield caption="Fault Protection to Hi-Z for PWMH output on channel 1"
                         mask="0x00000002"
                         name="FPZH1"/>
               <bitfield caption="Fault Protection to Hi-Z for PWMH output on channel 2"
                         mask="0x00000004"
                         name="FPZH2"/>
               <bitfield caption="Fault Protection to Hi-Z for PWMH output on channel 3"
                         mask="0x00000008"
                         name="FPZH3"/>
               <bitfield caption="Fault Protection to Hi-Z for PWML output on channel 0"
                         mask="0x00010000"
                         name="FPZL0"/>
               <bitfield caption="Fault Protection to Hi-Z for PWML output on channel 1"
                         mask="0x00020000"
                         name="FPZL1"/>
               <bitfield caption="Fault Protection to Hi-Z for PWML output on channel 2"
                         mask="0x00040000"
                         name="FPZL2"/>
               <bitfield caption="Fault Protection to Hi-Z for PWML output on channel 3"
                         mask="0x00080000"
                         name="FPZL3"/>
            </register>
            <register caption="PWM Write Protection Control Register"
                      name="PWM_WPCR"
                      offset="0xE4"
                      rw="W"
                      size="4">
               <bitfield caption="Write Protection Command"
                         mask="0x00000003"
                         name="WPCMD"
                         values="PWM_WPCR__WPCMD"/>
               <bitfield caption="Write Protection Register Group 0"
                         mask="0x00000004"
                         name="WPRG0"/>
               <bitfield caption="Write Protection Register Group 1"
                         mask="0x00000008"
                         name="WPRG1"/>
               <bitfield caption="Write Protection Register Group 2"
                         mask="0x00000010"
                         name="WPRG2"/>
               <bitfield caption="Write Protection Register Group 3"
                         mask="0x00000020"
                         name="WPRG3"/>
               <bitfield caption="Write Protection Register Group 4"
                         mask="0x00000040"
                         name="WPRG4"/>
               <bitfield caption="Write Protection Register Group 5"
                         mask="0x00000080"
                         name="WPRG5"/>
               <bitfield caption="Write Protection Key"
                         mask="0xFFFFFF00"
                         name="WPKEY"
                         values="PWM_WPCR__WPKEY"/>
            </register>
            <register caption="PWM Write Protection Status Register"
                      name="PWM_WPSR"
                      offset="0xE8"
                      rw="R"
                      size="4">
               <bitfield caption="Write Protect SW Status" mask="0x00000001" name="WPSWS0"/>
               <bitfield caption="Write Protect SW Status" mask="0x00000002" name="WPSWS1"/>
               <bitfield caption="Write Protect SW Status" mask="0x00000004" name="WPSWS2"/>
               <bitfield caption="Write Protect SW Status" mask="0x00000008" name="WPSWS3"/>
               <bitfield caption="Write Protect SW Status" mask="0x00000010" name="WPSWS4"/>
               <bitfield caption="Write Protect SW Status" mask="0x00000020" name="WPSWS5"/>
               <bitfield caption="Write Protect Violation Status"
                         mask="0x00000080"
                         name="WPVS"/>
               <bitfield caption="Write Protect HW Status" mask="0x00000100" name="WPHWS0"/>
               <bitfield caption="Write Protect HW Status" mask="0x00000200" name="WPHWS1"/>
               <bitfield caption="Write Protect HW Status" mask="0x00000400" name="WPHWS2"/>
               <bitfield caption="Write Protect HW Status" mask="0x00000800" name="WPHWS3"/>
               <bitfield caption="Write Protect HW Status" mask="0x00001000" name="WPHWS4"/>
               <bitfield caption="Write Protect HW Status" mask="0x00002000" name="WPHWS5"/>
               <bitfield caption="Write Protect Violation Source"
                         mask="0xFFFF0000"
                         name="WPVSRC"/>
            </register>
            <register-group caption="PWM Comparison 0 Value Register"
                            offset="0x130"
                            name="PWM_CMP"
                            size="16"
                            count="8"
                            name-in-module="PWM_CMP"/>
            <register-group caption="PWM Channel Mode Register"
                            offset="0x200"
                            name="PWM_CH_NUM"
                            count="4"
                            size="32"
                            name-in-module="PWM_CH_NUM"/>
            <register caption="PWM Channel Mode Update Register (ch_num = 0)"
                      name="PWM_CMUPD0"
                      offset="0x400"
                      rw="W"
                      size="4">
               <bitfield caption="Channel Polarity Update" mask="0x00000200" name="CPOLUP"/>
               <bitfield caption="Channel Polarity Inversion Update"
                         mask="0x00002000"
                         name="CPOLINVUP"/>
            </register>
