Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.9.117/samv71b/atdf/ATSAMV71N21B.atdf
            <register caption="PWM Channel Mode Update Register (ch_num = 1)"
                      name="PWM_CMUPD1"
                      offset="0x420"
                      rw="W"
                      size="4">
               <bitfield caption="Channel Polarity Update" mask="0x00000200" name="CPOLUP"/>
               <bitfield caption="Channel Polarity Inversion Update"
                         mask="0x00002000"
                         name="CPOLINVUP"/>
            </register>
            <register caption="PWM External Trigger Register (trg_num = 1)"
                      name="PWM_ETRG1"
                      offset="0x42C"
                      rw="RW"
                      size="4">
               <bitfield caption="Maximum Counter value" mask="0x00FFFFFF" name="MAXCNT"/>
               <bitfield caption="External Trigger Mode"
                         mask="0x03000000"
                         name="TRGMODE"
                         values="PWM_ETRG1__TRGMODE"/>
               <bitfield caption="Edge Selection"
                         mask="0x10000000"
                         name="TRGEDGE"
                         values="PWM_ETRG1__TRGEDGE"/>
               <bitfield caption="Filtered input" mask="0x20000000" name="TRGFILT"/>
               <bitfield caption="Trigger Source" mask="0x40000000" name="TRGSRC"/>
               <bitfield caption="Recoverable Fault Enable" mask="0x80000000" name="RFEN"/>
            </register>
            <register caption="PWM Leading-Edge Blanking Register (trg_num = 1)"
                      name="PWM_LEBR1"
                      offset="0x430"
                      rw="RW"
                      size="4">
               <bitfield caption="Leading-Edge Blanking Delay for TRGINx"
                         mask="0x0000007F"
                         name="LEBDELAY"/>
               <bitfield caption="PWML Falling Edge Enable" mask="0x00010000" name="PWMLFEN"/>
               <bitfield caption="PWML Rising Edge Enable" mask="0x00020000" name="PWMLREN"/>
               <bitfield caption="PWMH Falling Edge Enable" mask="0x00040000" name="PWMHFEN"/>
               <bitfield caption="PWMH Rising Edge Enable" mask="0x00080000" name="PWMHREN"/>
            </register>
            <register caption="PWM Channel Mode Update Register (ch_num = 2)"
                      name="PWM_CMUPD2"
                      offset="0x440"
                      rw="W"
                      size="4">
               <bitfield caption="Channel Polarity Update" mask="0x00000200" name="CPOLUP"/>
               <bitfield caption="Channel Polarity Inversion Update"
                         mask="0x00002000"
                         name="CPOLINVUP"/>
            </register>
            <register caption="PWM External Trigger Register (trg_num = 2)"
                      name="PWM_ETRG2"
                      offset="0x44C"
                      rw="RW"
                      size="4">
               <bitfield caption="Maximum Counter value" mask="0x00FFFFFF" name="MAXCNT"/>
               <bitfield caption="External Trigger Mode"
                         mask="0x03000000"
                         name="TRGMODE"
                         values="PWM_ETRG2__TRGMODE"/>
               <bitfield caption="Edge Selection"
                         mask="0x10000000"
                         name="TRGEDGE"
                         values="PWM_ETRG2__TRGEDGE"/>
               <bitfield caption="Filtered input" mask="0x20000000" name="TRGFILT"/>
               <bitfield caption="Trigger Source" mask="0x40000000" name="TRGSRC"/>
               <bitfield caption="Recoverable Fault Enable" mask="0x80000000" name="RFEN"/>
            </register>
            <register caption="PWM Leading-Edge Blanking Register (trg_num = 2)"
                      name="PWM_LEBR2"
                      offset="0x450"
                      rw="RW"
                      size="4">
               <bitfield caption="Leading-Edge Blanking Delay for TRGINx"
                         mask="0x0000007F"
                         name="LEBDELAY"/>
               <bitfield caption="PWML Falling Edge Enable" mask="0x00010000" name="PWMLFEN"/>
               <bitfield caption="PWML Rising Edge Enable" mask="0x00020000" name="PWMLREN"/>
               <bitfield caption="PWMH Falling Edge Enable" mask="0x00040000" name="PWMHFEN"/>
               <bitfield caption="PWMH Rising Edge Enable" mask="0x00080000" name="PWMHREN"/>
            </register>
            <register caption="PWM Channel Mode Update Register (ch_num = 3)"
                      name="PWM_CMUPD3"
                      offset="0x460"
                      rw="W"
                      size="4">
               <bitfield caption="Channel Polarity Update" mask="0x00000200" name="CPOLUP"/>
               <bitfield caption="Channel Polarity Inversion Update"
                         mask="0x00002000"
                         name="CPOLINVUP"/>
            </register>
         </register-group>
         <value-group caption="" name="PWM_CLK__DIVA">
            <value caption="CLKA clock is turned off" name="CLKA_POFF" value="0"/>
            <value caption="CLKA clock is clock selected by PREA"
                   name="PREA"
                   value="1"/>
         </value-group>
         <value-group caption="" name="PWM_CLK__PREA">
            <value caption="Peripheral clock" name="CLK" value="0x0"/>
            <value caption="Peripheral clock/2" name="CLK_DIV2" value="0x1"/>
            <value caption="Peripheral clock/4" name="CLK_DIV4" value="0x2"/>
            <value caption="Peripheral clock/8" name="CLK_DIV8" value="0x3"/>
            <value caption="Peripheral clock/16" name="CLK_DIV16" value="0x4"/>
            <value caption="Peripheral clock/32" name="CLK_DIV32" value="0x5"/>
            <value caption="Peripheral clock/64" name="CLK_DIV64" value="0x6"/>
            <value caption="Peripheral clock/128" name="CLK_DIV128" value="0x7"/>
            <value caption="Peripheral clock/256" name="CLK_DIV256" value="0x8"/>
            <value caption="Peripheral clock/512" name="CLK_DIV512" value="0x9"/>
            <value caption="Peripheral clock/1024" name="CLK_DIV1024" value="0xA"/>
         </value-group>
         <value-group caption="" name="PWM_CLK__DIVB">
            <value caption="CLKB clock is turned off" name="CLKB_POFF" value="0"/>
            <value caption="CLKB clock is clock selected by PREB"
                   name="PREB"
                   value="1"/>
         </value-group>
