Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.9.117/samv71b/atdf/ATSAMV71N21B.atdf
            <register caption="Time Alarm Register"
                      name="RTC_TIMALR"
                      offset="0x10"
                      rw="RW"
                      size="4">
               <bitfield caption="Second Alarm" mask="0x0000007F" name="SEC"/>
               <bitfield caption="Second Alarm Enable" mask="0x00000080" name="SECEN"/>
               <bitfield caption="Minute Alarm" mask="0x00007F00" name="MIN"/>
               <bitfield caption="Minute Alarm Enable" mask="0x00008000" name="MINEN"/>
               <bitfield caption="Hour Alarm" mask="0x003F0000" name="HOUR"/>
               <bitfield caption="AM/PM Indicator" mask="0x00400000" name="AMPM"/>
               <bitfield caption="Hour Alarm Enable" mask="0x00800000" name="HOUREN"/>
            </register>
            <register caption="Calendar Alarm Register"
                      name="RTC_CALALR"
                      offset="0x14"
                      rw="RW"
                      size="4">
               <bitfield caption="Month Alarm" mask="0x001F0000" name="MONTH"/>
               <bitfield caption="Month Alarm Enable" mask="0x00800000" name="MTHEN"/>
               <bitfield caption="Date Alarm" mask="0x3F000000" name="DATE"/>
               <bitfield caption="Date Alarm Enable" mask="0x80000000" name="DATEEN"/>
            </register>
            <register caption="Status Register"
                      name="RTC_SR"
                      offset="0x18"
                      rw="R"
                      size="4">
               <bitfield caption="Acknowledge for Update"
                         mask="0x00000001"
                         name="ACKUPD"
                         values="RTC_SR__ACKUPD"/>
               <bitfield caption="Alarm Flag"
                         mask="0x00000002"
                         name="ALARM"
                         values="RTC_SR__ALARM"/>
               <bitfield caption="Second Event"
                         mask="0x00000004"
                         name="SEC"
                         values="RTC_SR__SEC"/>
               <bitfield caption="Time Event"
                         mask="0x00000008"
                         name="TIMEV"
                         values="RTC_SR__TIMEV"/>
               <bitfield caption="Calendar Event"
                         mask="0x00000010"
                         name="CALEV"
                         values="RTC_SR__CALEV"/>
               <bitfield caption="Time and/or Date Free Running Error"
                         mask="0x00000020"
                         name="TDERR"
                         values="RTC_SR__TDERR"/>
            </register>
            <register caption="Status Clear Command Register"
                      name="RTC_SCCR"
                      offset="0x1C"
                      rw="W"
                      size="4">
               <bitfield caption="Acknowledge Clear" mask="0x00000001" name="ACKCLR"/>
               <bitfield caption="Alarm Clear" mask="0x00000002" name="ALRCLR"/>
               <bitfield caption="Second Clear" mask="0x00000004" name="SECCLR"/>
               <bitfield caption="Time Clear" mask="0x00000008" name="TIMCLR"/>
               <bitfield caption="Calendar Clear" mask="0x00000010" name="CALCLR"/>
               <bitfield caption="Time and/or Date Free Running Error Clear"
                         mask="0x00000020"
                         name="TDERRCLR"/>
            </register>
            <register caption="Interrupt Enable Register"
                      name="RTC_IER"
                      offset="0x20"
                      rw="W"
                      size="4"
                      atomic-op="set:RTC_IMR">
               <bitfield caption="Acknowledge Update Interrupt Enable"
                         mask="0x00000001"
                         name="ACKEN"/>
               <bitfield caption="Alarm Interrupt Enable" mask="0x00000002" name="ALREN"/>
               <bitfield caption="Second Event Interrupt Enable"
                         mask="0x00000004"
                         name="SECEN"/>
               <bitfield caption="Time Event Interrupt Enable"
                         mask="0x00000008"
                         name="TIMEN"/>
               <bitfield caption="Calendar Event Interrupt Enable"
                         mask="0x00000010"
                         name="CALEN"/>
               <bitfield caption="Time and/or Date Error Interrupt Enable"
                         mask="0x00000020"
                         name="TDERREN"/>
            </register>
            <register caption="Interrupt Disable Register"
                      name="RTC_IDR"
                      offset="0x24"
                      rw="W"
                      size="4"
                      atomic-op="clear:RTC_IMR">
               <bitfield caption="Acknowledge Update Interrupt Disable"
                         mask="0x00000001"
                         name="ACKDIS"/>
               <bitfield caption="Alarm Interrupt Disable" mask="0x00000002" name="ALRDIS"/>
               <bitfield caption="Second Event Interrupt Disable"
                         mask="0x00000004"
                         name="SECDIS"/>
               <bitfield caption="Time Event Interrupt Disable"
                         mask="0x00000008"
                         name="TIMDIS"/>
               <bitfield caption="Calendar Event Interrupt Disable"
                         mask="0x00000010"
                         name="CALDIS"/>
               <bitfield caption="Time and/or Date Error Interrupt Disable"
                         mask="0x00000020"
                         name="TDERRDIS"/>
            </register>
            <register caption="Interrupt Mask Register"
                      name="RTC_IMR"
                      offset="0x28"
                      rw="R"
                      size="4"
                      atomic-op="read:RTC_IMR">
               <bitfield caption="Acknowledge Update Interrupt Mask"
                         mask="0x00000001"
                         name="ACK"/>
               <bitfield caption="Alarm Interrupt Mask" mask="0x00000002" name="ALR"/>
               <bitfield caption="Second Event Interrupt Mask" mask="0x00000004" name="SEC"/>
               <bitfield caption="Time Event Interrupt Mask" mask="0x00000008" name="TIM"/>
               <bitfield caption="Calendar Event Interrupt Mask"
                         mask="0x00000010"
                         name="CAL"/>
               <bitfield caption="Time and/or Date Error Mask"
                         mask="0x00000020"
                         name="TDERR"/>
            </register>
            <register caption="Valid Entry Register"
                      name="RTC_VER"
                      offset="0x2C"
                      rw="R"
                      size="4">
               <bitfield caption="Non-valid Time" mask="0x00000001" name="NVTIM"/>
               <bitfield caption="Non-valid Calendar" mask="0x00000002" name="NVCAL"/>
               <bitfield caption="Non-valid Time Alarm" mask="0x00000004" name="NVTIMALR"/>
               <bitfield caption="Non-valid Calendar Alarm"
                         mask="0x00000008"
                         name="NVCALALR"/>
            </register>
         </register-group>
         <value-group caption="" name="RTC_CR__TIMEVSEL">
            <value caption="Minute change" name="MINUTE" value="0x0"/>
            <value caption="Hour change" name="HOUR" value="0x1"/>
            <value caption="Every day at midnight" name="MIDNIGHT" value="0x2"/>
            <value caption="Every day at noon" name="NOON" value="0x3"/>
         </value-group>
