Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.9.117/samv71b/atdf/ATSAMV71N21B.atdf
            <register caption="Value Register"
                      name="RTT_VR"
                      offset="0x08"
                      rw="R"
                      size="4">
               <bitfield caption="Current Real-time Value" mask="0xFFFFFFFF" name="CRTV"/>
            </register>
            <register caption="Status Register"
                      name="RTT_SR"
                      offset="0x0C"
                      rw="R"
                      size="4">
               <bitfield caption="Real-time Alarm Status (cleared on read)"
                         mask="0x00000001"
                         name="ALMS"/>
               <bitfield caption="Prescaler Roll-over Status (cleared on read)"
                         mask="0x00000002"
                         name="RTTINC"/>
            </register>
         </register-group>
      </module>
      <module name="SPI"
              caption="Serial Peripheral Interface"
              id="6088"
              version="ZM">
         <register-group name="SPI">
            <register caption="Control Register"
                      name="SPI_CR"
                      offset="0x00"
                      rw="W"
                      size="4">
               <bitfield caption="SPI Enable" mask="0x00000001" name="SPIEN"/>
               <bitfield caption="SPI Disable" mask="0x00000002" name="SPIDIS"/>
               <bitfield caption="SPI Software Reset" mask="0x00000080" name="SWRST"/>
               <bitfield caption="Request to Clear the Comparison Trigger"
                         mask="0x00001000"
                         name="REQCLR"/>
               <bitfield caption="Last Transfer" mask="0x01000000" name="LASTXFER"/>
            </register>
            <register caption="Mode Register"
                      name="SPI_MR"
                      offset="0x04"
                      rw="RW"
                      size="4">
               <bitfield caption="Master/Slave Mode"
                         mask="0x00000001"
                         name="MSTR"
                         values="SPI_MR__MSTR"/>
               <bitfield caption="Peripheral Select" mask="0x00000002" name="PS"/>
               <bitfield caption="Chip Select Decode" mask="0x00000004" name="PCSDEC"/>
               <bitfield caption="Mode Fault Detection" mask="0x00000010" name="MODFDIS"/>
               <bitfield caption="Wait Data Read Before Transfer"
                         mask="0x00000020"
                         name="WDRBT"/>
               <bitfield caption="Local Loopback Enable" mask="0x00000080" name="LLB"/>
               <bitfield caption="Peripheral Chip Select"
                         mask="0x000F0000"
                         name="PCS"
                         values="SPI_MR__PCS"/>
               <bitfield caption="Delay Between Chip Selects"
                         mask="0xFF000000"
                         name="DLYBCS"/>
            </register>
            <register caption="Receive Data Register"
                      name="SPI_RDR"
                      offset="0x08"
                      rw="R"
                      size="4">
               <bitfield caption="Receive Data" mask="0x0000FFFF" name="RD"/>
               <bitfield caption="Peripheral Chip Select" mask="0x000F0000" name="PCS"/>
            </register>
            <register caption="Transmit Data Register"
                      name="SPI_TDR"
                      offset="0x0C"
                      rw="W"
                      size="4">
               <bitfield caption="Transmit Data" mask="0x0000FFFF" name="TD"/>
               <bitfield caption="Peripheral Chip Select"
                         mask="0x000F0000"
                         name="PCS"
                         values="SPI_TDR__PCS"/>
               <bitfield caption="Last Transfer" mask="0x01000000" name="LASTXFER"/>
            </register>
            <register caption="Status Register"
                      name="SPI_SR"
                      offset="0x10"
                      rw="R"
                      size="4">
               <bitfield caption="Receive Data Register Full (cleared by reading SPI_RDR)"
                         mask="0x00000001"
                         name="RDRF"/>
               <bitfield caption="Transmit Data Register Empty (cleared by writing SPI_TDR)"
                         mask="0x00000002"
                         name="TDRE"/>
               <bitfield caption="Mode Fault Error (cleared on read)"
                         mask="0x00000004"
                         name="MODF"/>
               <bitfield caption="Overrun Error Status (cleared on read)"
                         mask="0x00000008"
                         name="OVRES"/>
               <bitfield caption="NSS Rising (cleared on read)"
                         mask="0x00000100"
                         name="NSSR"/>
               <bitfield caption="Transmission Registers Empty (cleared by writing SPI_TDR)"
                         mask="0x00000200"
                         name="TXEMPTY"/>
               <bitfield caption="Underrun Error Status (Slave mode only) (cleared on read)"
                         mask="0x00000400"
                         name="UNDES"/>
               <bitfield caption="SPI Enable Status" mask="0x00010000" name="SPIENS"/>
            </register>
            <register caption="Interrupt Enable Register"
                      name="SPI_IER"
                      offset="0x14"
                      rw="W"
                      size="4"
                      atomic-op="set:SPI_IMR">
               <bitfield caption="Receive Data Register Full Interrupt Enable"
                         mask="0x00000001"
                         name="RDRF"/>
               <bitfield caption="SPI Transmit Data Register Empty Interrupt Enable"
                         mask="0x00000002"
                         name="TDRE"/>
               <bitfield caption="Mode Fault Error Interrupt Enable"
                         mask="0x00000004"
                         name="MODF"/>
               <bitfield caption="Overrun Error Interrupt Enable"
                         mask="0x00000008"
                         name="OVRES"/>
               <bitfield caption="NSS Rising Interrupt Enable" mask="0x00000100" name="NSSR"/>
               <bitfield caption="Transmission Registers Empty Enable"
                         mask="0x00000200"
                         name="TXEMPTY"/>
               <bitfield caption="Underrun Error Interrupt Enable"
                         mask="0x00000400"
                         name="UNDES"/>
            </register>
            <register caption="Interrupt Disable Register"
                      name="SPI_IDR"
                      offset="0x18"
                      rw="W"
                      size="4"
                      atomic-op="clear:SPI_IMR">
               <bitfield caption="Receive Data Register Full Interrupt Disable"
                         mask="0x00000001"
                         name="RDRF"/>
               <bitfield caption="SPI Transmit Data Register Empty Interrupt Disable"
                         mask="0x00000002"
                         name="TDRE"/>
               <bitfield caption="Mode Fault Error Interrupt Disable"
                         mask="0x00000004"
                         name="MODF"/>
               <bitfield caption="Overrun Error Interrupt Disable"
                         mask="0x00000008"
                         name="OVRES"/>
               <bitfield caption="NSS Rising Interrupt Disable"
                         mask="0x00000100"
                         name="NSSR"/>
               <bitfield caption="Transmission Registers Empty Disable"
                         mask="0x00000200"
                         name="TXEMPTY"/>
               <bitfield caption="Underrun Error Interrupt Disable"
                         mask="0x00000400"
                         name="UNDES"/>
            </register>
