Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.9.117/samv71b/atdf/ATSAMV71N21B.atdf
         <value-group caption="" name="SUPC_WUIR__WKUPT2">
            <value caption="A falling edge followed by a low level for a period defined by WKUPDBC on the corre-sponding wake-up input forces the wake-up of the core power supply."
                   name="LOW"
                   value="0"/>
            <value caption="A rising edge followed by a high level for a period defined by WKUPDBC on the cor-responding wake-up input forces the wake-up of the core power supply."
                   name="HIGH"
                   value="1"/>
         </value-group>
         <value-group caption="" name="SUPC_WUIR__WKUPT3">
            <value caption="A falling edge followed by a low level for a period defined by WKUPDBC on the corre-sponding wake-up input forces the wake-up of the core power supply."
                   name="LOW"
                   value="0"/>
            <value caption="A rising edge followed by a high level for a period defined by WKUPDBC on the cor-responding wake-up input forces the wake-up of the core power supply."
                   name="HIGH"
                   value="1"/>
         </value-group>
         <value-group caption="" name="SUPC_WUIR__WKUPT4">
            <value caption="A falling edge followed by a low level for a period defined by WKUPDBC on the corre-sponding wake-up input forces the wake-up of the core power supply."
                   name="LOW"
                   value="0"/>
            <value caption="A rising edge followed by a high level for a period defined by WKUPDBC on the cor-responding wake-up input forces the wake-up of the core power supply."
                   name="HIGH"
                   value="1"/>
         </value-group>
         <value-group caption="" name="SUPC_WUIR__WKUPT5">
            <value caption="A falling edge followed by a low level for a period defined by WKUPDBC on the corre-sponding wake-up input forces the wake-up of the core power supply."
                   name="LOW"
                   value="0"/>
            <value caption="A rising edge followed by a high level for a period defined by WKUPDBC on the cor-responding wake-up input forces the wake-up of the core power supply."
                   name="HIGH"
                   value="1"/>
         </value-group>
         <value-group caption="" name="SUPC_WUIR__WKUPT6">
            <value caption="A falling edge followed by a low level for a period defined by WKUPDBC on the corre-sponding wake-up input forces the wake-up of the core power supply."
                   name="LOW"
                   value="0"/>
            <value caption="A rising edge followed by a high level for a period defined by WKUPDBC on the cor-responding wake-up input forces the wake-up of the core power supply."
                   name="HIGH"
                   value="1"/>
         </value-group>
         <value-group caption="" name="SUPC_WUIR__WKUPT7">
            <value caption="A falling edge followed by a low level for a period defined by WKUPDBC on the corre-sponding wake-up input forces the wake-up of the core power supply."
                   name="LOW"
                   value="0"/>
            <value caption="A rising edge followed by a high level for a period defined by WKUPDBC on the cor-responding wake-up input forces the wake-up of the core power supply."
                   name="HIGH"
                   value="1"/>
         </value-group>
         <value-group caption="" name="SUPC_WUIR__WKUPT8">
            <value caption="A falling edge followed by a low level for a period defined by WKUPDBC on the corre-sponding wake-up input forces the wake-up of the core power supply."
                   name="LOW"
                   value="0"/>
            <value caption="A rising edge followed by a high level for a period defined by WKUPDBC on the cor-responding wake-up input forces the wake-up of the core power supply."
                   name="HIGH"
                   value="1"/>
         </value-group>
         <value-group caption="" name="SUPC_WUIR__WKUPT9">
            <value caption="A falling edge followed by a low level for a period defined by WKUPDBC on the corre-sponding wake-up input forces the wake-up of the core power supply."
                   name="LOW"
                   value="0"/>
            <value caption="A rising edge followed by a high level for a period defined by WKUPDBC on the cor-responding wake-up input forces the wake-up of the core power supply."
                   name="HIGH"
                   value="1"/>
         </value-group>
         <value-group caption="" name="SUPC_WUIR__WKUPT10">
            <value caption="A falling edge followed by a low level for a period defined by WKUPDBC on the corre-sponding wake-up input forces the wake-up of the core power supply."
                   name="LOW"
                   value="0"/>
            <value caption="A rising edge followed by a high level for a period defined by WKUPDBC on the cor-responding wake-up input forces the wake-up of the core power supply."
                   name="HIGH"
                   value="1"/>
         </value-group>
         <value-group caption="" name="SUPC_WUIR__WKUPT11">
            <value caption="A falling edge followed by a low level for a period defined by WKUPDBC on the corre-sponding wake-up input forces the wake-up of the core power supply."
                   name="LOW"
                   value="0"/>
            <value caption="A rising edge followed by a high level for a period defined by WKUPDBC on the cor-responding wake-up input forces the wake-up of the core power supply."
                   name="HIGH"
                   value="1"/>
         </value-group>
         <value-group caption="" name="SUPC_WUIR__WKUPT12">
            <value caption="A falling edge followed by a low level for a period defined by WKUPDBC on the corre-sponding wake-up input forces the wake-up of the core power supply."
                   name="LOW"
                   value="0"/>
            <value caption="A rising edge followed by a high level for a period defined by WKUPDBC on the cor-responding wake-up input forces the wake-up of the core power supply."
                   name="HIGH"
                   value="1"/>
         </value-group>
         <value-group caption="" name="SUPC_WUIR__WKUPT13">
            <value caption="A falling edge followed by a low level for a period defined by WKUPDBC on the corre-sponding wake-up input forces the wake-up of the core power supply."
                   name="LOW"
                   value="0"/>
            <value caption="A rising edge followed by a high level for a period defined by WKUPDBC on the cor-responding wake-up input forces the wake-up of the core power supply."
                   name="HIGH"
                   value="1"/>
         </value-group>
         <value-group caption="" name="SUPC_SR__WKUPS">
            <value caption="No wake-up due to the assertion of the WKUP pins has occurred since the last read of SUPC_SR."
                   name="NO"
                   value="0"/>
            <value caption="At least one wake-up due to the assertion of the WKUP pins has occurred since the last read of SUPC_SR."
                   name="PRESENT"
                   value="1"/>
         </value-group>
