Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.9.117/samv71b/atdf/ATSAMV71N21B.atdf
         <value-group caption="" name="TC_BMR__TC0XC0S">
            <value caption="Signal connected to XC0: TCLK0" name="TCLK0" value="0x0"/>
            <value caption="Signal connected to XC0: TIOA1" name="TIOA1" value="0x2"/>
            <value caption="Signal connected to XC0: TIOA2" name="TIOA2" value="0x3"/>
         </value-group>
         <value-group caption="" name="TC_BMR__TC1XC1S">
            <value caption="Signal connected to XC1: TCLK1" name="TCLK1" value="0x0"/>
            <value caption="Signal connected to XC1: TIOA0" name="TIOA0" value="0x2"/>
            <value caption="Signal connected to XC1: TIOA2" name="TIOA2" value="0x3"/>
         </value-group>
         <value-group caption="" name="TC_BMR__TC2XC2S">
            <value caption="Signal connected to XC2: TCLK2" name="TCLK2" value="0x0"/>
            <value caption="Signal connected to XC2: TIOA0" name="TIOA0" value="0x2"/>
            <value caption="Signal connected to XC2: TIOA1" name="TIOA1" value="0x3"/>
         </value-group>
         <value-group caption="" name="TC_WPMR__WPKEY">
            <value caption="Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0."
                   name="PASSWD"
                   value="0x54494D"/>
         </value-group>
      </module>
      <module name="TRNG"
              caption="True Random Number Generator"
              id="6334"
              version="G">
         <register-group name="TRNG">
            <register caption="Control Register"
                      name="TRNG_CR"
                      offset="0x00"
                      rw="W"
                      size="4">
               <bitfield caption="Enables the TRNG to Provide Random Values"
                         mask="0x00000001"
                         name="ENABLE"/>
               <bitfield caption="Security Key"
                         mask="0xFFFFFF00"
                         name="KEY"
                         values="TRNG_CR__KEY"/>
            </register>
            <register caption="Interrupt Enable Register"
                      name="TRNG_IER"
                      offset="0x10"
                      rw="W"
                      size="4"
                      atomic-op="set:TRNG_IMR">
               <bitfield caption="Data Ready Interrupt Enable"
                         mask="0x00000001"
                         name="DATRDY"/>
            </register>
            <register caption="Interrupt Disable Register"
                      name="TRNG_IDR"
                      offset="0x14"
                      rw="W"
                      size="4"
                      atomic-op="clear:TRNG_IMR">
               <bitfield caption="Data Ready Interrupt Disable"
                         mask="0x00000001"
                         name="DATRDY"/>
            </register>
            <register caption="Interrupt Mask Register"
                      name="TRNG_IMR"
                      offset="0x18"
                      rw="R"
                      size="4"
                      atomic-op="read:TRNG_IMR">
               <bitfield caption="Data Ready Interrupt Mask" mask="0x00000001" name="DATRDY"/>
            </register>
            <register caption="Interrupt Status Register"
                      name="TRNG_ISR"
                      offset="0x1C"
                      rw="R"
                      size="4"
                      atomic-op="clear:TRNG_ISR">
               <bitfield caption="Data Ready" mask="0x00000001" name="DATRDY"/>
            </register>
            <register caption="Output Data Register"
                      name="TRNG_ODATA"
                      offset="0x50"
                      rw="R"
                      size="4">
               <bitfield caption="Output Data" mask="0xFFFFFFFF" name="ODATA"/>
            </register>
         </register-group>
         <value-group caption="" name="TRNG_CR__KEY">
            <value caption="Writing any other value in this field aborts the write operation."
                   name="PASSWD"
                   value="0x524E47"/>
         </value-group>
      </module>
      <module name="TWIHS"
              caption="Two-wire Interface High Speed"
              id="11210"
              version="Z">
         <register-group name="TWIHS">
            <register caption="Control Register"
                      name="TWIHS_CR"
                      offset="0x00"
                      rw="W"
                      size="4">
               <bitfield caption="Send a START Condition" mask="0x00000001" name="START"/>
               <bitfield caption="Send a STOP Condition" mask="0x00000002" name="STOP"/>
               <bitfield caption="TWIHS Master Mode Enabled" mask="0x00000004" name="MSEN"/>
               <bitfield caption="TWIHS Master Mode Disabled" mask="0x00000008" name="MSDIS"/>
               <bitfield caption="TWIHS Slave Mode Enabled" mask="0x00000010" name="SVEN"/>
               <bitfield caption="TWIHS Slave Mode Disabled" mask="0x00000020" name="SVDIS"/>
               <bitfield caption="SMBus Quick Command" mask="0x00000040" name="QUICK"/>
               <bitfield caption="Software Reset" mask="0x00000080" name="SWRST"/>
               <bitfield caption="TWIHS High-Speed Mode Enabled"
                         mask="0x00000100"
                         name="HSEN"/>
               <bitfield caption="TWIHS High-Speed Mode Disabled"
                         mask="0x00000200"
                         name="HSDIS"/>
               <bitfield caption="SMBus Mode Enabled" mask="0x00000400" name="SMBEN"/>
               <bitfield caption="SMBus Mode Disabled" mask="0x00000800" name="SMBDIS"/>
               <bitfield caption="Packet Error Checking Enable"
                         mask="0x00001000"
                         name="PECEN"/>
               <bitfield caption="Packet Error Checking Disable"
                         mask="0x00002000"
                         name="PECDIS"/>
               <bitfield caption="PEC Request" mask="0x00004000" name="PECRQ"/>
               <bitfield caption="Bus CLEAR Command" mask="0x00008000" name="CLEAR"/>
               <bitfield caption="Alternative Command Mode Enable"
                         mask="0x00010000"
                         name="ACMEN"/>
               <bitfield caption="Alternative Command Mode Disable"
                         mask="0x00020000"
                         name="ACMDIS"/>
               <bitfield caption="Transmit Holding Register Clear"
                         mask="0x01000000"
                         name="THRCLR"/>
               <bitfield caption="Lock Clear" mask="0x04000000" name="LOCKCLR"/>
               <bitfield caption="FIFO Enable" mask="0x10000000" name="FIFOEN"/>
               <bitfield caption="FIFO Disable" mask="0x20000000" name="FIFODIS"/>
            </register>
            <register caption="Master Mode Register"
                      name="TWIHS_MMR"
                      offset="0x04"
                      rw="RW"
                      size="4">
               <bitfield caption="Internal Device Address Size"
                         mask="0x00000300"
                         name="IADRSZ"
                         values="TWIHS_MMR__IADRSZ"/>
               <bitfield caption="Master Read Direction" mask="0x00001000" name="MREAD"/>
               <bitfield caption="Device Address" mask="0x007F0000" name="DADR"/>
            </register>
            <register caption="Slave Mode Register"
                      name="TWIHS_SMR"
                      offset="0x08"
                      rw="RW"
                      size="4">
               <bitfield caption="Slave Receiver Data Phase NACK enable"
                         mask="0x00000001"
                         name="NACKEN"/>
               <bitfield caption="SMBus Default Address" mask="0x00000004" name="SMDA"/>
               <bitfield caption="SMBus Host Header" mask="0x00000008" name="SMHH"/>
               <bitfield caption="Clock Wait State Disable"
                         mask="0x00000040"
                         name="SCLWSDIS"/>
               <bitfield caption="Slave Address Mask" mask="0x00007F00" name="MASK"/>
               <bitfield caption="Slave Address" mask="0x007F0000" name="SADR"/>
               <bitfield caption="Slave Address 1 Enable" mask="0x10000000" name="SADR1EN"/>
               <bitfield caption="Slave Address 2 Enable" mask="0x20000000" name="SADR2EN"/>
               <bitfield caption="Slave Address 3 Enable" mask="0x40000000" name="SADR3EN"/>
               <bitfield caption="Data Matching Enable" mask="0x80000000" name="DATAMEN"/>
            </register>
            <register caption="Internal Address Register"
                      name="TWIHS_IADR"
                      offset="0x0C"
                      rw="RW"
                      size="4">
               <bitfield caption="Internal Address" mask="0x00FFFFFF" name="IADR"/>
            </register>
            <register caption="Clock Waveform Generator Register"
                      name="TWIHS_CWGR"
                      offset="0x10"
                      rw="RW"
                      size="4">
               <bitfield caption="Clock Low Divider" mask="0x000000FF" name="CLDIV"/>
               <bitfield caption="Clock High Divider" mask="0x0000FF00" name="CHDIV"/>
               <bitfield caption="Clock Divider" mask="0x00070000" name="CKDIV"/>
               <bitfield caption="TWD Hold Time Versus TWCK Falling"
                         mask="0x3F000000"
                         name="HOLD"/>
            </register>
            <register caption="Status Register"
                      name="TWIHS_SR"
                      offset="0x20"
                      rw="R"
                      size="4">
               <bitfield caption="Transmission Completed (cleared by writing TWIHS_THR)"
                         mask="0x00000001"
                         name="TXCOMP"/>
               <bitfield caption="Receive Holding Register Ready (cleared by reading TWIHS_RHR)"
                         mask="0x00000002"
                         name="RXRDY"/>
               <bitfield caption="Transmit Holding Register Ready (cleared by writing TWIHS_THR)"
                         mask="0x00000004"
                         name="TXRDY"/>
               <bitfield caption="Slave Read" mask="0x00000008" name="SVREAD"/>
               <bitfield caption="Slave Access" mask="0x00000010" name="SVACC"/>
               <bitfield caption="General Call Access (cleared on read)"
                         mask="0x00000020"
                         name="GACC"/>
               <bitfield caption="Overrun Error (cleared on read)"
                         mask="0x00000040"
                         name="OVRE"/>
               <bitfield caption="Underrun Error (cleared on read)"
                         mask="0x00000080"
                         name="UNRE"/>
               <bitfield caption="Not Acknowledged (cleared on read)"
                         mask="0x00000100"
                         name="NACK"/>
               <bitfield caption="Arbitration Lost (cleared on read)"
                         mask="0x00000200"
                         name="ARBLST"/>
               <bitfield caption="Clock Wait State" mask="0x00000400" name="SCLWS"/>
               <bitfield caption="End Of Slave Access (cleared on read)"
                         mask="0x00000800"
                         name="EOSACC"/>
               <bitfield caption="Master Code Acknowledge (cleared on read)"
                         mask="0x00010000"
                         name="MCACK"/>
               <bitfield caption="Timeout Error (cleared on read)"
                         mask="0x00040000"
                         name="TOUT"/>
               <bitfield caption="PEC Error (cleared on read)"
                         mask="0x00080000"
                         name="PECERR"/>
               <bitfield caption="SMBus Default Address Match (cleared on read)"
                         mask="0x00100000"
                         name="SMBDAM"/>
               <bitfield caption="SMBus Host Header Address Match (cleared on read)"
                         mask="0x00200000"
                         name="SMBHHM"/>
               <bitfield caption="SCL Line Value" mask="0x01000000" name="SCL"/>
               <bitfield caption="SDA Line Value" mask="0x02000000" name="SDA"/>
            </register>
            <register caption="Interrupt Enable Register"
                      name="TWIHS_IER"
                      offset="0x24"
                      rw="W"
                      size="4"
                      atomic-op="set:TWIHS_IMR">
               <bitfield caption="Transmission Completed Interrupt Enable"
                         mask="0x00000001"
                         name="TXCOMP"/>
               <bitfield caption="Receive Holding Register Ready Interrupt Enable"
                         mask="0x00000002"
                         name="RXRDY"/>
               <bitfield caption="Transmit Holding Register Ready Interrupt Enable"
                         mask="0x00000004"
                         name="TXRDY"/>
               <bitfield caption="Slave Access Interrupt Enable"
                         mask="0x00000010"
                         name="SVACC"/>
               <bitfield caption="General Call Access Interrupt Enable"
                         mask="0x00000020"
                         name="GACC"/>
               <bitfield caption="Overrun Error Interrupt Enable"
                         mask="0x00000040"
                         name="OVRE"/>
               <bitfield caption="Underrun Error Interrupt Enable"
                         mask="0x00000080"
                         name="UNRE"/>
               <bitfield caption="Not Acknowledge Interrupt Enable"
                         mask="0x00000100"
                         name="NACK"/>
               <bitfield caption="Arbitration Lost Interrupt Enable"
                         mask="0x00000200"
                         name="ARBLST"/>
               <bitfield caption="Clock Wait State Interrupt Enable"
                         mask="0x00000400"
                         name="SCL_WS"/>
               <bitfield caption="End Of Slave Access Interrupt Enable"
                         mask="0x00000800"
                         name="EOSACC"/>
               <bitfield caption="Master Code Acknowledge Interrupt Enable"
                         mask="0x00010000"
                         name="MCACK"/>
               <bitfield caption="Timeout Error Interrupt Enable"
                         mask="0x00040000"
                         name="TOUT"/>
               <bitfield caption="PEC Error Interrupt Enable"
                         mask="0x00080000"
                         name="PECERR"/>
               <bitfield caption="SMBus Default Address Match Interrupt Enable"
                         mask="0x00100000"
                         name="SMBDAM"/>
               <bitfield caption="SMBus Host Header Address Match Interrupt Enable"
                         mask="0x00200000"
                         name="SMBHHM"/>
            </register>
            <register caption="Interrupt Disable Register"
                      name="TWIHS_IDR"
                      offset="0x28"
                      rw="W"
                      size="4"
                      atomic-op="clear:TWIHS_IMR">
               <bitfield caption="Transmission Completed Interrupt Disable"
                         mask="0x00000001"
                         name="TXCOMP"/>
               <bitfield caption="Receive Holding Register Ready Interrupt Disable"
                         mask="0x00000002"
                         name="RXRDY"/>
               <bitfield caption="Transmit Holding Register Ready Interrupt Disable"
                         mask="0x00000004"
                         name="TXRDY"/>
               <bitfield caption="Slave Access Interrupt Disable"
                         mask="0x00000010"
                         name="SVACC"/>
               <bitfield caption="General Call Access Interrupt Disable"
                         mask="0x00000020"
                         name="GACC"/>
               <bitfield caption="Overrun Error Interrupt Disable"
                         mask="0x00000040"
                         name="OVRE"/>
               <bitfield caption="Underrun Error Interrupt Disable"
                         mask="0x00000080"
                         name="UNRE"/>
               <bitfield caption="Not Acknowledge Interrupt Disable"
                         mask="0x00000100"
                         name="NACK"/>
               <bitfield caption="Arbitration Lost Interrupt Disable"
                         mask="0x00000200"
                         name="ARBLST"/>
               <bitfield caption="Clock Wait State Interrupt Disable"
                         mask="0x00000400"
                         name="SCL_WS"/>
               <bitfield caption="End Of Slave Access Interrupt Disable"
                         mask="0x00000800"
                         name="EOSACC"/>
               <bitfield caption="Master Code Acknowledge Interrupt Disable"
                         mask="0x00010000"
                         name="MCACK"/>
               <bitfield caption="Timeout Error Interrupt Disable"
                         mask="0x00040000"
                         name="TOUT"/>
               <bitfield caption="PEC Error Interrupt Disable"
                         mask="0x00080000"
                         name="PECERR"/>
               <bitfield caption="SMBus Default Address Match Interrupt Disable"
                         mask="0x00100000"
                         name="SMBDAM"/>
               <bitfield caption="SMBus Host Header Address Match Interrupt Disable"
                         mask="0x00200000"
                         name="SMBHHM"/>
            </register>
