Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.9.117/samv71b/atdf/ATSAMV71N21B.atdf
            <register caption="Interrupt Mask Register"
                      name="TWIHS_IMR"
                      offset="0x2C"
                      rw="R"
                      size="4"
                      atomic-op="read:TWIHS_IMR">
               <bitfield caption="Transmission Completed Interrupt Mask"
                         mask="0x00000001"
                         name="TXCOMP"/>
               <bitfield caption="Receive Holding Register Ready Interrupt Mask"
                         mask="0x00000002"
                         name="RXRDY"/>
               <bitfield caption="Transmit Holding Register Ready Interrupt Mask"
                         mask="0x00000004"
                         name="TXRDY"/>
               <bitfield caption="Slave Access Interrupt Mask"
                         mask="0x00000010"
                         name="SVACC"/>
               <bitfield caption="General Call Access Interrupt Mask"
                         mask="0x00000020"
                         name="GACC"/>
               <bitfield caption="Overrun Error Interrupt Mask"
                         mask="0x00000040"
                         name="OVRE"/>
               <bitfield caption="Underrun Error Interrupt Mask"
                         mask="0x00000080"
                         name="UNRE"/>
               <bitfield caption="Not Acknowledge Interrupt Mask"
                         mask="0x00000100"
                         name="NACK"/>
               <bitfield caption="Arbitration Lost Interrupt Mask"
                         mask="0x00000200"
                         name="ARBLST"/>
               <bitfield caption="Clock Wait State Interrupt Mask"
                         mask="0x00000400"
                         name="SCL_WS"/>
               <bitfield caption="End Of Slave Access Interrupt Mask"
                         mask="0x00000800"
                         name="EOSACC"/>
               <bitfield caption="Master Code Acknowledge Interrupt Mask"
                         mask="0x00010000"
                         name="MCACK"/>
               <bitfield caption="Timeout Error Interrupt Mask"
                         mask="0x00040000"
                         name="TOUT"/>
               <bitfield caption="PEC Error Interrupt Mask" mask="0x00080000" name="PECERR"/>
               <bitfield caption="SMBus Default Address Match Interrupt Mask"
                         mask="0x00100000"
                         name="SMBDAM"/>
               <bitfield caption="SMBus Host Header Address Match Interrupt Mask"
                         mask="0x00200000"
                         name="SMBHHM"/>
            </register>
            <register caption="Receive Holding Register"
                      name="TWIHS_RHR"
                      offset="0x30"
                      rw="R"
                      size="4">
               <bitfield caption="Master or Slave Receive Holding Data"
                         mask="0x000000FF"
                         name="RXDATA"/>
            </register>
            <register caption="Transmit Holding Register"
                      name="TWIHS_THR"
                      offset="0x34"
                      rw="W"
                      size="4">
               <bitfield caption="Master or Slave Transmit Holding Data"
                         mask="0x000000FF"
                         name="TXDATA"/>
            </register>
            <register caption="SMBus Timing Register"
                      name="TWIHS_SMBTR"
                      offset="0x38"
                      rw="RW"
                      size="4">
               <bitfield caption="SMBus Clock Prescaler" mask="0x0000000F" name="PRESC"/>
               <bitfield caption="Slave Clock Stretch Maximum Cycles"
                         mask="0x0000FF00"
                         name="TLOWS"/>
               <bitfield caption="Master Clock Stretch Maximum Cycles"
                         mask="0x00FF0000"
                         name="TLOWM"/>
               <bitfield caption="Clock High Maximum Cycles" mask="0xFF000000" name="THMAX"/>
            </register>
            <register caption="Filter Register"
                      name="TWIHS_FILTR"
                      offset="0x44"
                      rw="RW"
                      size="4">
               <bitfield caption="RX Digital Filter" mask="0x00000001" name="FILT"/>
               <bitfield caption="PAD Filter Enable" mask="0x00000002" name="PADFEN"/>
               <bitfield caption="PAD Filter Config" mask="0x00000004" name="PADFCFG"/>
               <bitfield caption="Digital Filter Threshold" mask="0x00000700" name="THRES"/>
            </register>
            <register caption="SleepWalking Matching Register"
                      name="TWIHS_SWMR"
                      offset="0x4C"
                      rw="RW"
                      size="4">
               <bitfield caption="Slave Address 1" mask="0x0000007F" name="SADR1"/>
               <bitfield caption="Slave Address 2" mask="0x00007F00" name="SADR2"/>
               <bitfield caption="Slave Address 3" mask="0x007F0000" name="SADR3"/>
               <bitfield caption="Data Match" mask="0xFF000000" name="DATAM"/>
            </register>
            <register caption="Write Protection Mode Register"
                      name="TWIHS_WPMR"
                      offset="0xE4"
                      rw="RW"
                      size="4">
               <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
               <bitfield caption="Write Protection Key"
                         mask="0xFFFFFF00"
                         name="WPKEY"
                         values="TWIHS_WPMR__WPKEY"/>
            </register>
            <register caption="Write Protection Status Register"
                      name="TWIHS_WPSR"
                      offset="0xE8"
                      rw="R"
                      size="4">
               <bitfield caption="Write Protection Violation Status"
                         mask="0x00000001"
                         name="WPVS"/>
               <bitfield caption="Write Protection Violation Source"
                         mask="0xFFFFFF00"
                         name="WPVSRC"/>
            </register>
         </register-group>
         <value-group caption="" name="TWIHS_MMR__IADRSZ">
            <value caption="No internal device address" name="NONE" value="0x0"/>
            <value caption="One-byte internal device address"
                   name="_1_BYTE"
                   value="0x1"/>
            <value caption="Two-byte internal device address"
                   name="_2_BYTE"
                   value="0x2"/>
            <value caption="Three-byte internal device address"
                   name="_3_BYTE"
                   value="0x3"/>
         </value-group>
