Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.9.117/samv71b/atdf/ATSAMV71N21B.atdf
         <value-group caption="" name="TWIHS_WPMR__WPKEY">
            <value caption="Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0"
                   name="PASSWD"
                   value="0x545749"/>
         </value-group>
      </module>
      <module name="UART"
              caption="Universal Asynchronous Receiver Transmitter"
              id="6418"
              version="R">
         <register-group name="UART">
            <register caption="Control Register"
                      name="UART_CR"
                      offset="0x0000"
                      rw="W"
                      size="4">
               <bitfield caption="Reset Receiver" mask="0x00000004" name="RSTRX"/>
               <bitfield caption="Reset Transmitter" mask="0x00000008" name="RSTTX"/>
               <bitfield caption="Receiver Enable" mask="0x00000010" name="RXEN"/>
               <bitfield caption="Receiver Disable" mask="0x00000020" name="RXDIS"/>
               <bitfield caption="Transmitter Enable" mask="0x00000040" name="TXEN"/>
               <bitfield caption="Transmitter Disable" mask="0x00000080" name="TXDIS"/>
               <bitfield caption="Reset Status" mask="0x00000100" name="RSTSTA"/>
               <bitfield caption="Request Clear" mask="0x00001000" name="REQCLR"/>
            </register>
            <register caption="Mode Register"
                      name="UART_MR"
                      offset="0x0004"
                      rw="RW"
                      size="4">
               <bitfield caption="Receiver Digital Filter"
                         mask="0x00000010"
                         name="FILTER"
                         values="UART_MR__FILTER"/>
               <bitfield caption="Parity Type"
                         mask="0x00000E00"
                         name="PAR"
                         values="UART_MR__PAR"/>
               <bitfield caption="Baud Rate Source Clock"
                         mask="0x00001000"
                         name="BRSRCCK"
                         values="UART_MR__BRSRCCK"/>
               <bitfield caption="Channel Mode"
                         mask="0x0000C000"
                         name="CHMODE"
                         values="UART_MR__CHMODE"/>
            </register>
            <register caption="Interrupt Enable Register"
                      name="UART_IER"
                      offset="0x0008"
                      rw="W"
                      size="4"
                      atomic-op="set:UART_IMR">
               <bitfield caption="Enable RXRDY Interrupt" mask="0x00000001" name="RXRDY"/>
               <bitfield caption="Enable TXRDY Interrupt" mask="0x00000002" name="TXRDY"/>
               <bitfield caption="Enable Overrun Error Interrupt"
                         mask="0x00000020"
                         name="OVRE"/>
               <bitfield caption="Enable Framing Error Interrupt"
                         mask="0x00000040"
                         name="FRAME"/>
               <bitfield caption="Enable Parity Error Interrupt"
                         mask="0x00000080"
                         name="PARE"/>
               <bitfield caption="Enable TXEMPTY Interrupt" mask="0x00000200" name="TXEMPTY"/>
               <bitfield caption="Enable Comparison Interrupt" mask="0x00008000" name="CMP"/>
            </register>
            <register caption="Interrupt Disable Register"
                      name="UART_IDR"
                      offset="0x000C"
                      rw="W"
                      size="4"
                      atomic-op="clear:UART_IMR">
               <bitfield caption="Disable RXRDY Interrupt" mask="0x00000001" name="RXRDY"/>
               <bitfield caption="Disable TXRDY Interrupt" mask="0x00000002" name="TXRDY"/>
               <bitfield caption="Disable Overrun Error Interrupt"
                         mask="0x00000020"
                         name="OVRE"/>
               <bitfield caption="Disable Framing Error Interrupt"
                         mask="0x00000040"
                         name="FRAME"/>
               <bitfield caption="Disable Parity Error Interrupt"
                         mask="0x00000080"
                         name="PARE"/>
               <bitfield caption="Disable TXEMPTY Interrupt"
                         mask="0x00000200"
                         name="TXEMPTY"/>
               <bitfield caption="Disable Comparison Interrupt" mask="0x00008000" name="CMP"/>
            </register>
            <register caption="Interrupt Mask Register"
                      name="UART_IMR"
                      offset="0x0010"
                      rw="R"
                      size="4"
                      atomic-op="read:UART_IMR">
               <bitfield caption="Mask RXRDY Interrupt" mask="0x00000001" name="RXRDY"/>
               <bitfield caption="Disable TXRDY Interrupt" mask="0x00000002" name="TXRDY"/>
               <bitfield caption="Mask Overrun Error Interrupt"
                         mask="0x00000020"
                         name="OVRE"/>
               <bitfield caption="Mask Framing Error Interrupt"
                         mask="0x00000040"
                         name="FRAME"/>
               <bitfield caption="Mask Parity Error Interrupt" mask="0x00000080" name="PARE"/>
               <bitfield caption="Mask TXEMPTY Interrupt" mask="0x00000200" name="TXEMPTY"/>
               <bitfield caption="Mask Comparison Interrupt" mask="0x00008000" name="CMP"/>
            </register>
            <register caption="Status Register"
                      name="UART_SR"
                      offset="0x0014"
                      rw="R"
                      size="4">
               <bitfield caption="Receiver Ready" mask="0x00000001" name="RXRDY"/>
               <bitfield caption="Transmitter Ready" mask="0x00000002" name="TXRDY"/>
               <bitfield caption="Overrun Error" mask="0x00000020" name="OVRE"/>
               <bitfield caption="Framing Error" mask="0x00000040" name="FRAME"/>
               <bitfield caption="Parity Error" mask="0x00000080" name="PARE"/>
               <bitfield caption="Transmitter Empty" mask="0x00000200" name="TXEMPTY"/>
               <bitfield caption="Comparison Match" mask="0x00008000" name="CMP"/>
            </register>
            <register caption="Receive Holding Register"
                      name="UART_RHR"
                      offset="0x0018"
                      rw="R"
                      size="4">
               <bitfield caption="Received Character" mask="0x000000FF" name="RXCHR"/>
            </register>
