Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.9.117/samv71b/atdf/ATSAMV71N21B.atdf
            <register caption="Interrupt Enable Register"
                      name="US_IER"
                      offset="0x0008"
                      rw="W"
                      size="4"
                      atomic-op="set:US_IMR">
               <mode name="USART" caption="USART" qualifier="US_MR.USART_MODE"/>
               <mode name="SPI" caption="SPI" qualifier="US_MR.USART_MODE"/>
               <mode name="LIN" caption="LIN" qualifier="US_MR.USART_MODE"/>
               <mode name="LON" caption="LON" qualifier="US_MR.USART_MODE"/>
               <bitfield modes="USART"
                         caption="RXRDY Interrupt Enable"
                         mask="0x00000001"
                         name="RXRDY"/>
               <bitfield modes="USART"
                         caption="TXRDY Interrupt Enable"
                         mask="0x00000002"
                         name="TXRDY"/>
               <bitfield modes="USART"
                         caption="Receiver Break Interrupt Enable"
                         mask="0x00000004"
                         name="RXBRK"/>
               <bitfield modes="USART"
                         caption="Overrun Error Interrupt Enable"
                         mask="0x00000020"
                         name="OVRE"/>
               <bitfield modes="USART"
                         caption="Framing Error Interrupt Enable"
                         mask="0x00000040"
                         name="FRAME"/>
               <bitfield modes="USART"
                         caption="Parity Error Interrupt Enable"
                         mask="0x00000080"
                         name="PARE"/>
               <bitfield modes="USART"
                         caption="Timeout Interrupt Enable"
                         mask="0x00000100"
                         name="TIMEOUT"/>
               <bitfield modes="USART"
                         caption="TXEMPTY Interrupt Enable"
                         mask="0x00000200"
                         name="TXEMPTY"/>
               <bitfield modes="USART"
                         caption="Max number of Repetitions Reached Interrupt Enable"
                         mask="0x00000400"
                         name="ITER"/>
               <bitfield modes="USART"
                         caption="Non Acknowledge Interrupt Enable"
                         mask="0x00002000"
                         name="NACK"/>
               <bitfield modes="USART"
                         caption="Ring Indicator Input Change Enable"
                         mask="0x00010000"
                         name="RIIC"/>
               <bitfield modes="USART"
                         caption="Data Set Ready Input Change Enable"
                         mask="0x00020000"
                         name="DSRIC"/>
               <bitfield modes="USART"
                         caption="Data Carrier Detect Input Change Interrupt Enable"
                         mask="0x00040000"
                         name="DCDIC"/>
               <bitfield modes="USART"
                         caption="Clear to Send Input Change Interrupt Enable"
                         mask="0x00080000"
                         name="CTSIC"/>
               <bitfield modes="USART"
                         caption="Manchester Error Interrupt Enable"
                         mask="0x01000000"
                         name="MANE"/>
               <bitfield modes="SPI"
                         caption="RXRDY Interrupt Enable"
                         mask="0x00000001"
                         name="RXRDY"/>
               <bitfield modes="SPI"
                         caption="TXRDY Interrupt Enable"
                         mask="0x00000002"
                         name="TXRDY"/>
               <bitfield modes="SPI"
                         caption="Overrun Error Interrupt Enable"
                         mask="0x00000020"
                         name="OVRE"/>
               <bitfield modes="SPI"
                         caption="TXEMPTY Interrupt Enable"
                         mask="0x00000200"
                         name="TXEMPTY"/>
               <bitfield modes="SPI"
                         caption="Underrun Error Interrupt Enable"
                         mask="0x00000400"
                         name="UNRE"/>
               <bitfield modes="SPI"
                         caption="NSS Line (Driving CTS Pin) Rising or Falling Edge Event"
                         mask="0x00080000"
                         name="NSSE"/>
               <bitfield modes="LIN"
                         caption="RXRDY Interrupt Enable"
                         mask="0x00000001"
                         name="RXRDY"/>
               <bitfield modes="LIN"
                         caption="TXRDY Interrupt Enable"
                         mask="0x00000002"
                         name="TXRDY"/>
               <bitfield modes="LIN"
                         caption="Overrun Error Interrupt Enable"
                         mask="0x00000020"
                         name="OVRE"/>
               <bitfield modes="LIN"
                         caption="Framing Error Interrupt Enable"
                         mask="0x00000040"
                         name="FRAME"/>
               <bitfield modes="LIN"
                         caption="Parity Error Interrupt Enable"
                         mask="0x00000080"
                         name="PARE"/>
               <bitfield modes="LIN"
                         caption="Timeout Interrupt Enable"
                         mask="0x00000100"
                         name="TIMEOUT"/>
               <bitfield modes="LIN"
                         caption="TXEMPTY Interrupt Enable"
                         mask="0x00000200"
                         name="TXEMPTY"/>
               <bitfield modes="LIN"
                         caption="LIN Break Sent or LIN Break Received Interrupt Enable"
                         mask="0x00002000"
                         name="LINBK"/>
               <bitfield modes="LIN"
                         caption="LIN Identifier Sent or LIN Identifier Received Interrupt Enable"
                         mask="0x00004000"
                         name="LINID"/>
               <bitfield modes="LIN"
                         caption="LIN Transfer Completed Interrupt Enable"
                         mask="0x00008000"
                         name="LINTC"/>
               <bitfield modes="LIN"
                         caption="LIN Bus Error Interrupt Enable"
                         mask="0x02000000"
                         name="LINBE"/>
               <bitfield modes="LIN"
                         caption="LIN Inconsistent Synch Field Error Interrupt Enable"
                         mask="0x04000000"
                         name="LINISFE"/>
               <bitfield modes="LIN"
                         caption="LIN Identifier Parity Interrupt Enable"
                         mask="0x08000000"
                         name="LINIPE"/>
               <bitfield modes="LIN"
                         caption="LIN Checksum Error Interrupt Enable"
                         mask="0x10000000"
                         name="LINCE"/>
               <bitfield modes="LIN"
                         caption="LIN Slave Not Responding Error Interrupt Enable"
                         mask="0x20000000"
                         name="LINSNRE"/>
               <bitfield modes="LIN"
                         caption="LIN Synch Tolerance Error Interrupt Enable"
                         mask="0x40000000"
                         name="LINSTE"/>
               <bitfield modes="LIN"
                         caption="LIN Header Timeout Error Interrupt Enable"
                         mask="0x80000000"
                         name="LINHTE"/>
               <bitfield modes="LON"
                         caption="RXRDY Interrupt Enable"
                         mask="0x00000001"
                         name="RXRDY"/>
               <bitfield modes="LON"
                         caption="TXRDY Interrupt Enable"
                         mask="0x00000002"
                         name="TXRDY"/>
               <bitfield modes="LON"
                         caption="Overrun Error Interrupt Enable"
                         mask="0x00000020"
                         name="OVRE"/>
               <bitfield modes="LON"
                         caption="LON Short Frame Error Interrupt Enable"
                         mask="0x00000040"
                         name="LSFE"/>
               <bitfield modes="LON"
                         caption="LON CRC Error Interrupt Enable"
                         mask="0x00000080"
                         name="LCRCE"/>
               <bitfield modes="LON"
                         caption="TXEMPTY Interrupt Enable"
                         mask="0x00000200"
                         name="TXEMPTY"/>
               <bitfield modes="LON"
                         caption="Underrun Error Interrupt Enable"
                         mask="0x00000400"
                         name="UNRE"/>
               <bitfield modes="LON"
                         caption="LON Transmission Done Interrupt Enable"
                         mask="0x01000000"
                         name="LTXD"/>
               <bitfield modes="LON"
                         caption="LON Collision Interrupt Enable"
                         mask="0x02000000"
                         name="LCOL"/>
               <bitfield modes="LON"
                         caption="LON Frame Early Termination Interrupt Enable"
                         mask="0x04000000"
                         name="LFET"/>
               <bitfield modes="LON"
                         caption="LON Reception Done Interrupt Enable"
                         mask="0x08000000"
                         name="LRXD"/>
               <bitfield modes="LON"
                         caption="LON Backlog Overflow Error Interrupt Enable"
                         mask="0x10000000"
                         name="LBLOVFE"/>
            </register>
            <register caption="Interrupt Disable Register"
                      name="US_IDR"
                      offset="0x000C"
                      rw="W"
                      size="4"
                      atomic-op="clear:US_IMR">
               <mode name="USART" caption="USART" qualifier="US_MR.USART_MODE"/>
               <mode name="SPI" caption="SPI" qualifier="US_MR.USART_MODE"/>
               <mode name="LIN" caption="LIN" qualifier="US_MR.USART_MODE"/>
               <mode name="LON" caption="LON" qualifier="US_MR.USART_MODE"/>
               <bitfield modes="USART"
                         caption="RXRDY Interrupt Disable"
                         mask="0x00000001"
                         name="RXRDY"/>
               <bitfield modes="USART"
                         caption="TXRDY Interrupt Disable"
                         mask="0x00000002"
                         name="TXRDY"/>
               <bitfield modes="USART"
                         caption="Receiver Break Interrupt Disable"
                         mask="0x00000004"
                         name="RXBRK"/>
               <bitfield modes="USART"
                         caption="Overrun Error Interrupt Enable"
                         mask="0x00000020"
                         name="OVRE"/>
               <bitfield modes="USART"
                         caption="Framing Error Interrupt Disable"
                         mask="0x00000040"
                         name="FRAME"/>
               <bitfield modes="USART"
                         caption="Parity Error Interrupt Disable"
                         mask="0x00000080"
                         name="PARE"/>
               <bitfield modes="USART"
                         caption="Timeout Interrupt Disable"
                         mask="0x00000100"
                         name="TIMEOUT"/>
               <bitfield modes="USART"
                         caption="TXEMPTY Interrupt Disable"
                         mask="0x00000200"
                         name="TXEMPTY"/>
               <bitfield modes="USART"
                         caption="Max Number of Repetitions Reached Interrupt Disable"
                         mask="0x00000400"
                         name="ITER"/>
               <bitfield modes="USART"
                         caption="Non Acknowledge Interrupt Disable"
                         mask="0x00002000"
                         name="NACK"/>
               <bitfield modes="USART"
                         caption="Ring Indicator Input Change Disable"
                         mask="0x00010000"
                         name="RIIC"/>
               <bitfield modes="USART"
                         caption="Data Set Ready Input Change Disable"
                         mask="0x00020000"
                         name="DSRIC"/>
               <bitfield modes="USART"
                         caption="Data Carrier Detect Input Change Interrupt Disable"
                         mask="0x00040000"
                         name="DCDIC"/>
               <bitfield modes="USART"
                         caption="Clear to Send Input Change Interrupt Disable"
                         mask="0x00080000"
                         name="CTSIC"/>
               <bitfield modes="USART"
                         caption="Manchester Error Interrupt Disable"
                         mask="0x01000000"
                         name="MANE"/>
               <bitfield modes="SPI"
                         caption="RXRDY Interrupt Disable"
                         mask="0x00000001"
                         name="RXRDY"/>
               <bitfield modes="SPI"
                         caption="TXRDY Interrupt Disable"
                         mask="0x00000002"
                         name="TXRDY"/>
               <bitfield modes="SPI"
                         caption="Overrun Error Interrupt Enable"
                         mask="0x00000020"
                         name="OVRE"/>
               <bitfield modes="SPI"
                         caption="TXEMPTY Interrupt Disable"
                         mask="0x00000200"
                         name="TXEMPTY"/>
               <bitfield modes="SPI"
                         caption="SPI Underrun Error Interrupt Disable"
                         mask="0x00000400"
                         name="UNRE"/>
               <bitfield modes="SPI"
                         caption="NSS Line (Driving CTS Pin) Rising or Falling Edge Event"
                         mask="0x00080000"
                         name="NSSE"/>
               <bitfield modes="LIN"
                         caption="RXRDY Interrupt Disable"
                         mask="0x00000001"
                         name="RXRDY"/>
               <bitfield modes="LIN"
                         caption="TXRDY Interrupt Disable"
                         mask="0x00000002"
                         name="TXRDY"/>
               <bitfield modes="LIN"
                         caption="Overrun Error Interrupt Enable"
                         mask="0x00000020"
                         name="OVRE"/>
               <bitfield modes="LIN"
                         caption="Framing Error Interrupt Disable"
                         mask="0x00000040"
                         name="FRAME"/>
               <bitfield modes="LIN"
                         caption="Parity Error Interrupt Disable"
                         mask="0x00000080"
                         name="PARE"/>
               <bitfield modes="LIN"
                         caption="Timeout Interrupt Disable"
                         mask="0x00000100"
                         name="TIMEOUT"/>
               <bitfield modes="LIN"
                         caption="TXEMPTY Interrupt Disable"
                         mask="0x00000200"
                         name="TXEMPTY"/>
               <bitfield modes="LIN"
                         caption="LIN Break Sent or LIN Break Received Interrupt Disable"
                         mask="0x00002000"
                         name="LINBK"/>
               <bitfield modes="LIN"
                         caption="LIN Identifier Sent or LIN Identifier Received Interrupt Disable"
                         mask="0x00004000"
                         name="LINID"/>
               <bitfield modes="LIN"
                         caption="LIN Transfer Completed Interrupt Disable"
                         mask="0x00008000"
                         name="LINTC"/>
               <bitfield modes="LIN"
                         caption="LIN Bus Error Interrupt Disable"
                         mask="0x02000000"
                         name="LINBE"/>
               <bitfield modes="LIN"
                         caption="LIN Inconsistent Synch Field Error Interrupt Disable"
                         mask="0x04000000"
                         name="LINISFE"/>
               <bitfield modes="LIN"
                         caption="LIN Identifier Parity Interrupt Disable"
                         mask="0x08000000"
                         name="LINIPE"/>
               <bitfield modes="LIN"
                         caption="LIN Checksum Error Interrupt Disable"
                         mask="0x10000000"
                         name="LINCE"/>
               <bitfield modes="LIN"
                         caption="LIN Slave Not Responding Error Interrupt Disable"
                         mask="0x20000000"
                         name="LINSNRE"/>
               <bitfield modes="LIN"
                         caption="LIN Synch Tolerance Error Interrupt Disable"
                         mask="0x40000000"
                         name="LINSTE"/>
               <bitfield modes="LIN"
                         caption="LIN Header Timeout Error Interrupt Disable"
                         mask="0x80000000"
                         name="LINHTE"/>
               <bitfield modes="LON"
                         caption="RXRDY Interrupt Disable"
                         mask="0x00000001"
                         name="RXRDY"/>
               <bitfield modes="LON"
                         caption="TXRDY Interrupt Disable"
                         mask="0x00000002"
                         name="TXRDY"/>
               <bitfield modes="LON"
                         caption="Overrun Error Interrupt Enable"
                         mask="0x00000020"
                         name="OVRE"/>
               <bitfield modes="LON"
                         caption="LON Short Frame Error Interrupt Disable"
                         mask="0x00000040"
                         name="LSFE"/>
               <bitfield modes="LON"
                         caption="LON CRC Error Interrupt Disable"
                         mask="0x00000080"
                         name="LCRCE"/>
               <bitfield modes="LON"
                         caption="TXEMPTY Interrupt Disable"
                         mask="0x00000200"
                         name="TXEMPTY"/>
               <bitfield modes="LON"
                         caption="SPI Underrun Error Interrupt Disable"
                         mask="0x00000400"
                         name="UNRE"/>
               <bitfield modes="LON"
                         caption="LON Transmission Done Interrupt Disable"
                         mask="0x01000000"
                         name="LTXD"/>
               <bitfield modes="LON"
                         caption="LON Collision Interrupt Disable"
                         mask="0x02000000"
                         name="LCOL"/>
               <bitfield modes="LON"
                         caption="LON Frame Early Termination Interrupt Disable"
                         mask="0x04000000"
                         name="LFET"/>
               <bitfield modes="LON"
                         caption="LON Reception Done Interrupt Disable"
                         mask="0x08000000"
                         name="LRXD"/>
               <bitfield modes="LON"
                         caption="LON Backlog Overflow Error Interrupt Disable"
                         mask="0x10000000"
                         name="LBLOVFE"/>
            </register>
