Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.9.117/samv71b/atdf/ATSAMV71N21B.atdf
         <value-group caption="" name="US_MR__CHRL">
            <value caption="Character length is 5 bits" name="_5_BIT" value="0x0"/>
            <value caption="Character length is 6 bits" name="_6_BIT" value="0x1"/>
            <value caption="Character length is 7 bits" name="_7_BIT" value="0x2"/>
            <value caption="Character length is 8 bits" name="_8_BIT" value="0x3"/>
         </value-group>
         <value-group caption="" name="US_MR__PAR">
            <value caption="Even parity" name="EVEN" value="0x0"/>
            <value caption="Odd parity" name="ODD" value="0x1"/>
            <value caption="Parity forced to 0 (Space)" name="SPACE" value="0x2"/>
            <value caption="Parity forced to 1 (Mark)" name="MARK" value="0x3"/>
            <value caption="No parity" name="NO" value="0x4"/>
            <value caption="Multidrop mode" name="MULTIDROP" value="0x6"/>
         </value-group>
         <value-group caption="" name="US_MR__NBSTOP">
            <value caption="1 stop bit" name="_1_BIT" value="0x0"/>
            <value caption="1.5 stop bit (SYNC = 0) or reserved (SYNC = 1)"
                   name="_1_5_BIT"
                   value="0x1"/>
            <value caption="2 stop bits" name="_2_BIT" value="0x2"/>
         </value-group>
         <value-group caption="" name="US_MR__CHMODE">
            <value caption="Normal mode" name="NORMAL" value="0x0"/>
            <value caption="Automatic Echo. Receiver input is connected to the TXD pin."
                   name="AUTOMATIC"
                   value="0x1"/>
            <value caption="Local Loopback. Transmitter output is connected to the Receiver Input."
                   name="LOCAL_LOOPBACK"
                   value="0x2"/>
            <value caption="Remote Loopback. RXD pin is internally connected to the TXD pin."
                   name="REMOTE_LOOPBACK"
                   value="0x3"/>
         </value-group>
         <value-group caption="" name="US_MAN__TX_PP">
            <value caption="The preamble is composed of '1's"
                   name="ALL_ONE"
                   value="0x0"/>
            <value caption="The preamble is composed of '0's"
                   name="ALL_ZERO"
                   value="0x1"/>
            <value caption="The preamble is composed of '01's"
                   name="ZERO_ONE"
                   value="0x2"/>
            <value caption="The preamble is composed of '10's"
                   name="ONE_ZERO"
                   value="0x3"/>
         </value-group>
         <value-group caption="" name="US_MAN__RX_PP">
            <value caption="The preamble is composed of '1's"
                   name="ALL_ONE"
                   value="0x0"/>
            <value caption="The preamble is composed of '0's"
                   name="ALL_ZERO"
                   value="0x1"/>
            <value caption="The preamble is composed of '01's"
                   name="ZERO_ONE"
                   value="0x2"/>
            <value caption="The preamble is composed of '10's"
                   name="ONE_ZERO"
                   value="0x3"/>
         </value-group>
         <value-group caption="" name="US_LINMR__NACT">
            <value caption="The USART transmits the response."
                   name="PUBLISH"
                   value="0x0"/>
            <value caption="The USART receives the response."
                   name="SUBSCRIBE"
                   value="0x1"/>
            <value caption="The USART does not transmit and does not receive the response."
                   name="IGNORE"
                   value="0x2"/>
         </value-group>
         <value-group caption="" name="US_WPMR__WPKEY">
            <value caption="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0."
                   name="PASSWD"
                   value="0x555341"/>
         </value-group>
      </module>
      <module name="USBHS"
              caption="USB High-Speed Interface"
              id="11292"
              version="G">
         <register-group name="USBHS_DEVDMA" size="16">
            <register caption="Device DMA Channel Next Descriptor Address Register"
                      name="USBHS_DEVDMANXTDSC"
                      offset="0x00"
                      rw="RW"
                      size="4">
               <bitfield caption="Next Descriptor Address"
                         mask="0xFFFFFFFF"
                         name="NXT_DSC_ADD"/>
            </register>
            <register caption="Device DMA Channel Address Register"
                      name="USBHS_DEVDMAADDRESS"
                      offset="0x04"
                      rw="RW"
                      size="4">
               <bitfield caption="Buffer Address" mask="0xFFFFFFFF" name="BUFF_ADD"/>
            </register>
            <register caption="Device DMA Channel Control Register"
                      name="USBHS_DEVDMACONTROL"
                      offset="0x08"
                      rw="RW"
                      size="4">
               <bitfield caption="Channel Enable Command" mask="0x00000001" name="CHANN_ENB"/>
               <bitfield caption="Load Next Channel Transfer Descriptor Enable Command"
                         mask="0x00000002"
                         name="LDNXT_DSC"/>
               <bitfield caption="End of Transfer Enable Control (OUT transfers only)"
                         mask="0x00000004"
                         name="END_TR_EN"/>
               <bitfield caption="End of Buffer Enable Control"
                         mask="0x00000008"
                         name="END_B_EN"/>
               <bitfield caption="End of Transfer Interrupt Enable"
                         mask="0x00000010"
                         name="END_TR_IT"/>
               <bitfield caption="End of Buffer Interrupt Enable"
                         mask="0x00000020"
                         name="END_BUFFIT"/>
               <bitfield caption="Descriptor Loaded Interrupt Enable"
                         mask="0x00000040"
                         name="DESC_LD_IT"/>
               <bitfield caption="Burst Lock Enable" mask="0x00000080" name="BURST_LCK"/>
               <bitfield caption="Buffer Byte Length (Write-only)"
                         mask="0xFFFF0000"
                         name="BUFF_LENGTH"/>
            </register>
