Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.9.117/samv71b/atdf/ATSAMV71N21B.atdf
            <register caption="Host Pipe Disable Register"
                      name="USBHS_HSTPIPIDR"
                      offset="0x620"
                      rw="W"
                      size="4"
                      count="10"
                      atomic-op="clear:USBHS_HSTPIPIMR">
               <mode name="CTRL"
                     qualifier="USBHS_HSTPIPCFG.PTYPE"
                     value="0"
                     caption="Control Endpoints"/>
               <mode name="ISO"
                     qualifier="USBHS_HSTPIPCFG.PTYPE"
                     value="1"
                     caption="Isochronous Endpoints"/>
               <mode name="BLK"
                     qualifier="USBHS_HSTPIPCFG.PTYPE"
                     value="2"
                     caption="Bulk Endpoints"/>
               <mode name="INTRPT"
                     qualifier="USBHS_HSTPIPCFG.PTYPE"
                     value="3"
                     caption="Interrupt Endpoints"/>
               <bitfield caption="Received IN Data Interrupt Disable"
                         mask="0x00000001"
                         name="RXINEC"/>
               <bitfield caption="Transmitted OUT Data Interrupt Disable"
                         mask="0x00000002"
                         name="TXOUTEC"/>
               <bitfield modes="CTRL BLK"
                         caption="Transmitted SETUP Interrupt Disable"
                         mask="0x00000004"
                         name="TXSTPEC"/>
               <bitfield modes="ISO INTRPT"
                         caption="Underflow Interrupt Disable"
                         mask="0x00000004"
                         name="UNDERFIEC"/>
               <bitfield caption="Pipe Error Interrupt Disable"
                         mask="0x00000008"
                         name="PERREC"/>
               <bitfield caption="NAKed Interrupt Disable" mask="0x00000010" name="NAKEDEC"/>
               <bitfield caption="Overflow Interrupt Disable"
                         mask="0x00000020"
                         name="OVERFIEC"/>
               <bitfield modes="CTRL BLK INTRPT"
                         caption="Received STALLed Interrupt Disable"
                         mask="0x00000040"
                         name="RXSTALLDEC"/>
               <bitfield modes="ISO"
                         caption="CRC Error Interrupt Disable"
                         mask="0x00000040"
                         name="CRCERREC"/>
               <bitfield caption="Short Packet Interrupt Disable"
                         mask="0x00000080"
                         name="SHORTPACKETIEC"/>
               <bitfield caption="Number of Busy Banks Disable"
                         mask="0x00001000"
                         name="NBUSYBKEC"/>
               <bitfield caption="FIFO Control Disable" mask="0x00004000" name="FIFOCONC"/>
               <bitfield caption="Pipe Interrupts Disable HDMA Request Disable"
                         mask="0x00010000"
                         name="PDISHDMAC"/>
               <bitfield caption="Pipe Freeze Disable" mask="0x00020000" name="PFREEZEC"/>
            </register>
            <register caption="Host Pipe IN Request Register"
                      name="USBHS_HSTPIPINRQ"
                      offset="0x650"
                      rw="RW"
                      size="4"
                      count="10">
               <bitfield caption="IN Request Number before Freeze"
                         mask="0x000000FF"
                         name="INRQ"/>
               <bitfield caption="IN Request Mode" mask="0x00000100" name="INMODE"/>
            </register>
            <register caption="Host Pipe Error Register"
                      name="USBHS_HSTPIPERR"
                      offset="0x680"
                      rw="RW"
                      size="4"
                      count="10">
               <bitfield caption="Data Toggle Error" mask="0x00000001" name="DATATGL"/>
               <bitfield caption="Data PID Error" mask="0x00000002" name="DATAPID"/>
               <bitfield caption="Data PID Error" mask="0x00000004" name="PID"/>
               <bitfield caption="Time-Out Error" mask="0x00000008" name="TIMEOUT"/>
               <bitfield caption="CRC16 Error" mask="0x00000010" name="CRC16"/>
               <bitfield caption="Error Counter" mask="0x00000060" name="COUNTER"/>
            </register>
            <register-group caption="Host DMA Channel Next Descriptor Address Register"
                            offset="0x710"
                            name="USBHS_HSTDMA"
                            size="16"
                            count="7"
                            name-in-module="USBHS_HSTDMA"/>
            <register caption="General Control Register"
                      name="USBHS_CTRL"
                      offset="0x0800"
                      rw="RW"
                      size="4">
               <bitfield caption="Remote Device Connection Error Interrupt Enable"
                         mask="0x00000010"
                         name="RDERRE"/>
               <bitfield caption="VBUS Hardware Control" mask="0x00000100" name="VBUSHWC"/>
               <bitfield caption="Freeze USB Clock" mask="0x00004000" name="FRZCLK"/>
               <bitfield caption="USBHS Enable" mask="0x00008000" name="USBE"/>
               <bitfield caption="UID Pin Enable" mask="0x01000000" name="UID"/>
               <bitfield caption="USBHS Mode"
                         mask="0x02000000"
                         name="UIMOD"
                         values="USBHS_CTRL__UIMOD"/>
            </register>
            <register caption="General Status Register"
                      name="USBHS_SR"
                      offset="0x0804"
                      rw="R"
                      size="4">
               <bitfield caption="Remote Device Connection Error Interrupt (Host mode only)"
                         mask="0x00000010"
                         name="RDERRI"/>
               <bitfield caption="Speed Status (Device mode only)"
                         mask="0x00003000"
                         name="SPEED"
                         values="USBHS_SR__SPEED"/>
               <bitfield caption="UTMI Clock Usable" mask="0x00004000" name="CLKUSABLE"/>
            </register>
            <register caption="General Status Clear Register"
                      name="USBHS_SCR"
                      offset="0x0808"
                      rw="W"
                      size="4"
                      atomic-op="clear:USBHS_SR">
               <bitfield caption="Remote Device Connection Error Interrupt Clear"
                         mask="0x00000010"
                         name="RDERRIC"/>
            </register>
            <register caption="General Status Set Register"
                      name="USBHS_SFR"
                      offset="0x080C"
                      rw="W"
                      size="4"
                      atomic-op="set:USBHS_SR">
               <bitfield caption="Remote Device Connection Error Interrupt Set"
                         mask="0x00000010"
                         name="RDERRIS"/>
               <bitfield caption="VBUS Request Set" mask="0x00000200" name="VBUSRQS"/>
            </register>
         </register-group>
         <value-group caption="" name="USBHS_DEVCTRL__SPDCONF">
            <value caption="The peripheral starts in Full-speed mode and performs a high-speed reset to switch to High-speed mode if the host is high-speed-capable."
                   name="NORMAL"
                   value="0x0"/>
            <value caption="For a better consumption, if high speed is not needed."
                   name="LOW_POWER"
                   value="0x1"/>
            <value caption="Forced high speed." name="HIGH_SPEED" value="0x2"/>
            <value caption="The peripheral remains in Full-speed mode whatever the host speed capability."
                   name="FORCED_FS"
                   value="0x3"/>
         </value-group>
         <value-group caption="" name="USBHS_DEVEPTCFG__EPBK">
            <value caption="Single-bank endpoint" name="1_BANK" value="0x0"/>
            <value caption="Double-bank endpoint" name="2_BANK" value="0x1"/>
            <value caption="Triple-bank endpoint" name="3_BANK" value="0x2"/>
         </value-group>
