Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.9.117/samv71b/atdf/ATSAMV71N21B.atdf
            <register caption="Channel Source Address Register"
                      name="XDMAC_CSA"
                      offset="0x10"
                      rw="RW"
                      size="4">
               <bitfield caption="Channel x Source Address" mask="0xFFFFFFFF" name="SA"/>
            </register>
            <register caption="Channel Destination Address Register"
                      name="XDMAC_CDA"
                      offset="0x14"
                      rw="RW"
                      size="4">
               <bitfield caption="Channel x Destination Address" mask="0xFFFFFFFF" name="DA"/>
            </register>
            <register caption="Channel Next Descriptor Address Register"
                      name="XDMAC_CNDA"
                      offset="0x18"
                      rw="RW"
                      size="4">
               <bitfield caption="Channel x Next Descriptor Interface"
                         mask="0x00000001"
                         name="NDAIF"/>
               <bitfield caption="Channel x Next Descriptor Address"
                         mask="0xFFFFFFFC"
                         name="NDA"/>
            </register>
            <register caption="Channel Next Descriptor Control Register"
                      name="XDMAC_CNDC"
                      offset="0x1C"
                      rw="RW"
                      size="4">
               <bitfield caption="Channel x Next Descriptor Enable"
                         mask="0x00000001"
                         name="NDE"
                         values="XDMAC_CNDC__NDE"/>
               <bitfield caption="Channel x Next Descriptor Source Update"
                         mask="0x00000002"
                         name="NDSUP"
                         values="XDMAC_CNDC__NDSUP"/>
               <bitfield caption="Channel x Next Descriptor Destination Update"
                         mask="0x00000004"
                         name="NDDUP"
                         values="XDMAC_CNDC__NDDUP"/>
               <bitfield caption="Channel x Next Descriptor View"
                         mask="0x00000018"
                         name="NDVIEW"
                         values="XDMAC_CNDC__NDVIEW"/>
            </register>
            <register caption="Channel Microblock Control Register"
                      name="XDMAC_CUBC"
                      offset="0x20"
                      rw="RW"
                      size="4">
               <bitfield caption="Channel x Microblock Length"
                         mask="0x00FFFFFF"
                         name="UBLEN"/>
            </register>
            <register caption="Channel Block Control Register"
                      name="XDMAC_CBC"
                      offset="0x24"
                      rw="RW"
                      size="4">
               <bitfield caption="Channel x Block Length" mask="0x00000FFF" name="BLEN"/>
            </register>
            <register caption="Channel Configuration Register"
                      name="XDMAC_CC"
                      offset="0x28"
                      rw="RW"
                      size="4">
               <bitfield caption="Channel x Transfer Type"
                         mask="0x00000001"
                         name="TYPE"
                         values="XDMAC_CC__TYPE"/>
               <bitfield caption="Channel x Memory Burst Size"
                         mask="0x00000006"
                         name="MBSIZE"
                         values="XDMAC_CC__MBSIZE"/>
               <bitfield caption="Channel x Synchronization"
                         mask="0x00000010"
                         name="DSYNC"
                         values="XDMAC_CC__DSYNC"/>
               <bitfield caption="Channel x Software Request Trigger"
                         mask="0x00000040"
                         name="SWREQ"
                         values="XDMAC_CC__SWREQ"/>
               <bitfield caption="Channel x Fill Block of memory"
                         mask="0x00000080"
                         name="MEMSET"
                         values="XDMAC_CC__MEMSET"/>
               <bitfield caption="Channel x Chunk Size"
                         mask="0x00000700"
                         name="CSIZE"
                         values="XDMAC_CC__CSIZE"/>
               <bitfield caption="Channel x Data Width"
                         mask="0x00001800"
                         name="DWIDTH"
                         values="XDMAC_CC__DWIDTH"/>
               <bitfield caption="Channel x Source Interface Identifier"
                         mask="0x00002000"
                         name="SIF"
                         values="XDMAC_CC__SIF"/>
               <bitfield caption="Channel x Destination Interface Identifier"
                         mask="0x00004000"
                         name="DIF"
                         values="XDMAC_CC__DIF"/>
               <bitfield caption="Channel x Source Addressing Mode"
                         mask="0x00030000"
                         name="SAM"
                         values="XDMAC_CC__SAM"/>
               <bitfield caption="Channel x Destination Addressing Mode"
                         mask="0x000C0000"
                         name="DAM"
                         values="XDMAC_CC__DAM"/>
               <bitfield caption="Channel Initialization Terminated (this bit is read-only)"
                         mask="0x00200000"
                         name="INITD"
                         values="XDMAC_CC__INITD"/>
               <bitfield caption="Read in Progress (this bit is read-only)"
                         mask="0x00400000"
                         name="RDIP"
                         values="XDMAC_CC__RDIP"/>
               <bitfield caption="Write in Progress (this bit is read-only)"
                         mask="0x00800000"
                         name="WRIP"
                         values="XDMAC_CC__WRIP"/>
               <bitfield caption="Channel x Peripheral Hardware Request Line Identifier"
                         mask="0x7F000000"
                         name="PERID"
                         values="XDMAC_CC__PERID"/>
            </register>
            <register caption="Channel Data Stride Memory Set Pattern"
                      name="XDMAC_CDS_MSP"
                      offset="0x2C"
                      rw="RW"
                      size="4">
               <bitfield caption="Channel x Source Data stride or Memory Set Pattern"
                         mask="0x0000FFFF"
                         name="SDS_MSP"/>
               <bitfield caption="Channel x Destination Data Stride or Memory Set Pattern"
                         mask="0xFFFF0000"
                         name="DDS_MSP"/>
            </register>
