Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.9.117/samv71b/atdf/ATSAMV71N21B.atdf
            <register offset="0x0000007c"
                      size="4"
                      name="CTR"
                      initval="0x8303C003"
                      rw="R"
                      caption="Cache Type Register">
               <bitfield mask="0x0000000f"
                         name="IMINLINE"
                         caption="Smallest cache line of all the instruction caches under the control of the processor"/>
               <bitfield mask="0x000f0000"
                         name="DMINLINE"
                         caption="Smallest cache line of all the data and unified caches under the core control"/>
               <bitfield mask="0x00f00000"
                         name="ERG"
                         caption="Exclusives Reservation Granule"/>
               <bitfield mask="0x0f000000" name="CWG" caption="Cache Writeback Granule"/>
               <bitfield mask="0xe0000000" name="FORMAT" caption="Register format"/>
            </register>
            <register offset="0x00000080"
                      size="4"
                      name="CCSIDR"
                      initval="0"
                      rw="R"
                      caption="Cache Size ID Register">
               <bitfield mask="0x00000007"
                         name="LineSize"
                         caption="number of words in each cache line"/>
               <bitfield mask="0x00000ff8" name="Associativity" caption="number of ways"/>
               <bitfield mask="0x0ffff000" name="NumSets" caption="number of sets"/>
               <bitfield mask="0x10000000" name="WA" caption="Write allocation support"/>
               <bitfield mask="0x20000000" name="RA" caption="Read allocation support"/>
               <bitfield mask="0x40000000" name="WB" caption="Write-Back support"/>
               <bitfield mask="0x80000000" name="WT" caption="Write-Through support"/>
            </register>
            <register offset="0x00000084"
                      size="4"
                      name="CSSELR"
                      initval="0"
                      caption="Cache Size Selection Register">
               <bitfield mask="0x00000001"
                         name="IND"
                         values="CSSELR_IND"
                         caption="selection of instruction or data cache"/>
               <bitfield mask="0x0000000e" name="LEVEL" caption="cache level selected"/>
            </register>
            <register offset="0x00000088"
                      size="4"
                      name="CPACR"
                      initval="0"
                      caption="Coprocessor Access Control Register">
               <bitfield mask="0x00300000"
                         name="CP10"
                         caption="Access privileges for coprocessor 10."/>
               <bitfield mask="0x00C00000"
                         name="CP11"
                         caption="Access privileges for coprocessor 11."/>
            </register>
            <register offset="0x00000150"
                      size="4"
                      name="ICIALLU"
                      rw="W"
                      caption="I-cache invalidate all to PoU"/>
            <register offset="0x00000158"
                      size="4"
                      name="ICIMVAU"
                      rw="W"
                      caption="I-cache invalidate by MVA to PoU"/>
            <register offset="0x0000015c"
                      size="4"
                      name="DCIMVAC"
                      rw="W"
                      caption="D-cache invalidate by MVA to PoC"/>
            <register offset="0x00000160"
                      size="4"
                      name="DCISW"
                      rw="W"
                      caption="D-cache invalidate by set-way"/>
            <register offset="0x00000164"
                      size="4"
                      name="DCCMVAU"
                      rw="W"
                      caption="D-cache clean by MVA to PoU"/>
            <register offset="0x000000168"
                      size="4"
                      name="DCCMVAC"
                      rw="W"
                      caption="D-cache clean by MVA to PoC"/>
            <register offset="0x0000016c"
                      size="4"
                      name="DCCSW"
                      rw="W"
                      caption="D-cache clean by set-way"/>
            <register offset="0x00000170"
                      size="4"
                      name="DCCIMVAC"
                      rw="W"
                      caption="D-cache clean and invalidate by MVA to PoC"/>
            <register offset="0x00000174"
                      size="4"
                      name="DCCISW"
                      rw="W"
                      caption="D-cache clean and invalidate by set-way"/>
            <register offset="0x00000178"
                      size="4"
                      name="BPIALL"
                      rw="W"
                      caption="Branch predictor invalidate all"/>
            <register offset="0x00000200"
                      size="4"
                      name="STIR"
                      initval="0"
                      rw="W"
                      caption="Software Trigger Interrupt Register">
               <bitfield mask="0x000001ff"
                         name="INTID"
                         caption="Interrupt ID of the interrupt to trigger, in the range 0-239. For example, a value of 0x03 specifies interrupt IRQ3."/>
            </register>
            <register offset="0x00000240"
                      size="4"
                      name="MVFR0"
                      initval="0x10110021"
                      rw="R"
                      caption="Media and VFP Feature Register 0">
            </register>
            <register offset="0x00000244"
                      size="4"
                      name="MVFR1"
                      initval="0x10110021"
                      rw="R"
                      caption="Media and VFP Feature Register 1">
            </register>
            <register offset="0x00000248"
                      size="4"
                      name="MVFR2"
                      initval="0x10110021"
                      rw="R"
                      caption="Media and VFP Feature Register 2">
            </register>
         </register-group>
         <value-group name="RETTOBASE">
            <value value="0"
                   name="VALUE_0"
                   caption="there are preempted active exceptions to execute"/>
            <value value="1"
                   name="VALUE_1"
                   caption="there are no active exceptions, or the currently-executing exception is the only active exception"/>
         </value-group>
         <value-group name="ISRPREEMPT">
            <value value="0" name="VALUE_0" caption="Will not service"/>
            <value value="1" name="VALUE_1" caption="Will service a pending exception"/>
         </value-group>
         <value-group name="PENDSTCLR">
            <value value="0" name="VALUE_0" caption="no effect"/>
            <value value="1"
                   name="VALUE_1"
                   caption="removes the pending state from the SysTick exception"/>
         </value-group>
