Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.9.117/samv71b/atdf/ATSAMV71N21B.atdf
      <module name="NVIC" caption="Nested Vectored Interrupt Controller">
         <register-group name="NVIC" caption="Nested Vectored Interrupt Controller">
            <register offset="0x00000000"
                      size="4"
                      name="ISER"
                      count="8"
                      initval="0"
                      caption="Interrupt Set Enable Register n">
               <bitfield mask="0xffffffff" name="SETENA" caption="Interrupt set enable bits"/>
            </register>
            <register offset="0x00000080"
                      size="4"
                      name="ICER"
                      count="8"
                      initval="0"
                      caption="Interrupt Clear Enable Register n">
               <bitfield mask="0xffffffff"
                         name="CLRENA"
                         caption="Interrupt clear-enable bits"/>
            </register>
            <register offset="0x00000100"
                      size="4"
                      name="ISPR"
                      count="8"
                      initval="0"
                      caption="Interrupt Set Pending Register n">
               <bitfield mask="0xffffffff"
                         name="SETPEND"
                         caption="Interrupt set-pending bits"/>
            </register>
            <register offset="0x00000180"
                      size="4"
                      name="ICPR"
                      count="8"
                      initval="0"
                      caption="Interrupt Clear Pending Register n">
               <bitfield mask="0xffffffff"
                         name="CLRPEND"
                         caption="Interrupt clear-pending bits"/>
            </register>
            <register offset="0x00000200"
                      size="4"
                      name="IABR"
                      count="8"
                      initval="0"
                      caption="Interrupt Active bit Register n">
               <bitfield mask="0xffffffff" name="ACTIVE" caption="Interrupt active flags"/>
            </register>
            <register offset="0x00000300"
                      size="1"
                      name="IP"
                      count="240"
                      initval="0"
                      caption="Interrupt Priority Register (8Bit wide) n">
               <bitfield mask="0x000000ff" name="PRI0" caption="Priority of interrupt 0"/>
            </register>
            <register offset="0x00000e00"
                      size="4"
                      name="STIR"
                      initval="0"
                      rw="W"
                      caption="Software Trigger Interrupt Register">
               <bitfield mask="0x000001ff"
                         name="INTID"
                         caption="Interrupt ID of the interrupt to trigger, in the range 0-239. For example, a value of 0x03 specifies interrupt IRQ3."/>
            </register>
         </register-group>
      </module>
      <module name="MPU" caption="Memory Protection Unit">
         <register-group name="MPU" caption="Memory Protection Unit Registers">
            <register offset="0x00000000"
                      size="4"
                      name="TYPE"
                      initval="0x00001000"
                      caption="MPU Type Register">
               <bitfield mask="0x00000001"
                         name="SEPARATE"
                         caption="Indicates support for unified or separate instruction and date memory maps."/>
               <bitfield mask="0x0000FF00"
                         name="DREGION"
                         caption="Indicates the number of supported MPU instruction regions."/>
               <bitfield mask="0x00FF0000"
                         name="IREGION"
                         caption="Indicates the number of supported MPU data regions."/>
            </register>
            <register offset="0x00000004"
                      size="4"
                      name="CTRL"
                      initval="0x00000000"
                      caption="MPU Control Register">
               <bitfield mask="0x00000001" name="ENABLE" caption="Enables the MPU"/>
               <bitfield mask="0x00000002"
                         name="HFNMIENA"
                         caption="Enables the operation of MPU during hard fault, NMI, and FAULTMASK handlers."/>
               <bitfield mask="0x00000004"
                         name="PRIVDEFENA"
                         caption="Enables privileged software access to the default memory map."/>
            </register>
            <register offset="0x00000008"
                      size="4"
                      name="RNR"
                      caption="MPU Region Number Register">
               <bitfield mask="0x000000FF"
                         name="REGION"
                         caption="Indicates the MPU region referenced by the MPU_RBAR and MPU_RASR registers."/>
            </register>
            <register offset="0x0000000C"
                      size="4"
                      name="RBAR"
                      caption="MPU Region Base Address Register">
               <bitfield mask="0x0000000F" name="REGION" caption="MPU region field."/>
               <bitfield mask="0x00000010"
                         name="VALID"
                         caption="MPU Region Number valid bit."/>
               <bitfield mask="0xFFFFFFE0" name="ADDR" caption="Region base address field."/>
            </register>
            <register offset="0x00000010"
                      size="4"
                      name="RASR"
                      caption="MPU Region Attribute and Size Register">
               <bitfield mask="0x00000001" name="ENABLE" caption="Region enable bit."/>
               <bitfield mask="0x0000003E"
                         name="SIZE"
                         caption="Specifies the size of the MPU protection region."/>
               <bitfield mask="0x0000FF00" name="SRD" caption="Subregion disable bits."/>
               <bitfield mask="0x00010000"
                         name="B"
                         caption="MPU access permission attributes."/>
               <bitfield mask="0x00020000"
                         name="C"
                         caption="MPU access permission attributes."/>
               <bitfield mask="0x00040000" name="S" caption="Shareable bit."/>
               <bitfield mask="0x00380000"
                         name="TEX"
                         caption="MPU access permission attributes."/>
               <bitfield mask="0x07000000" name="AP" caption="Access permission field."/>
               <bitfield mask="0x10000000"
                         name="XN"
                         caption="Instruction access disable bit."/>
            </register>
            <register offset="0x00000014"
                      size="4"
                      name="RBAR_A1"
                      caption="MPU Alias 1 Region Base Address Register">
                </register>
            <register offset="0x00000018"
                      size="4"
                      name="RASR_A1"
                      caption="MPU Alias 1 Region Attribute and Size Register">
                </register>
            <register offset="0x0000001c"
                      size="4"
                      name="RBAR_A2"
                      caption="MPU Alias 2 Region Base Address Register">
                </register>
